[{"title":"读书笔记-边城-沈从文","date":"2017-03-28T08:53:10.000Z","path":"2017/03/28/20170328-读书笔记-边城-沈从文/","text":"作品：边城作者：沈从文 边城-题记我这本书只预备给一些“本身已离开了学校，或始终就无从接近学校，还认识些中国文字，置身于文学理论、文学批评以及说谎造谣消息所达不到的那种职务上，在那个社会里生活，而且极关心全个民族在空间与时间下所有的好处与坏处”的人去看。他们真知道当前农村是什么，想知道过去农村是什么，他们必也愿意从这本书上同时还知道点世界一小角隅的农村与军人。 翠翠在风日里长养着，把皮肤变得黑黑的，触目为青山绿水，一对眸子清明如水晶。自然既长养她且教育她，为人天真活泼，处处俨然如一只小兽物。人又那么乖，如山头黄麂一样，从不想到残忍事情，从不发愁，从不动气。平时在渡船上遇陌生人对她有所注意时，便把光光的眼睛瞅着那陌生人，作成随时皆可举步逃入深山的神气，但明白了人无机心后，就又从从容容的在水边玩耍了。 茶峒地方凭水依山筑城，近山的一面，城墙如一条长蛇，缘山爬去。临水一面则在城外河边留出余地设码头，湾泊小小篷船。船下行时运桐油青盐，染色的五-子。 这些诚实勇敢的人，也爱利，也仗义，同一般当地人相似。不拘救人救物，却同样在一种愉快冒险行为中，做得十分敏捷勇敢，使人见及不能不为之喝彩。 某年秋天，那原来执事人死去了，顺顺作了这样一个代替者。那时他还只五十岁，为人既明事明理，正直和平又不爱财，故无人对他年龄怀疑。 年幼的则气质近于那个白脸黑发的母亲，不爱说话，眼眉却秀拔出群，一望即知其为人聪明而又富于感情。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"读书笔记-流血的仕途：李斯与秦帝国-上-01","date":"2017-01-28T15:45:23.000Z","path":"2017/01/28/20170128-读书笔记-流血的仕途：李斯与秦帝国-上-01/","text":"作品：流血的仕途：李斯与秦帝国-上作者：曹昇 1-46 警惕啊，一不小心，坐以待时就将变成坐以待毙。在这个年轻人身上，竟有着比相国吕不韦更强悍更霸道的气势。这种气势之于男人，就好比气质之于女人，先天可以生得，后天未必养得。李斯开口说话了：“汝等庸人，安敢轻吾！汝等恃以辱吾者，徒蛮力耳，今为看门之犬，固得其所也。岂不闻，一人之辩，胜于九鼎之宝；三寸之舌，强于百万雄师，此李斯所恃也。倘李斯用事，相国也不足为尔等免祸，尔等必死也。”言迄远去。比较体验过死亡者和未曾体验过死亡者，其活着的姿态有大差异。前者向死而生，后者为死而生。李斯答道：“夫子惠吾已多也，李斯愧无以报。今李斯功未成，名不就，不得光耀师门，心实耻之。为人弟子，倘只知假师尊之名以邀幸，不知挟师尊之术以自立，此小人之道，非君子之道，李斯不屑为也。郑国是战国时代有名的水利专家，那时候科学家的地位和今天没法比，比较受人歧视，说话也没人爱听，心里那个憋屈啊。李斯这一问，郑国甚至都有些感动了，也甭管李斯是不是自己的知音，便取出一幅地图，在上面指点着讲解开来：“且看，泾水洛水之间，为关中之地，幅员广袤，然苦于无水之故，田地贫瘠，民终岁垦作，而仍饥以殍也。郑国之策，首起雍州云阳县西南二十五里，凿泾水，自中山西邸瓠口为渠，傍北山，经泾阳、三原、高陵、临潼、富平、蒲城而东注洛水，三百余里以溉田，用注填阏之水，溉泽卤之地，不数年，则原田弥望，畎浍连属，由来榛棘之所，遍为粳稻之川，有丰岁，无凶年，关中为沃野，秦得以富强。”他当即决定，要对吕氏家族企业进行战略调整，并跑回家去做老爸的思想工作。他问他老爸：“种田的投资回报率是多少？”“1000％。”“做珠玉生意的投资回报率呢？”“10000％。”“把一个穷困潦倒的王孙扶植成秦国君主的投资回报率呢？”“∞％。”小贾贾于市，大贾贾于朝。吕不韦和他老爸统一了思想认识之后，要开始做大贾了。瞧咱们的吕不韦，面对∞％的投资回报率，依然面不改色心不跳。他以无比的冷静和耐心，向世人展现出他高明的智慧和超凡的策略。当时，秦国为昭王在位，异人的老爸安国君为太子。安国君有许多老婆，异人的母亲夏姬只是其中之一，而且不招安国君喜欢。安国君老婆虽多，却独独宠幸华阳夫人一个。偏偏华阳夫人无子，于是吕不韦往说之。所有的女人都有一个共同特点，那就是她们都是女人。吕不韦是出了名的花花公子，而且花得相当有技术含量。对付女人，他大有一雄可将十万雌之勇。他成日泡在脂粉堆里，对女人的生理渴望，他能得之于手而有数于心，堪比轮扁斫轮。对女人的心理需求，他能不以目视而以神遇，有如庖丁解牛。因此，尽管他长相薄陋拙恶，但凡和他好过的女子，却如同中了魔咒似的，心里再也容不下别的男人，成天什么事也不想做，就想着和吕不韦一好再好，好上加好。然而，吕不韦是那种万花丛中过、只叶不沾身的主，用粗俗的话讲，就是打一枪换一个地方。那些被他遗弃的女人，一辈子也忘却不了那一夜的风情，从此只能生活在痛苦和惆怅之中，所谓一遇吕郎误终生是也。吕不韦的名气在女人圈中越来越大，所以，虽然他远非什么羊车璧人，但出门转一圈，偶尔也能蒙个掷果盈车回来。以这样的吕不韦，对付一个久处深宫的华阳夫人，自然是绰绰有余。他对华阳夫人说道：“吾闻之，以色事人者，色衰而爱弛。今夫人事太子，甚爱而无子，不以此时早自结于诸子中贤孝者，举立以为嫡而子之，夫在则重尊，夫百岁之后，所子者为王，终不失势，此所谓一言而万世之利也。不以繁华时树本，即色衰爱弛后，虽欲开一语，尚可得乎？今异人贤智，结诸侯宾客遍天下，以夫人为天，日夜泣思太子及夫人，而自知中男也，次不得为嫡，其母又不得幸，自附夫人，夫人诚以此时拔以为嫡子，夫人则竟世有宠于秦矣。”庭院梅花盛开，遍地落红，吕不韦仰望长天，心内交战，莫能自决。他脸色忽青忽紫，反射出内心难以抵抗的疼痛。然而，我却不揣恶意地以为，这是幸福的苦恼，没有同情的必要。无论美女还是江山，得到任何一样都够一般人高呼“夫复何求”了。权力最终击败了美貌，权力欲压倒了爱欲。赵姬跪在吕不韦面前，攀附着他的双腿，满面珍珠泪，一片心酸词，红唇间的湿润，似仍期待着一次甜蜜的亲吻。然而，离别的时候到了，你可以软弱，而我必须坚强。且让欢爱如烟云散去，散成缥缈的回忆。当我疲倦地归来，有人举一壶酒，为我祈福，然而那人将不再是你，你在另外一个男人怀里。午夜时分，吕不韦敲开了异人的大门，将他心爱的女人拱手相让。他将赵姬送到了另外一个男人的家里，送到了另外一个男人的床上。当异人得意地将赵姬压在身下恣意狂荡时，吕不韦独自踌躇在邯郸昏暗的雨巷，如野兽般号啕大哭。权力是一种人们有意不提及的宗教，而且是排他性的一神教，除权力本身之外，不再有别的神。它并不要求信徒虔诚，却没有信徒不是百分之百的虔诚。它给予信徒随时离去的自由，却没有信徒愿意行使这种自由。君不见，漫漫的仕途，有如错综复杂的林中之路，在那高可蔽日的密林深处，埋葬了多少男人的青春，见证了多少女人的眼泪。对易牙来说，儿子是拿来烹的；对吴起来说，妻子是拿来杀的；对汉唐皇帝来说，女儿是拿来卖的；对刘粲来说，庶母是拿来睡的；对刘子业来说，姐妹是拿来奸的；对杨广来说，老爸是拿来弑的；对赵光义来说，兄弟是拿来砍的……权力喜欢这样的表演，它从不闭上自己的眼睛。红颜会化成骷髅，英雄将沦为白骨，官员的坟茔上长满荒草，皇帝的陵墓旁游人拍照，只有江山依旧，权力不死。有谁能夸口是他在驾驭权力，而不是被权力所驾驭？以速朽之人生，驾驭不死之权力，吾未之信也。且说异人得了赵姬，日宠夜幸，爱眷非常。赵姬不久便有了身孕，十月之后，产下一个男婴。异人大喜，为男婴取名嬴政，并将赵姬立为夫人。嬴政三岁那年，异人的爷爷，也就是秦昭王，派遣将军王齮大举进攻赵国。数十万秦军一路势如破竹，直杀到邯郸城下。国都邯郸一破，也就意味着赵国的灭亡。赵王惶恐之下，欲杀异人以报复秦国。幸好吕不韦交游广泛，提前得此情报，忙与异人商议出逃。…后来，魏国公子信陵君窃符救赵，大破秦师于邯郸城下，王齮败退，撤回秦国。随着秦赵两国的关系渐渐缓和，赵姬和嬴政的境况这才慢慢好转。赵国虽然不再有诛杀他们的念头，却依然将他们当作人质扣押看管着。当时，燕国的太子丹也在赵国做人质。太子丹和嬴政年纪相当，两个小孩时常在一起玩耍。然而，这一等就是六年。到嬴政长到九岁时，在位五十六年的秦昭王终于死了，太子安国君总算是熬出了头，坐上了秦王的宝座，是为孝文王，华阳夫人成了王后，异人也顺理成章地成为太子。鉴于异人已经成了秦国的接班人，为了和这个未来的秦王搞好关系，赵国也乐得做个顺水人情，将赵姬和嬴政送归秦国，使其一家团圆。安国君刚刚举办完即位大典，两天后就突然一命呜呼了。异人继位，是为庄襄王，尊华阳夫人为华阳太后，生母夏姬为夏太后，吕不韦也随之一步登天，成了一人之下、万人之上的秦国丞相，封为文信侯，食河南洛阳十万户。秦国朝政大权，皆掌在吕不韦一人之手。人，一生要走很多很多路，重要的却只有那么几步；人，一生要说很多很多话，重要的却只有那么几句；人，一生会认识很多很多人，重要的却只有那么几个。成功者和失败者的区别，也许就只在于他们多走对了一两步路，多说对了一两句话，多交对了一两个人而已。从李斯迈过寝宫门槛的那一步开始，他便在用狂放的肢体语言刺激着吕不韦的神经。他高昂着头，目不斜视，步伐宽阔而有力，浑身散发出利剑出鞘的夺人气势。在他英俊而棱角分明的脸上，看不到丝毫乞讨者的惶恐和悲伤，有的却是施舍者的自在和怜悯。他仿佛并非身处万民仰望的高高庙堂，在他看来，这里只是一处任他纵马游缰的无主草场。李斯向吕不韦行礼，仅长揖而已。李斯的狂妄，半是天性，半是蓄意。所谓大知似狂，不痴不狂，其名不彰。吕不韦半躺着，审视着李斯。尽管他不动声色，但无疑李斯已强加给他这样的印象：这是一个高傲而强悍的人，这是一个专注而坚毅的人，这是一个可以被毁灭但绝不会被打败的人，关键是，这样的人永远知道自己在做什么，并且总是心无旁骛、全力以赴。一个成功的仕途经营者，无疑也应该是一位出色的心理学家。早在当年一起就学于荀卿门下之时，李斯和韩非就游说的技巧作过无数次的探讨，并达成这样的共识：“说人之法，有如用兵之道，攻心为上。必先知所说之心，尔后方以吾说当之。”知所说之心，找出他心中最柔软的那一部分，只须轻轻一击，便足以辉煌大胜。荀卿老先生的得意高足，号称有动摇山河之志，经天纬地之才。李斯将吕不韦的举动尽收眼底，道：“普天之下，人所共知，相国为人仁而下士，士无贤不肖皆谦而礼交之，不敢以其富贵骄士。士以此方数千里争往咸阳，求归相国门下。相国敬贤爱士之名，近播大秦之境，远动六国之听。是以，诸侯以为，有秦诸相，相国最贤。”给吕不韦扣上这样一顶他非戴不可的高帽之后，李斯又道：“李斯背井离乡，抛妻弃子，远来咸阳，慕相国之名，以相国为重士也。李斯虽愚，投奔相国之心却不可谓不诚，然而方才登门，未及入室，便横遭护府武士之辱，辱之不足，又复殴之，此事为当日数十人所共见，非李斯所敢编造。此八武士不死，则天下之士必视相国之门为畏途，心寒而不敢至也。六国皆以相国之敬贤爱士为有名无实，心耻而传为笑也。以八武士之人头，回相国之美誉，换天下之归心。相国明见高远，何去何从，当不必再待李斯多言。”李斯调整了一下自己的呼吸，道：“相国以韩人仕秦，封文信侯，食十万户，金印紫绶，代理万机。秦王年少，以相国为仲父，计不下席，谋不出廊庙，大秦天下，尽托于相国一人之手。李斯道：“相国并无谋反之心，相国自知，李斯也知。然而秦王知乎？秦国知乎？以李斯之见，相国虽无谋反之心，所行却有谋反之嫌。相国大开门户，延揽天下士人，至三千之数，此乃慕虚名而处实祸也。”李斯激动地在吕不韦面前走来走去，晃得吕不韦很是眼晕。李斯边走边说：“养士如养虎。据李斯所闻，相国门下之士，只知有相国，不知有秦王，倚仗相国之权势与尊宠，儒以文乱法，侠以武犯禁，嚣张跋扈，欺凌柔弱，咸阳城内已是怨声载道，百姓皆因此迁罪于相国。相国门下蓄此猛虎三千，人虽畏之，也必疑之，谓相国有不臣之志，此则养虎又有如养祸也。信陵君以宗室之亲，养士纳贤，尚遭魏王嫌恨，无以自明，废而不用，乃沉溺酒色，郁郁而终。相国本为韩人，常言有云，非我族类，其心必异。相国虽忠于秦室，而秦人终不能信相国也。如今相国已是大权独揽，乾坤独断，秦国任君予取予求。语曰‘日中则移，月满则亏’，相国不思韬光养晦，乘盛而返，反而遍求天下之士，集于一门，非为谋反，何为此举？今日主少国疑，举国皆疑相国将仿田常代齐之故事，废秦王而自代。宗室重臣恨相国已久也，一旦以养士自重，图谋不轨为名，诬相国以谋反之罪，群起而攻之，则相国危急于累卵，而不寿于朝生也。为今之计，唯尽诛门下之士，门下之士既去，则相国无须自辩，天下已尽知相国必无谋反之心也。相国也可长为文信侯，世世称孤。当断不断，必受其乱，愿君孰计之！”李斯一笑，道：“李斯早知相国宅心仁厚，必不忍取士人之性命。夫人之立功，岂不期于成全邪？身与名俱全者，上也。名可法而身死者，其次也。名在僇辱而身全者，下也。李斯不才，却有一计，能保相国身名两全。”吕不韦原本傲慢的语气开始变得真诚而谦恭，道：“不韦鲁钝，愿得先生教之。”李斯悠悠说道：“所谓养士，重在一个养字。李斯以为，相国对门下士人娇纵太过，优其俸禄，肆其所为，不忍稍加约束之。相国以为如此厚待士人，士人必感相国之恩。殊不知，凡士人者，必自恃其才，而相国于门下士人无所任事，养之有日，用之无时，士人怀才而不得见用，长而久之，必心生怨恨，此士人之通病也。授士以金，不如授之以事，相国若能听李斯一言，则门下士人皆能各展所长，各任其用，人人皆自以为相国重己也。如是，则士人归心，相国坐收其利而不得其害。此方得养士之妙法也。”","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"历史","slug":"历史","permalink":"http://sniperkaka.com/tags/历史/"}]},{"title":"读书笔记-此间的少年-江南-03","date":"2017-01-21T15:16:09.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-03/","text":"作品：此间的少年作者：江南 61.赤条条来去无牵挂，洗净繁华，他独孤求败还就是个独孤求败，如此而已。62.独孤求败搞历史的，对这个有体会。先代的抗秦民主联盟领袖项羽冲进咸阳，立马把大秦博士们的藏书都给烧了，在那之前不久，秦始皇刚刚兴高采烈地烧了一把。而西戎诸国本来有个牛逼烘烘的亚历山大图书馆，好不容易建立起来，百年后就被另一个牛人恺撒给烧了。七百年后又有阿拉伯大将阿默尔将军操把大弯刀杀进亚历山大城，看见大堆的书，都是恺撒当年手下的漏网之鱼。阿默尔将军轻松的点根烟就要烧，士兵说将军您可别乱烧啊，也许还有些有用的书呢。阿默尔从口袋里抄出一本《古兰经》来，说这里的书我们可以用如下分类法分为两种，《古兰经》和《非古兰经》，对不对？士兵说您这二分法当然对，不过好像纯粹是废话啊。阿默尔说，《非古兰经》是邪书，要烧！士兵说有道理，那要是有《古兰经》呢？阿默尔说你没看见我手里已经有一本了么？剩下的多余，也烧，想看我这本借你看。真到了乱世，学府脆弱得如同独孤求败当年那点学术名声。63.黄蓉的横空出世彻底打乱了这个宿舍的江湖秩序，仿佛一剑西来天下俯首，合令狐冲和杨康两个人的力量，也只是刷新一下黄蓉获胜的回合数。令狐冲还好，他脸皮比较厚，输了就输了，直接当乌龟，缩头就跑。杨康就比较壮烈了，他在这个游戏上输了无数的鸡腿给黄蓉。他的习惯是先赌一条，输了先赊账，再赌两条，如果成功则可以翻本，如果失败他就继续赊账赌四条。当杨康把赌注加到512条的时候，他就彻底崩溃了，号称终身退出江湖，并且咬牙欠着黄蓉的鸡腿就是不还。堂堂两条江湖汉子，最后沦落到只能趁黄蓉拉郭靖出去蹦迪的间隙悄悄修炼武功，其中的凄惨简直让人侧目。不过趁妖女拉郭靖去蹦迪的机会能重温一下当年的光辉年代，令狐冲和杨康并没什么羞耻感。64.让我们还是沿着时间那根细线走回十年前，汴大校庆的夜晚，汴大某一栋灰色的老宿舍楼上，令狐冲百无聊赖地枕着他黑也不算很黑，黄也不算很黄的枕头，翻一本卷边的《天龙八部》。读到无名老僧说“皇图霸业不过如此”，令狐冲煞有介事地点点头，叹口气，嘟哝了一句：“这才是真正的牛人。”65.令狐冲在他对面低下头去看自己那封信，屋子里的沉默让他感觉怪怪的。他抬起头，忽然在风清扬的眼睛里捕捉到一种特殊的神情，不光是缅怀，也不光是感慨，很多微妙的情绪交织在风清扬那双已经很世故的眼睛里。66.在令狐冲的印象里，很多年以前，有个牛人路过江东，在旧日的树前也是说了什么关于树的话。他说：“树犹如此，人何以堪。”67.风像一根穿越过去和未来的线，从令狐冲背后吹来，令狐冲似乎在风的尽头看见了十年后的自己。物理学家们把时间当作世界的一个维度来处理，可是没有人见过时间这个维度如空间一样延展。大宋嘉佑二年，一个普通的汴大学生令狐冲在简陋的实验条件下——两瓶啤酒，用自己发昏的双眼验证到时间维度的存在。68.比如令狐冲以前说过：“老五你整天看女生，不烦啊？”段誉坐在学五门口的餐桌上，拿叉子挑了片牛肉，愣了一下：“不会吧？看女生你都能看烦？”令狐冲想想也是，这世界上比爱情追求更高的追求也实在不多。于是他只好说：“不过老看总有点……”段誉看了看令狐冲，很坦诚很无辜的眼神：“你想看就看了，你不喜欢好看的女生？”“喜欢……”令狐冲只能承认，他好歹也是个未婚大男人。“喜欢你为什么不看？”段誉收拾收拾去洗饭盆了，令狐冲手持一把不锈钢勺子呆在那里，刚刚被花痴精神洗礼了一次还没彻底苏醒过来。69.鸟鸣只是在乐曲的段落间传进了段誉的耳朵里，随着他深深吸了一口微凉的空气，随身听也啪嗒一声开始倒转，接下来是西域著名吟游诗人Paul Simon的作品，《The sound of silence》： Hello, darkness, my old friend, I have come to talk with you again, because a vision softly creeping left its seeds while I was sleeping, and the vision that was planted in my brain still remains within the sound of silence. 70.那个女孩就这么踏着满地黄花而来，鞋跟敲打着一首段誉无法忘记的歌谣。在人文精神浓郁的历史系混了一年，段誉当然不会不知道所谓“青青翠竹，尽是法身，郁郁黄花，无非般若”，可是那一季黄花凋谢的时候，段誉连“般若”到底是个什么玩意儿都忘记了。不是解脱，段誉把他读了十年的《金刚经》抛到了九霄云外，心里只有一种沉溺的大喜乐。71.田伯光比令狐冲他们高一届，和郭靖同系，外号叫“刀疤”。其实田伯光脸上一颗痣都没有，别说刀疤了。他真实的外号是“刀巴”——或者说就是个“色”字。72.段誉这才第一次听说那个女生的名字——王语嫣。“王语嫣你们都不知道？王黄木赵周听说过没有？”田伯光对两个晚辈的孤陋寡闻感到遗憾。“什么乱七八糟的？”令狐冲愣了一下。“校花列表，我去年更新的。王语嫣第一，接下来是黄蓉，木婉清不是你们班的么？这你身为班长都不知道？”“赵敏和周芷若差不多，不过学生会主席总应该加分，所以就把赵敏放在前面了。”73.吃完饭各自回宿舍的时候，乔峰忽然对令狐冲说：“不如打赌吧，赌一顿麦当劳，你要是能帮段誉追到王语嫣，我请你三顿，你输了请一顿就行。” 令狐冲犹豫了一下，说：“一赔三这个赔率还是小了一点，不如一赔五吧，你输了请五顿。” “你小子他妈的不是黄世仁，世界上还真就没有黄世仁了。”乔峰狠狠地啐了一口，“五顿就五顿，要赌就赌大的。” 令狐冲满怀对麦当劳的憧憬去了。74.那边更有赵志敬尹志平两个跑得飞快，足足超了段誉三次了。他们两个早上起来就赌看谁先拿到五张票，慢的早点请杭州小笼。结果这两个人都够狠，拼到第五圈上还追在一起，忍着腿脚的酸痛就是不肯放弃那小笼包子。一起从段誉身边超过去的时候尹志平还哼哼：“赵……志敬你他妈真……真狠，为……为笼包子你……你跑……跑得跟兔子一样。”75.慕容复并不在乎承认他是敏感的，他绝不是心思粗得像水泥管道的郭靖。他是慕容复，而不是任何其他人，如果他不想原谅别人对他这个外地人的轻慢，那么他绝不会逼自己装得宽容。于是在身后关上门的时候，慕容复告诉自己他不会再走进王语嫣的家门。事实证明，慕容复是一个说到做到的人。76.“我说吧。”花痴忽然胆大起来，有赌徒脱下裤子的孤注一掷之感，却丝毫不感到紧张。每个人的心都不是可以轻易看透的，令狐冲以为段誉兴高采烈地来赴这场约会的时候，段誉已经准备了一些话，用来结束这段没由来的爱情。“我暑假时候看到你的……”段誉说，“那天下雨，本来准备出去吃包子的……令狐冲，喔，是我们宿舍一个兄弟，还在睡觉……”“最近老想老想，”段誉轻声说，“脑子都有些乱了。所以……反正也好了。”王语嫣感到一瞬间的虚弱，她从来不曾听见有人慢慢地给她说一段倾慕，仿佛一本爱情小说的女主角是自己，自己却无力改变那个令人厌恶的结局。“我不知道……”王语嫣摘了一张卡片给段誉。段誉看了，那张比实际年龄还要年轻的脸上掠过一丝苦笑。写卡的人说：“不必担心失去的东西，因为你最终拥有的会遇见你，即使那不是你等待的”。段誉说：“可遇不可求，我早就知道的，可是……”“还是……算了吧……”王语嫣几乎要拼凑出一个灿烂的笑容去照亮段誉黯淡的眼神时，心里那个很野的眼神，还有另一种生活的诱惑却终于压下了她的软弱。“是么？”段誉站了起来，说，“我去一下厕所。”当段誉回到桌边，歌声寂寞地回荡，桌上空空如也，只有一张已经结账的单子，王语嫣喝了一半的珍珠奶茶还在桌上。段誉坐下来，他头上那些大红的纸片上依然写满了过去人的祝福，那未来的人真的会因为这些祝福而快乐么？段誉吸了一口冰凉的绿茶，他想王语嫣是如何走的呢？77.等待着你等待你慢慢地靠近我陪着我长长的夜到尽头别让我独自守候等待着你等待你默默凝望着我告诉我你的未来属于我除了我别无所求你知道这一生，我只为你执着，不管它喜还是悲，苦还是甜，对还是错，你知道这一生，我只为你守侯我对你情那么深，意那么浓，爱那么多。(作者按：歌词出自陈淑桦《一生守候》，大宋朝月光下的王语嫣和段誉也只有在这个故事中才会听过这首歌吧。) 78.王语嫣站在三教的楼外，又是下雨，雨下得疏狂。王语嫣就这么怔怔地看着远处的篮球场，慕容复已经不在那里。王语嫣看着他在三教的灯光下起跳投篮，远远的三分命中，也看着雨来的时候他抄起外衣和场边等待的那个女生携手离去。这个身不由己的游戏里总是很少胜利者。王语嫣捅破了段誉的肥皂泡，谁会捅破王语嫣自己的肥皂泡呢？忽然有人站在了她旁边，王语嫣吃惊的回头，才发现段誉站在她旁边。“雨太大了。”段誉说。看着段誉那张孩子气的脸，王语嫣苦笑，摇了摇头：“对不起，你别管我了好不好？”“你没有伞吧？”经过一阵子的手足无措，段誉低着头小心地说。“没关系。”段誉从后面的令狐冲手里拿了伞，走到了王语嫣身边。身边不少男生女生并着一把伞跑进了雨里，王语嫣忽然有一种彻头彻尾的无力感。“别再跟着我了！”似乎是一生中第一次，王语嫣如此失态的对别人大喊。“我只是碰巧……”段誉把伞塞到了王语嫣手里，然后一声不吭地自己走进了外面的大雨里，连串的雨水好像无数长鞭抽打下来，打得段誉身上都有些痛了。可是他什么也没有说，只是皱着眉毛看了看阴沉的天空，然后双手揣在裤子口袋里，就像一个做错了事而不敢回家的孩子那样，在雨里散步一样走远了。王语嫣忽然有一种感觉，段誉不会再走回她身边。“你也不至于连我一起虐待吧，”令狐冲伸出去阻拦段誉的手最终只好停在半空中。虽然他是去接段誉的，不过可怜他们两个人加起来也只有一把伞。79.这个时候赵敏拎着把雨伞出现在门口。令狐冲急忙凑上去，一脸特恳切的笑容：“哟，赵敏，你也跑来自习啊……”赵敏咬着舌尖，露出了她很经典的微笑：“下面你要说你没有带伞是不是啊？”“就是就是，”令狐冲急忙点头，“赵敏你那么急公好义的人，总不忍心看我淋成一只汤鸡嘛。”赵敏居然点了点头：“是喔是喔，我当然关心你喽，怎么忍心看你冒雨回家呢？”“啊？”令狐冲眉开眼笑，“那我来打伞吧？”一把黑色的雨伞忽然横在赵敏和令狐冲之间，张无忌刚从厕所里窜出来，急忙说：“我们正好多一把呢。”80.(作者按：因为篇幅和故事线索的限制，有关段誉的篇章并非结束而只是开始，但是对于这所有故事的观察者乔峰，这个故事已经到此告终。请留意《此间的少年·并未结束》，即本篇姊妹篇的进展。)81.她第一次看见杨康的时候，杨康穿了一身雪白的学生装，站在教学楼的最高层。那时候穆念慈站在操场上，蒙蒙细雨中，需要把头仰得很高才能看见那个一身雪白的男生捧着一只文件夹悠然走过，目光懒洋洋地扫过整个操场。82.一根香烟的尼古丁含量可以毒死七头骆驼。不过人体内有一种酶，可以分解尼古丁，所以它是毒不死人的。83.等杨康走到穆念慈身边，板砖已经失去了用途。杨康掂了掂砖，目送夕阳下彭连虎和梁子翁兔子般的背影。杨康把板砖放低，雪糕放到嘴边，对穆念慈笑了笑：“你叫穆念慈吧，送你根雪糕。”平生和穆念慈说的第一句话，杨康奇迹一般报出了穆念慈的名字。84.直到分岔路口，杨康家和穆念慈家就不在一条路上了。杨康觉得自己再不说就没有机会了，于是他猛地站住，用一种很小心的语气说：“穆念慈，我有件事情一直想和你说……”“什么事情……”穆念慈心里仿佛一窝兔子炸窝了，抬头看见杨康一双透亮的眼睛眨也不眨地盯着自己。穆念慈不曾想过杨康那样懒散的人也会有如此认真的时候。“能不能把笔记借我抄一下？”杨康长叹一声，“老丘的板书和鳖爬一样，我实在是看不清楚。”85.她可以是原先那个丑小鸭一样的穆念慈，她也可以把自己变成和杨康在一起的穆念慈。但是这两种穆念慈绝不可能并存，杨康是个眼高于顶的人，能看见头顶飞过的天鹅，看不见脚下经过的小鸭。那么这只小鸭鼓振单薄的双翼，是否真的能飞过杨康的视野呢？做这个选择的时候，穆念慈并不知道。看着杨康高兴地夹着笔记本跑了，那夕阳下猴子般一蹦一跳的背影，穆念慈又想起某个雨意空疏的早晨，高楼上白衣少年懒洋洋的目光。穆念慈的一生中，曾经有一次如此勇敢。86.穆念慈不知道自己是面对一张海报还是面对着镜子里的自己。长发拉得笔直，是一溪垂落的流水。穿堂的微风中，发梢婉约在她的肩上。黄蓉给配的玳瑁项链，岁月沉淀的色泽衬着她自己原本皎皎的肤色。丝绸的白色头花宛如一只大蝴蝶降落在自己头上。黄蓉说白色的衬衫很衬姐姐的脸色，于是穆念慈买了白色的衬衣。黄蓉说姐姐的腰细，腰线也高，最好穿长裙子，于是穆念慈买了亚麻色的束腰长裙。甚至连脚上镂出空花的白色袜子都是黄蓉推荐的，束着细细的脚踝，美丽得精致而优雅。87.杨康也是后来居上的少年英才。他老娘包惜弱在女性作家中是响当当的人物，杨康自幼在老娘的悲情文字熏陶下成长，颇是练了些本事。杨康的情书风格以排比铺陈为能事，一篇浩浩长文写下来，字字血泪。女生们无不以为送情书的兄弟已经暗恋自己多年，有一颗经历风雨霜雪濒临破碎的心。这时候就算对方是一头猪，她们也不忍心断然拒绝了——而必然寻求委婉的拒绝方式。88.眼见闯到自己面前的家伙非但高大而且目光寒冷，骂人的男生愣了一下，喉咙里的几句话就咽下去了。然后是几张钞票塞到他手里，对方瞟了他一眼：“赔你，行了吧？跟女生这个德性，老兄你这样的我在汴大还真没见过。”89.终于到了毕业卖旧书的时候，乔峰惊讶地发现在这方面虚竹的竞争力比他强多了。摆了一下午地摊，虚竹卖了两百多块，乔峰只卖出二十块。乔峰很不平衡，不过虚竹却晃着光头说：“我的课本比较干净嘛。” 虚竹的书是干净，他几乎从来不用自己的书，除了专业课，他都是复印乔峰的笔记混日子。而乔峰的书上除了画满黑线红线，还有乌龟兔子米老鼠……这个壮硕如土匪的人物听课听困了就喜欢在书上即兴创作，而虚竹虽然也喜欢创作，(奇书网.整理提*供)但是从来都把想到的诗句写在厕所内侧门板上。90.“你小子就是他妈的废话多，”乔峰看了看天色，“你看看什么有用都拿走。” “哎，郭靖郭靖！”令狐冲赶快起身对远处招手。一阵稀里哗啦的响动，郭靖排开人群，蹬着一辆破三轮过来了。 乔峰目瞪口呆地看着令狐冲捋起袖子往三轮上堆书，半天才反应过来：“打劫啊……有人打劫了……”91.接下来的一切如此平静，日子渐渐过去，考试越来越紧，令狐冲像一条懒了一个学期的老狗，被鞭子赶着要完成整整一个学期的任务。好在他不是孤独的，至少还有杨康老狗跟他坚强地站在同一战线上。 “嗯嗯，这个这个，”令狐冲清了清嗓子问，“大宋当前三十年经济建设的三个中心环节是什么？” “简单。”杨康答，“首先是提高丝绸制品的产量和金银的开采，保证我们可以履行对金朝纳币输绢的硬性指标；其次是大力发展畜牧养殖业，争取早日改进我们大宋的战马素质，以便在和金朝的冲突中能保证战略转移的速度；最后是拓展和蒙古的经济合作来促进我们和蒙古的军事合作让蒙古去打金朝。”92.乔峰给每人塞了一张名片，名片上写“苏州丐帮股份有限总公司：总经理助理”。93.犹豫了一下，令狐冲起身走了。走到七八米开外他回过头来：“你去的那公司我以前听说过，咱们系以前有个康敏就去的那儿吧？”","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-此间的少年-江南-02","date":"2017-01-21T15:11:13.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-02/","text":"作品：此间的少年作者：江南 31.计算机和国政的那场恶战当时是战报贴了全校的，黄纸黑字。由国政某才子拿一根墨笔足足挥洒了一百张广告，墨迹未干的时候就招贴在各个宣传栏。于是各色的家教广告和电影海报上猛然多出一条墨龙飞舞——“计算机vs国政，卷土重来！”那架势赫然是越王勾践卧薪尝胆十年后要去寻吴国报复，顿时草木萧萧杀机一片，不过其实只是上一个月国政刚输了一场。32.计算机和国政双方不过是半斤八两，不过那一天国政实在是出足了风头。康敏叫人从团委把国政那面红旗扛了出来，红旗下架着两箱矿泉水一箱可乐，还有国政系四十多名女生。康敏自己扣了顶棒球帽压住长发，一脚踩在可乐箱子上，率先挥舞着毛巾助威，乔峰的名字在一片莺声燕语中一直传到几百米外的电教停车场。康敏绝对盖过了慕容复崇拜团的所有成员，派头俨然将军临阵，看见的人无不相信评书中所谓杨门女将果真存在。33.在一众崇拜团面前，慕容复面子上终于挂不住了。比赛里心情本来就乱，那时候他根本管不住自己的手，狠狠推在康敏的肩膀上把她推倒在地上，大声吼了一句：“他妈的别靠我那么近，要不要脸啊？”马大元早就走了过来，这时候一肩膀把慕容复扛了出去：“你干什么？”“问谁呢？”慕容复根本不理睬旁边的包不同给他比眼色，“谁先挑的？你们国政会玩不会玩？谁手上不干净？都以为就自己干净？好像别人不知道你是谁一样，不要脸就在你们系里不要脸。别以为人人都让你，拉拉扯扯的，以为自己是谁啊？”慕容复的手直指康敏。34.乔峰转头看了看地上的康敏，几个女生正想扶她起来，一身的白色运动服已经沾满灰尘。康敏默默地爬起来，眼神有点呆。不是因为摔傻了，而是因为慕容复骂她。慕容复几句骂词里什么意思，所有人都听得出来，康敏当然也明白。乔峰点了点头，然后一拳砸在慕容复鼻子上，随后上去用胳膊肘捞住慕容复的脖子，用力把他掼在木板场地上。35.乔峰坐在对面，有点好奇地看着她。还是早春三月，康敏穿了裙子。将近脚踝的黑色呢绒长裙，黑色的丝袜，黑色的皮鞋，上身是贴身的黑色小毛衣，用一根黑皮带紧紧地束腰。惟有一头黑发还是按照老习惯用大幅的白手绢扎起来，随便地理在胸前。这套衣服更衬得康敏胸部丰隆腰肢纤细，颇有点体态妖娆的意思。乔峰多看了两眼，觉得有点别扭，康敏难得显得那么文静。36.“很多事情都必须经历一次，”后来，哲学家令狐冲说，“无论结果怎么着，就是得……经历一次。”37.“乔峰，”康敏抬起头看他，一只很纤细很柔软的手轻轻按了按乔峰的胸口，“自己多小心。”就这样，很简单的，康敏哭了，在夏夜的晚风里哭得像一个随时会破碎的纸人儿。有点什么噎在乔峰的喉咙里，让他很难受。“小康怎么了？”乔峰茫然地看着康敏扭头跑掉了，在花圃边没入了黑暗里。“不懂啊？”平时一向对乔峰和颜悦色的师姐忽然瞪了他一眼，“继续装傻去吧你。”38.旁边的学生都绕道走，觉得那时候的乔峰很有点黑社会老大出去砍人前的风范。那时候体育中心老是放港片，老大们出去玩命前都是风萧萧兮易水寒，大页的印刷白纸吹得窗前满地起落。这时候乔峰如果抽出一把乌兹把周围的人都摆平了，他就完美地诠释了这个场景。39.世界的某一个角落中有失落的倒霉蛋的时候，另一个角落中往往可能有兴高采烈的人。只是通常他们彼此都不知道彼此的快乐和悲伤。40.黄蓉从假寐的状态中伸了伸懒腰，表示自己醒来了。郭靖不太敢看她，拼命集中精神看物化课本，可怜他都快成斗鸡眼了。黄蓉心里有了底，这下子一扫刚才的小幽怨，笑眉笑眼地问郭靖说：“你买了芬达啊，我正好渴了。”郭靖丝毫没有意识到黄蓉只是和自己搭话，只是拼命摇头说：“乔峰……乔峰……”黄蓉斜飞了他一眼，肚里骂他笨的时候，却瞟见了郭靖的物化书。从进来图书馆开始，郭靖的物化书就再也没有翻过一页，黄蓉清清楚楚地记得书页的号码。“小样儿还跟我玩花呢……”黄蓉心里忽然有一种戏谑的快感，因为她很开心。她抬起头，郭靖额头上居然连冷汗也有了。“热啊？”黄蓉说。郭靖急忙点头：“空调太热，空调太热。”“笨！”黄蓉说，“现在是夏天，空调开冷风，有点文化好不好？”41.晚风幽幽地吹，在黄蓉用微笑鼓励并且慷慨付帐足足喂了郭靖一斤包子三碗辣糊汤之后，这个傻小子才终于有点开窍甚至可以说恍然大悟了。老破驴停在女生楼前的时候，郭靖的勇气终于攒够了，他说：“那黄蓉你明天还去图书馆么？”“去啊。”“那我来接你去吧……”42.这番讨论并没有落进校警队的耳朵里，倒是被夜里上来遛弯的楼长听了一言半语去，不过楼长只是晃晃悠悠地背着手又蹓跶下去了。他并没有傻到以为令狐冲真的有淫贼的雄心壮志，他前天上来的时候才听令狐冲说要炸掉枢密院练练身手，相比之下，拦路非礼女生这个构思在令狐冲只是小小的灵感爆发而已。况且真正的危险分子在楼道的另一侧，化学系高一年级的田伯光已经连续三个夜晚详细地探讨了聘请某位武林高手利用弹指神通谋杀大宋皇帝的可能性。43.当然，最让大家感到情何以堪的是没课的时候黄蓉整天在他们宿舍的计算机上切《侍魂II》，乃是高手中的高手。黄药师请人专门教过黄蓉输入，其结果是黄蓉用键盘发招比任何人都流畅和连贯，把原来称霸的杨康，兵器榜排列第二的令狐冲杀得狼狈逃窜，曾经创下二十人斩的记录，杨康从此再也不敢言武……(作者按：《侍魂II》是日本SNK公司的一个格斗游戏，曾被移植到PC机上，当年曾经是男生宿舍流行一时的游戏。作者曾有若干次被人十人斩的记录，由此深恨日本武士道。)44.且让郭靖和黄蓉继续培养他们的感情，我们知道这要很长的时间。千万不可以相信我们某位愤青说的话，把女孩整上床的难度完全不同于让女孩彻底爱上你，前者大概是七八年有期徒刑的难度——这个法律系的欧阳克很熟悉并且可以解释给大家听，而后者则是终生监禁。45.所以令狐冲抬起头的时候只看见夕阳下乔峰远远的影子，乔峰坐在车斗里懒洋洋地叼上根烟，握打火机的手扬起来对他随便挥了一下，嘴唇边是一种淡淡的笑容。乔峰的身影，那辆三轮，整个都要融化在夕阳的红色里。46.杨康稍微迟疑了一下，然后满面微笑地拍拍令狐冲：“令狐冲，吃完饭给你看一样东西。”“啊？什么什么？”令狐冲就是好奇心强，“拿出来看看。”“真的要看啊？”杨康笑。“废话，当然真的。”“看了我怕你把持不住哦……”“有那么夸张么？拿出来拿出来。”杨康把令狐冲刚才不小心拨拉到饭盆外面的一个米饭团翻开了给他看，里面是一只保存完好并且完全烧熟的苍蝇，正以一个很恬静的姿势缩在那团米饭中央。“知不知道我现在想干什么？”令狐冲一手掐自己的喉咙，一手掐杨康的喉咙，艰难地说着。杨康摇头，以一种很惋惜的语气说：“早叫你吃完再看吧？”47.郭靖那时候还没有撞到黄蓉，还是一条蒙古来的正宗光棍。别说国标舞怎么跳，就是连大秧歌郭靖也没怎么见识过，所以他此时张口结舌，实在无话可说。但是黄蓉变成他女朋友之后形势完全变化，在黄蓉精心培养下，郭靖成为他们宿舍蹦迪的第一爱好者。郭靖节奏感特别强，踩点也特准，黑灯照音乐起，立刻就可以把周围一片地板踩得乱颤，周围一圈女孩都觉得自己好像站在震动垫上，兴奋地拼命喊。而且郭靖体力充沛，连踩两个小时绝对没问题，最后成为汴大南门外一家迪厅的灵魂人物，把无数从别处赶来的高手都给震了。再后来他就踩碎了黄药师家小舞池的水晶地面。48.阿朱忽然有一种错觉，以为自己不是走进了舞蹈教室，而是站在某一个电影的画面中，比如《教父》。乔峰就像一个意大利的黑手党分子，站在圣堂的黑暗里，默默地欣赏遥远的歌声。那时候乔峰放在音响里的磁带是普契尼的《托斯卡》选段——Cavaradossi的“E Lucevan stelle”。此时乔峰似乎根本不属于汴大平凡的熙熙攘攘的校园，一种近乎宗教神秘的背景让一米九五的他更高得不可平视。49.当然，最打击令狐冲的还是杨康此时也嚼着口香糖从门边把脑袋探了进来，这个已经完全没有必要的援军是他实实在在花了三条鸡腿请来的。而且按照杨康的性格，他一定会不断和令狐冲一起去打饭，要把所有鸡腿都吃到肚里才会罢休。不过杨康看了一眼后的第一个念头是“不要鸡腿算了”。因为他竟然在结队来的女生中看见了穆念慈，原本不该出现的穆念慈。还没来得及拍拍屁股逃跑，郭靖在背后很惊喜地喊：“杨康，杨康，我们在这里。”就像去火车站接人那样热情而大声。既然是天意绝他，杨康也只好点点头，微笑着跟转过脸来的穆念慈打个招呼。50.欧阳克终于体会到了乔峰可怕的身高，这在他用女步来带乔峰的时候令他深感屈辱。欧阳克找到了黛依丝的感觉，或者说他就是脚不沾地被乔峰带来带去的。乔峰腿长估计要超过他十厘米以上，转圈的半径远远超过了欧阳克的能力，欧阳克要是完全凭借自己的力量跟上去，那么他就不得不做一些接近劈叉的动作。这也就罢了，关键是乔峰双手老有一个往上提然后往下压的动作，而且以一个很熟悉的频率不断的重复。当时欧阳克很不理解这种糟糕的舞蹈习惯是怎么来的，直到几个月后他看了一场乔峰的篮球赛——他忽然发现一个带球的篮球运动员只有在上篮的时候才不做这个动作。51.最无可奈何的莫过于阿朱，阿朱身材好，身高一米七，在整个班上是最高的女生。而她的舞伴陆大有，我们知道他的外号叫“猴子”。陆大有领悟力还算不错，所以阿朱迁就着他比较小的步子，舞步上是整个舞场里最和谐的一对。可是到最后阿朱忍不住放开陆大有，捂着嘴呵呵笑了起来。陆大有有点纳闷，说：“阿朱你不要笑得很狡诈的样子，我胆子可小。”阿朱说：“谁让你老是挠我的腰，我就是想笑嘛。”陆大有这才发现了问题所在，因为比阿朱矮了半个头，按照标准的姿势把右手按在阿朱的肩胛下会很吃力。所以虽然开始陆大有还记得纠正姿势，跳着跳着手就滑到了阿朱的腰间。阿朱对痒特别敏感，觉得陆大有的手像在挠她的腰，终于忍不住笑了起来。“唉，阿朱你太高了，我老有小时候爬树的感觉。”陆大有嘿嘿地笑。52.往事好像硬盘上一些唱旧的老歌，虽然已经陈旧了，甚至自己也厌倦了，但每一次翻听，好像总回到过去的日子。可惜自己已经不是过去的自己。这种反差有时候让人惶恐，有时候让人悲伤，甚至无所适从。可惜乔峰不喜欢惶恐和悲伤中的任何一种情绪，他只想抽根烟，赶快把乱七八糟的思绪都赶走，省得自己被困在一个记忆的城中。十月了，康敏已经走了四个月。乔峰不记得自己有多少次捏着一张IC电话卡从一教边的公用电话下走出来，耳边还回荡着各种声音的“不知道”。在郁郁葱葱的树边，乔峰有时候甚至有一种错觉，以为自己只要走进一教的大门，就可以看见那个黑色长裙的女孩娇媚地靠在报栏边看报。53.“要走趁早，别废话多。”乔峰的神色可以说是冷酷，“他妈的这话简单，谁都会骂，改天我教你骂点新花样出来。”随后，乔峰不理梁发带门出去，上去推了令狐冲一把：“叫剩下的人继续跳，你是班长，给点样子。”令狐冲勉强笑笑：“没事，大家继续跳，我去换磁带。”“磁带我去换。”乔峰对阿朱说，“阿朱你带带他。”乔峰的大哥风范震住了场子，其实大家对于跳舞都还是有兴趣的，随着音乐声起，很快一点点不愉快就被忘记了。陆大有甚至还很高兴，舞场显得宽多了。54.“同学借过一下。”一个很甜润的声音在乔峰背后的黑暗里。这句话对于乔峰的效果相当于有人在他背后说了一声“开水来了”，他差点吓得蹦了起来。也许是阿朱那双黑绒的舞鞋实在很软，也许是碰巧没弄出声音。她就像一只轻盈的小猫，在乔峰未曾防备的时候，已经悄悄来到了他背后。结果是乔峰虽然没有蹦，可是他猛地直起了身子，高个头让他狠狠地撞在了旁边的门框上，差点把嘴里那根烟整个给吞了。阿朱咯咯地笑个不停。55.乔峰说我知道你小子够狠，可是另外九十九个敢死队哪儿去找？凭什么大家和你一样不要命。令狐冲酒劲上来，这回真的有点激愤了。他狠狠一拍桌子：“靠！成天那么纳币输绢，你以为不死人啊？农村里每年交那么多粮食，地保都跟土皇帝一样，一年死多少人你知道不知道？这么死还不如跟我一起去炸翻黄龙府！”旁边桌子上一哥们马上举杯：“靠，炸翻丫的黄龙府！哪天去叫上我！”“别争了别争了，”阿朱赶快说，“等几年再炸不迟。”愣了一下，乔峰喷出一口酒气笑了起来，隔着桌子伸过手去拍拍令狐冲的肩膀：“你小子怕是迟早有一天让自己这脾气给害了。”“我怕啊？”令狐冲狠狠地喝了口啤酒。“你小子就是太有种，”乔峰说，“别扯黄龙府那么远，连打扫个卫生都没人跟你，谁真和你去炸黄龙府？班长干到你这个份上，算是我当初害了你。”“不是一回事吧？”“跟你老实说，还有你，”乔峰对旁边的阿朱晃了晃杯子，“班委这个东西就是个样子，能应付上面就得了，别吃力不讨好去搞什么活动。以为在高中啊？人心散得很，谁真把你们当回事儿？自己有时间把专业课拼上去，以后出国找工作都好混。”“老大你这话势利！”以乔峰的性格，别人这么说估计早瞪上眼了。可是这次乔峰出奇地安静，用令狐冲他们家乡话骂了一句：“后生仔！知道不知道岳飞怎么死的？”“怎么死的？”令狐冲对岳飞这个名字还是有点敬畏的。乔峰慢悠悠地喝了口啤酒：“给自己折腾死了。”郭靖也喝了点酒，这时候脸涨得有点红：“不是……”“先别说，”乔峰一挥手，“我只问你一个事情，你知道皇帝为什么杀他？”“后来不是给平反了么？”“那你知道那年有几个人真想跟他一起打黄龙府？”郭靖愣了一下，令狐冲也傻了。“没人，”乔峰笑笑，“就他自己拉起的事情。他就是死得他妈的太有理想了！”一片安静，乔峰自己喝了口酒。旁边那位又举杯：“为他妈死得太有理想干一杯……”“老板结账，”乔峰起身，“说真的，是为你们好。”那时候令狐冲和郭靖是被一种新思想给震傻了，只有阿朱的想法不同，她只是看见乔峰那时候说话真的很沧桑，更有点悲天悯人的无可奈何。56.一场舞会促成了一场爱情让令狐冲很开心。他开心之余就没有多余的心思去想乔峰在饭店里的话，很久以后他知道自己错过了乔峰留给他的经验，可惜他已经没有弥补的机会了。我想令狐冲那时候是个很天真的人，虽然他费力组织活动，却费力不讨好的被别人怨恨甚至责骂，可是仅仅因为促成了一段别人的感情，就让他从心底里感到快乐从而忘记了自己遭遇的不平。他没有想过乔峰的爱情到底与他有什么关系，他有什么理由为此而快乐呢？那个天真的、或者说愚蠢的孩子啊！如果研究一下令狐冲在大学一年级的执政历史，我们会发现世界上少有这种屡败屡战的悲剧英雄。他组织过春秋两次旅游，追随他的人都不超过三分之一。冬天级主任通知去系办公楼前扫雪，令狐冲千方百计抓了九个壮丁，等到办公楼前只剩下两个没来得及跑。惟一一次聚餐的出席率倒有三分之二。令狐冲足足花了两个月才收回全部聚餐费，而且怎么算总数都少了七十块。自己掏腰包填补了这个空白以后，令狐冲一直很希望下一次能发现收到的钱里多了七十多块。这样就完美地弥补了他的损失。事实上这个讨论一直持续到令狐冲他们班吃散伙饭前，也就是说，整整四年中全班名义下的聚餐不过两次，标志着一个开始和一个结束。后来的令狐冲承认也许真的如乔峰所说：“人心已散。”57.这个情况持续了两个月以后杨康彻底怒了。杨康一面勒令令狐冲每天出去自习，不到熄灯不准回来，一面拿红墨水挥洒了一张告示贴在他们屋门口：“第一，晚上十点以后领补助者杀！第二，领补助不带零钱者杀！第三，领补助不可以作为踢翻我们簸箕的理由，违者杀！第四，等待发补助只要五分钟，在此其间我们屋不提供计算机游戏帮助打发时间，所以有以等补助为名在我们屋上机者也杀！58.当年诸葛武侯缩在南阳当农民的时候，嘴里说躬耕好快乐，脚下还是忍不住要三山五岳地跑，去画军事地图。这和令狐冲当班长的道理是一样的。我们可以想象皇叔三顾的时候，卧龙其实悄悄躲在茅庐外的竹林里乐翻了天，心里说终于该我出场了么？而相对比较不幸的令狐冲没有勾引到大宋皇帝请他出山相助，所以只好龟缩在汴大里当个班长聊解寂寞。59.在令狐冲的眼里，校长只是一个符号，意味着很大的权力很高的位置。如果能当上校长，那么经常在肚子里琢磨的改革计划就可以拿出来实施了。独孤求败不是一个符号，他是一个真正的人，汴大校长。60.不是史学权威，也不是汴大校长，那么他独孤求败还是什么呢？有一次想到这个问题，独孤求败黯然苦笑，瞅瞅周围无人，在办公桌前拍案而起，亮出身架先来个叫板：“喝呀啊啊……”而后慨然唱道：“漫揾英雄泪，相离处士家。谢慈悲剃度在莲台下，没缘法转眼分离乍。赤条条来去无牵挂。哪里讨烟蓑雨笠卷单行，一任俺芒鞋破钵随缘化。”(作者按：读过《红楼梦》的朋友想必知道此一段唱深得蘅芜君赏识，大家闺秀如薛宝钗者这样欣赏鲁智深的狂禅之歌，实在是个异数。我曾经有同学说到此处，拍案说宝钗姐姐也如此狂野，在场的人都笑弯了腰。在此为记。)","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-此间的少年-江南-01","date":"2017-01-21T14:52:20.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-01/","text":"作品：此间的少年作者：江南 读后感：1.人物性格还原的不错。郭靖与黄蓉，杨康与穆念慈，乔峰与康敏，段誉与王语嫣，一个个都那么性格鲜明，多少遗憾与无奈~~2.&lt;射雕英雄传&gt;中很不喜欢杨康，&lt;此间的少年&gt;中最喜欢的人物反而是杨康。。3.青衫磊落人海行.流年爱匆匆。不知道十年以前的江南，当他还是本科生的时候，是否会想到，当有一日回头来看这段飞扬的时光的时候，会是怎样的姿态。参考子不语书评 01 秋天是操琴的天气。很久以前，教莫大胡琴的师傅说：“春宜绘墨，秋宜操琴。”莫大那个时候还年轻，不理解，师傅也不多解释。后来经历的风霜多了，莫大才觉得领悟了。原来春水春树这种一时繁华的东西最该入画，否则就流逝了，一时好景色，过去就追不回来。而秋愁如此，最是消磨意气，惟有以胡琴的两根枯弦唱出来才略可慰藉。所以风雅苍凉如莫大者，一到秋来时，纵然是《凤求凰》这种曲子也不由得萧瑟悲凉起来。……师娘说：“你也学了那么多年了，怎么一点不长进？老鬼的意思是讲春天天气太湿磨墨方便，秋天琴弦比较干，拉起来高兴。”02 第一节 校园开学 一只脚有力地踩在了落叶上，飞驰的身影唰地刹住，虎虎有生气的少年仰面看向高悬在头顶上的四字金漆招牌，缓缓地摸出了一卷书信。 “终于到了……”少年如释重负地说。03 最后一次看了妻子苍白的脸后，黄药师以一种醉酒狂歌的豪气写成了辞职信。在第二天完颜洪烈到达办公室的第一个瞬间，黄药师踏进办公室把以前所有的论文堆在他的办公桌上，最后把辞职信狠狠地掼在完颜功烈的面前。 他一生中第一次那么像一个男人。04 郭靖低头凝视着比他矮一个头的黄蓉，黄蓉抬头凝视着他，一双来自北方的粗犷的眼睛和来自南方的慧黠的眼睛。 很多一见钟情都是从双方的凝视开始的，不过这一次的情况有点例外。05 第四节 汴京大学报到 欧阳克比较喜欢把自己称为一个色而不淫的人，不过实际上十八岁的欧阳克并不太明白色和淫的区别。这句经典的话只是他原样从叔叔欧阳锋那里搬来的。欧阳锋和黄药师互相很看得起，因为双方都觉得对方够生猛。06 黄蓉踮起了脚尖去看里面的郭靖帮她买到T-SHIRT没有，这时候那身很入时的衣服完美的勾勒出了她全身的曲线。从精致的足踝到额前的刘海，黄蓉身上所有曲线组合出了完美的青春少女。07.乔峰感觉到自己生命中的一个时代已经在娓娓落幕，可惜他是个很粗的人，所以表达不出来。他现在想起以前的一些事情，觉得很可笑，有时候，又觉得很可惜。这些事情他不愿意对什么人说，甚至他自己也快记不住了。可是看到阿朱头上的白手绢，这种感觉又悄然地浮了起来。 世界上或许没有什么人是真正粗糙的，有些人显得粗糙，只是因为他们不愿意面对一些细致的情绪。比如乔峰。 乔峰很少做梦，他甚至没有梦见过自己的老爹，可是昨天夜里他梦见了康敏。 他梦见自己拉着康敏的手走在汴大的校园中，路很长风很冷，只有康敏的手心是温暖的。银杏树的叶子在秋风中如千万黄绢小扇，盈盈坠落一个时代的梦幻，乔峰和康敏拉着手走在雨后落叶的路上，周围空无一人。面前是雾，背后也是雾，道路两边古老的房屋在雾气中朦胧，乔峰感觉到那些黑洞洞的窗口里也是空的，没有人。整个汴大的世界里都没有人，他和康敏拉着手往前走.前面没有尽头。08.郭靖和黄蓉依然跋涉在寻找化学系的道路上的时候，杨康已经不费吹灰之力的解决了报到的事情。他甚至在这个间隙和生物技术系的无崖子主任谈了谈对专业的想法，从《天工开物》的生物学意义到西域最新的克隆技术，这次谈话的直接结果是无崖子在新生名单中只记得杨康一个人。09.穆念慈确实很烦，她记性好而杨康的记性差，她就养成了帮杨康记事情的习惯。比如大家一起出去游泳，出来穆念慈很可能会问杨康你洗发水又忘在浴室里了吧。通常她问起来的时候，杨康立刻就拍拍脑袋回去拿了，而大家都惊疑于穆念慈好像与杨康用的是一间浴室……10.如果没有杨康这次“急公好义”的举动，那么郭靖应该会在一个完全不同的宿舍中度过他的大学四年，他的一生都会因为这不一样的四年而不同。所以杨康从报名处的后门窜进去的时候，命运很多扇门中的一扇也悄悄打开了，走进去的时候，所有人都茫然不觉。最后杨康帮着拿号的是四个人——穆念慈、郭靖、欧阳克、黄蓉。五个连续的号码决定了他们在汴京大学四年的生活被一根看不见的丝线连在了一起，有的时候这种联系让他们快乐，有的时候则让他们恼火。那个心情如云起云落的少年时代……11.“杨康，杨康，”郭靖在下铺敲上铺的床板，“起床起床，老丘的物化课。”杨康在生物学院下的生物技术系，可是修化学的课程。“郭靖帮我答到，”杨康说，“我请你一只学五的鸡腿。”“可是……”郭靖犹豫着，“没准今天小测验，老丘上次说的。”“你帮我写一份不就完了么？”杨康挥挥手，“而且老丘就喜欢吓唬人，别听他逗你。”“喂，”杨康在上铺喊，“告诉他们，你一个人帮我写条子就可以了，别他妈的四五个杨康，老丘不是傻子。”杨康人缘不错，丘处机以前的一次小测验里有六七个人冒充杨康帮他写了条子。丘处机一看六七个不同笔迹的杨康摆在自己面前，当天晚上就给完颜洪烈打了电话，杨康一个周末都被他老爹旁征博引地训斥。12.老大是郭靖，老二是令狐冲。老三是欧阳克，而老四是杨康。老五是段誉。老小则是林平之。13.“为什么要给金国赔款？打就打，怕什么，不灭金国几次他还以为我们大宋没种呢……不过看政府这样，确实他妈的没种！哼！”令狐冲自说自话，“起床！”14.郭靖正踩着他的二八老破驴赶往教室，这辆破驴是丘处机年轻时候骑的，他骑不动了，就转手送给了郭靖。在郭靖手上，这辆老破驴焕发了新的活力，比如前面带着段誉后面带着杨康和令狐冲这种高难度动作郭靖都做过。不过有一次杨康的跑车坏了，借郭靖的破驴回家的时候，骑到半路杨康硬是下车推着破驴回家了。“我骑它到家，还不如它骑我到家呢！”杨康后来恶狠狠地对郭靖说，“累散我了。”15.不过在活力四射的郭靖手上，老破驴还是跑得有声有色……颜色是黯淡了一点，上下都响是大家都曾听见的。那天秋雨绵绵，冰冷的雨丝敲打在汴大后面的树丛里，两边都是古老的建筑，雕檐画栋中有清澈的水滴一一打落。一路上落满了细碎的小黄花。一切的一切都在无边雨意中显得朦胧和不真实。而萧萧寒风中，郭靖猛蹬破驴，姿势英武矫健一如蒙古骑兵。16.郭靖的破驴带着一声嘶叫，艰难地想煞在黄蓉面前。这时候刚好是黄蓉翘了课从校外吃杭州小笼包子回来，她忽然看见了路边一朵不知名的花被雨水打得凌乱而狼狈。黄蓉怔怔地站在雨里看花零落，伤春悲秋的小资情绪忽然间一发不可收拾。十七岁的黄蓉觉得自己和周围的人格格不入，那个坏老爹还非常的像暴君，所以一连三个星期黄药师让司机拿车来接她她都不回家。最重要的是难道十七岁了还是一条女光棍么？何其的悲痛！黄蓉觉得自己的未来一片灰色，就像这朵正在风雨中独自凋谢的小花。这时候，郭靖如一个黑驴王子一样风驰电掣地正式闯入了黄蓉的生活。他那辆老破驴在雨水中终于没有煞住，当场把痴痴看花的黄蓉撞了个四脚朝天。设想，烟雨迷朦，白衣少女静静地在花圃前看花，清澈忧伤的眼神。而周围更是葱葱碧色，被秋天的寒雨染上了一层朦胧。雕檐画栋中的林荫小路，雨丝细细地响。忽然，黑色夹克的蒙古汉子纵驴而来。驴鸣！身影交错！17.事实上男生们更兴奋的不是郭靖的爱情问题，而是郭靖终于用亲身经历证明了流传已久的爱情战略——自行车撞人。这个战略表面上是可行的，只要撞了女同学并且积极承担责任送她去医院，向她道歉，给她买礼物，日久生情当然是很有可能的。不过其他男生似乎忽略了郭靖成功的另一些必要条件——他撞的时机好，黄蓉那时候正好心情忧郁；他撞的程度好，黄蓉刚好一个月不能随便行动而且没什么大碍；他撞的人也好，他很幸运地撞准了黄蓉而不是英语系著名的傻姑。总之，大家都觉得未来爱情有望而颇欣欣然。当然暗地里仰慕黄蓉而此时觉得失去先机的人也有，但惟有两个人是真正怒火冲天了。一个是欧阳克，理由应该很明显。一个是杨康，因为那天丘处机真的课堂小测验了……18.可惜时间不是总“嗖”地飞过去，而且时间过去了总留下一些影子。19.郭靖也实在是走投无路，丘处机在化学学院号称魔刀，盛名之下无虚士。老丘去年刀上稍添三分力道，全院三分之二的师兄师姐立刻落马，成绩单送到系主任洪七公手上，老爷子正在啃烧鸡，当时嘴大得可以把整鸡给吞了。当夜洪七公亲自到丘处机家为全院苦孩子请命，丘处机才卖了三分江湖面子，可是仍留下了十五个苦命的师兄姐。20.“你怎么来了？”很久，黄蓉才小声说。“我……”郭靖只好说实话，“我来的时候忘记我跟你说了我今天不来的。”这句缠头缠脑的话终于让黄蓉笑了笑。“傻子啊，”黄蓉心里想。不过最终是不是只有这个傻子还记得自己？肚子吃饱的感觉真好，即使自己真的很孤独，至少世界上还有这个叫郭靖的傻子……黄蓉继续低头去啃汉堡。21.郭靖并不孤愤，他总是这样笑着，笑容如此的简单而纯净。这个蒙古大草原来的家伙曾经站在夕阳下看着他母亲和马队羊群一起回来，也曾在暴风雨里面和旗里其他人一样保护那些满是膻味的蒙古包……那些时候，他一定也是这样傻呆呆地笑容吧？窗外寒雨依旧飘洒的时候，黄蓉感觉到一种久违的温暖。22.黄蓉很高兴，她特别乐意把那些从小收藏的宝贝给郭靖看，比如树袋熊的娃娃或者带史奴比的小背包，然后说她如何得到的故事。高兴起来她就把一些东西送给郭靖，结果后来郭靖在他二十块钱买的“三菱”背包上捆着黄蓉送给他的樱桃小丸子，并且很仔细的从有蓝精灵头像的小笔袋里拿他的橡皮，甚至床头多了全套的修指甲工具。令狐冲几乎要崇拜得晕过去，他说他做梦也没有想到郭靖那种极端的威猛能搭配小资情调。在令狐冲看来，欧阳克这么做是正常的，而郭靖这么做无异于一个蒙古骑兵骑着一只米老鼠。有一次令狐冲排在郭靖后面打饭的时候揪着他的樱桃小丸子说：“老大，这到底是什么？”郭靖很认真地重复了从黄蓉那里学到的新名词：“公仔。”“那请问您能不能解释一下您为什么要背着她呢？”令狐冲把勺子柄凑到了郭靖嘴边。“黄蓉说很流行的耶……”令狐冲当即把每顿固定的四两饭减到三两，一天后那句“很流行的耶”就成了所有人问候郭靖的话。而郭靖只是愣愣地眨眨眼睛，根本不记得自己曾经说过了。由此我们可以看见一个小资女孩是怎样毒害豪迈粗犷的有为青年……23.惟一一次例外，黄蓉看见郭靖竟然怔怔地看着自己裙子下，小脸顿时绯红。她一直觉得自己的身材很好，小腿的曲线也很好看，所以她立刻设想郭靖是发现她的好看了。谁知道郭靖笑着指着黄蓉的白袜子说：“上面那只黑猫好像小时候看的黑猫警长。”24.郭靖也只好说没事，悄悄闪过楼长的窗口，直窜四楼而去。就着报栏的灯光，尹志平正两眼通红地看黄易的《破碎虚空》，这时候只感觉嗖的一声风过，抬头愣愣地看了半天，半个人影也没有。“真他妈的见鬼了,”尹志平嘟哝了一声，拎了凳子回宿舍了。仅仅五分钟后，也是两眼红通通的赵志敬兴高采烈地拎着凳子窜了出来，占领报栏下的灯光宝地，继续攻读尹志平刚才那本《破碎虚空》。25.“人满了。”郭靖扭头看黄蓉。黄蓉扁了扁小嘴，扯了扯郭靖的胳膊说：“先别走，我去商量一下。”黄蓉松开郭靖，一跳一跳地到一个男生身边说：“对不起，同学，你身边可以坐人么？”大家可以想象当时如果不是爱惜他明天要交的作业，那个兄弟鼻血都快流了一桌子了。美女直接要求和他坐一起，他除了点头还能干什么？不过好在汴大的学生们修养都还不错，就是比较拽，那个男生不露声色地把自己的书本往旁边扫了扫，只是对黄蓉露齿微笑。于是黄蓉把自己的书包放在了那个男生旁边。她立刻跑到图书馆另一边，选了其中看起来最顺眼的男生，凑上去很淑女地问：“同学，我在那边有个位子，我们换个座位可不可以？那边空调太凉，我觉得冷……”那个男生抬起头来看着黄蓉上身薄薄的白色小背心，心里说：“哟，妹妹，你穿这样能不冷么？”在黄蓉灿烂的笑容下，他矜持地点点头，收拾起了自己的书包。于是黄蓉微笑着把他引到刚才的男生身边坐下，然后拉起郭靖的手，和他肩并肩的坐在了空出来的两个位置上。26.乔峰觉得男人应该比较生猛，而且他一直往这个方向努力着。最初进校的时候，乔峰经常大汗淋漓地转着个球跑回宿舍，气喘吁吁地歪歪嘴巴说：“靠，刚才打球，我们四对五，物理系的小子还犯规，真他妈没劲。”这时候乔峰的哥们就会问：“输啦？”“才赢了二十分，”这时候乔峰就会一边脱背心，一边用很不满的口气表示自己这次赢得太少了。那时他的哥们毫无疑问地会赞叹：“这么猛？”于是乔峰就很高兴。27.“女朋友漂亮嘛！”乔峰很赞赏郭靖的眼光，“什么时候请客？”郭靖刚要分辨，乔峰却已经隔着郭靖探过身子对黄蓉说：“我们郭靖人可好，找到他错不了，请客请客……师妹哪个系的？”黄蓉脸上一红，心里乱乱的，也忘记反驳乔峰，只是低声说：“物理系。”28.黄蓉嘟嘟嘴说：“笨！”黄蓉最终只是轻轻叹了口气，随便抽了一本书回到郭靖身边坐下。郭靖说：“你喜欢阿拉伯语么？”“不喜欢。”黄蓉有点赌气地看着他。“那你为什么拿阿拉伯语的教材？”黄蓉只好对郭靖笑了笑并且暗地里狠不得拿那本阿拉伯语狠狠地砸他脑门一下，然后继续看那本叫《众神之车》的伪科学。29.迟疑了很久，郭靖偷偷用手背碰了碰黄蓉的头发。黄蓉的眼睛偷偷睁开，她听见郭靖竟然破天荒地叹了口气。走廊外的乔峰也看见了郭靖很贼地碰了碰黄蓉的头发，这一次他没有喳喳呼呼的闯进去拍郭靖的肩膀，只是愣了一下，然后小步走进去。他手里拿着三杯苹果芬达，给郭靖和黄蓉各一杯后，乔峰摇摇手让郭靖不要说话打搅黄蓉睡觉。然后，乔峰悄悄拾起自己的书包，吸着最后一杯芬达走了出去。30.寒假乔峰第一次去团委办公室，刚刚推开门，就看见了一个女孩，一双黑布鞋，紧身的黑毛衣和黑长裤，只有一束乌黑的长发是用白手帕扎起来垂在胸口的。她一身黑，很俏地站在三只凳子的顶端给日光灯换灯泡，下面是三个男生在帮她递灯泡。乔峰看见那个女孩踮起脚尖的时候，全身弧线都是青春活力得没救了，心情忽然就很好。","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"Game Development Guide","date":"2017-01-18T05:54:51.000Z","path":"2017/01/18/GameDevelopmentGuide-wjingzhe-20170118/","text":"###Game Development Guide ####新手指引Just give out some experience or directions on game development to green hands.分享经验或路线给新手们 ###游戏类型：手游、端游、页游、家用游戏（电视） ###游戏相关职位： ####客户端： 游戏逻辑（常见功能和特色功能开发），将用户体验做到极致，未来方向应该是主程、游戏制作人和游戏玩法创新。C#或Lua、js。 游戏引擎（主线、物理、渲染、特效、AI、资源管理、调试工具、跨平台适配等），可以拓展为架构师、AI、图形学等高级方向。C++、设计模式、算法、AI、OpenGL、DX、STL、Boost等和数学. 游戏工具（UI编辑器、场景编辑器、剧情编辑器等），和普通软件开发有点类似，以上都会涉及到，但方向和架构师、AI交集不多 ####服务端：（本人不熟悉） ###DBA或运维： 和这个职位有很多相关，我列举不出来，在较多情况下 服务端逻辑：游戏服务端的主要实现，发展方向是服务端主程，和客户端主程、主策一起商讨游戏实现的模块划分 服务端架构：登陆服、游戏服、子功能系统（如充值）等架构的涉及与实现，略高端，只能说跟着好团队走，做一款多用户游戏就知道得比我多。 ####美术： 角色原画、骨骼、特效：美术特效要求会3Dmax或Maya，同时配合画工。在办公室中你总能看到某个同事拿着一根棍条或纸筒耍武功~ 场景等，要求画工、电子绘画、PhotoShop，还要看画风等。艺术家的世界我不懂~我只知道UI是个坑，除非你的定位是UI设计师 ####策划：Office，必学。偶尔学点photoShop、美学、flash相关。 主策：这一般混着混着就变成制作人啦，什么是制作人——设置游戏大主题、玩法、找钱、演示——大部分时间跟别人吹水。这个职位要求一专多能，同时也要有工程管理能力，也是个深度游戏玩家。好吧，大佬们多多少少在此职位待过，有些东西是天生的他们手下一般带着一个执行策划，未来接班人。 主数值：神一样的职位，花钱的主最该问候的人，也是游戏生命力的控制者。GM得听他的专业意见。主数值去构想各种公式或经济模型想想某些大世界的经济系统，想想不同角色职位技能的差别和种族天赋差异在战斗中被一条条公式放大，Balance the world。比如IF们经常干的事修正某个英雄的技能和数值，比如LOL的出兵时间控制，比如SC的兵种数值调整之类职位要求：数学——应用数学和玩游戏 剧情策划（文案）：别指望分开写小说的。要求文字功底、游戏底蕴，丰富的空间想象力和历史知识，配上点特质，可以考虑些剧本去拍电影——一般是传说 中玩弄着文字做贱自己的人 场景策划：庄周梦蝶，想象一个世界，让美术去堆砌呈现给玩家。在MMO中是个重要的职位，因为他负责大局，在场景上放置剧情点。从这个角度上看，剧情策划主要负责细节实现 系统策划：玩法设计，一般也是执行策划。骨灰级玩家，天生的控场者，只不过是他的场是游戏世界而不是party或大型活动。灵活的思维加上大智若愚的耐性，同时要有工程思维。这是个和设计师有点联系的职位——灵感建立在对生活和文化的深度理解之上 特效策划：绚烂的技能来自这个大脑。要求对运动学、人体筋肉系统、物理学有一定了解，这样子给的特效想法容易实现，美术容易配合——前提哪个游戏抄的？（深度玩家啊） 活动策划：应该属于运营。 可行性：策划绕不开的话题，在恢弘的设计也要建立团队的实现能力。要不然有两个结果，1程序放个大招：实现不了，2项目崩掉。别指望3，要用工程学去评估而不是赌小概率，除非你能确定你的团队中都是狠角色（也许他们不知道自己的潜力）如果什么都不会，哪怎么办？恭喜你，策划行业除了要求玩的游戏有深度和广度，没什么其他门槛，跟着坑，给个好态度给老大就行了。 ####运营：Office系列， 高级运营：制定游戏运营的主策略：长线短线，一般会有个跨期为游戏生命力的计划书，并不断调整。期间审核活动运营给点的活动确认和大方向无冲突。数值运营的数据报告则是确认前期的运营策略是否适合此游戏或市场，就跟我们的经济部老大一样。至于评估游戏世界健康的指数我还不知道。经济学相关专业 数值运营：给主数值打杂或者兼职。为主数值提供反馈或用数据去拟合来说明某件事。数学、SPSS类似软件、Excel，甚至可以考虑学MATLAB方向的数学编程 活动运营：保证游戏世界的新鲜感和趣味性。和活动策划是同个职位，但是放在这里是因为活动是建立在后台数值上。一般结论是数值运营给的或者自己做一份数据报表分析出下个活动的类型 ####推广：经验积累。你的朋友是腾讯、百度、阿里、新浪等媒体相关职位的，或者认识各种推广团队，随便挑公司吧。 ####商务：原谅我没追过商务妹子——陪老大出差，谈合同，准备材料，喝点酒。 ####法务：如果你是个蔡崇信，请让借我一条大腿。实际上没有多少法学的朋友选择游戏相关职位，因为没有多少公司有这个职位。 ####运维：很多时候由服务端的DBA负责。但是也有专门的运维部署职位。linux、shell、python分支的方向之一 ####音效：我曾经冲着某个游戏的音效投了某个公司，可是没接触不到相关东西我就离职了。 ####工程思维：一个被反复提及的名词，游戏是个工艺品艺术品的前提。只有良好的工程管理系统才能大量的生产产品。我的工程思维是来自一本被大学学子唾弃的教程《软件工程》，其实这在土木工程中是非常普遍的。一般这个是本科和专科培训院的区别标志 ——————————————————————————引用内容———————————————————————————————————————————————————————————————————————————————————————————————————————————————————如果要自学游戏程序开发的话，可以考虑选个方向。我主修改客户端的，因为下面的内容主体是另外的网友写的。 1、C/C++、数据结构、算法导论、设计模式（学校或培训吧） 2、游戏PDF书及其代码：3D游戏编程、3D游戏编程大师技巧、Direct3D游戏编程入门教程第2版、DirectX角色扮演游戏编程DirectX特效游戏程序设计、VC++深入详解、（MFC windows程序设计第2版、MFC深入浅出、Visual C++6.0技术内幕第5版、Visual C++视频技术方案宝典、）括号内的可以考虑放弃，MFC实用性没了，只剩下一个设计思想，在时间不是很宽裕的情况下挑个游戏开源引擎已经足矣，VS用最新版本，这是广工的老师说的，他跟我说了几句话，全被证实是对的，这是其中一句——蓝玉Win32多线程程序设计、Windows程序设计、WINDOWS核心编程————侯捷精通DirectX 3D图形与动画程序设计、设计模式解析第2版、游戏开发物理学、3D数学基础 图形与游戏开发 上述的书籍我也没全看，看了一小部分，因为我不是按照这个教程来的，我也存在较多的知识体系缺陷——蓝玉 3、C++PDF书及其代码：C++STL程序员开发指南、C++编程规范、C++标准程序库自修教程与参考手册、Essential c++ 中文版Exceptional C++中文版、Inside the C++ Object Model、高质量C++编程指南、经典C程序100例深度探索C++对象模型、深入探索C++物件模型、自己动手写操作系统、代码优化：有效使用内存Effective C++、Effective C++ 第二版中文版、More Effective C++(中文版) 4、数据库SQL PDF书： （服务端必备）SQL网络编程实例、精通Oracle9i、精通Oracle 10g Pl SQL编程 5、Ogre3D PDF书及其代码：Apress-Pro Ogre 3D Programming、OGRE中文帮助手册 v1.4.0、PRO OGRE 3D PROGRAMMING中文翻译版本0.2.0 6、人工智能PDF书及其代码：AI游戏引擎程序设计、人工智能游戏编程真言、游戏编程中的人工智能技术、游戏开发中的人工智能游戏人工智能编程案例精粹 7、游戏开发网络编程PDF书及源代码：C++网络编程卷1&amp;2、Network Programming For Microsoft Window、Visual C++实践与提高-网络编程篇Visual C++网络通信编程实用案例精选第2版、Visual C++网络游戏建模与实现(第2版)、Windows SocketsWindows网络与通信程序设计、韩国传奇正式最终版本源码、网络游戏服务器编程、游戏学院网络游戏服务器端编程最新传奇M2引擎程序源码、Internetworking with TCP_IP Vol 3 Client-Server Programming And ApplicationsPC游戏编程（网络篇）、Visual C++.NET网络编程、Winsock规范及应用、传奇3源程序、魔域服务端源码+客户端源码盛大传奇外挂源代码 当然你也可以进我们的Recca2 Studio大群195660307讨论技术实现。 Recca是金山的一个著名工作室，当年发生了一些事，后来大神们各奔东西。后来行业有不成文的约定，不再恶意挖角对手，因为挖来的人也不能用。 原作者总结的网络游戏程序开发学习流程，这是最少要看的书了： 本人蓝玉看了大部分，推荐1. C++primer中文版第4版2. C++标准程序库自修教程与参考手册3. Windows程序设计第5版4. MFC windows程序设计第2版中文版5. VC++深入详解6. MFC深入浅出7. Effictive STL8. Windows核心编程学好以上几本，也可以去游戏公司一试VC++软件工程师职位了。9、WINDOWS游戏编程大师技巧第2版10、3D游戏编程大师技巧11、DirectX角色扮演游戏编程12、DirectX特效游戏程序设计13、精通DirectX 3D图形与动画程序设计14、DirectX高级动画制作15、Ogre引擎研究16、游戏人工智能编程案例精粹17、Visual C++实践与提高–网络编程篇18、C++网络编程，卷119、C++网络编程，卷220、Visual C++网络游戏建模与实现第2版21、代码优化：有效使用内存22、编个Demo出来，好好复习一下C++和数据结构，然后去游戏公司应聘。另外，游戏编程精粹1-6，GPU精粹1-2，也是好书，很多游戏开发者看的。以后可以看看。 以上的书和教程有些老旧，还是以叶劲峰推荐的为主更加好，无聊的话看上面的书会好一点（基本是中文书） 还有千万别信那些什么所谓的游戏学院会把你培养起来，在他们那里想学好游戏是很难的，他们教的都是皮毛，公司用不上，还有他们提出分配工作几乎不可能实现，现在游戏公司宁愿要计算机大专毕业生也不敢要游戏学院的，啥也不懂，你真想好好学的话自己可要下点苦心 吾等如神般降生，必将如神般笼罩这片大地。 ###参考链接wjingzhe/GameDevelopmentGuide","tags":[{"name":"GameDev","slug":"GameDev","permalink":"http://sniperkaka.com/tags/GameDev/"}]},{"title":"微观尽头_刘慈欣","date":"2016-12-13T02:01:50.000Z","path":"2016/12/13/1987-微观尽头-刘慈欣-20161213/","text":"微观尽头作者：刘慈欣日期：1987 今天夜里，人类将试图击破夸克。 这个壮举将在位于罗布泊的东方核子中心完成。核子中心看上去只是沙漠中一群优雅的白色建筑，巨大的加速器建在沙漠地下深处的隧道中，加速器的周长有150 公里。在附近专门建了一座100 万千瓦的核电厂为加速器供电，但要完成今天的试验还远远不够，只能从西北电网临时调来电力。今天，加速器将把粒子加速到10^20 吉电子伏特，这是宇宙大爆炸开始时的能量，是万物创生时的能量。在这难以想像的能量下，目前已知的物质最小单位夸克将被撞碎，人类将窥见物质世界最深层的秘密。 核子中心的控制大厅中人不多，其中有目前世界上最杰出的两位理论物理学家，他们代表着目前对物质深层结构研究的两个不同的学派。其中之一是美国人赫尔曼。琼斯，他认为夸克是物质的最小单位，不可能被击破；另一位是中国人丁仪，他的理论认为物质无限可分。 控制大厅中还有负责加速器运行的总工程师以及为数不多的几名记者，其他众多的工作人员却在地下深处的十间分控室内，控制大厅只能看到综合后的数据。这里最让人惊奇的人物是一位叫迪夏提的哈萨克族牧羊老人，他的村庄就在核子中心加速器的圆周内。在昨天的野餐中，物理学家们吃了他的烤全羊，并坚持把他请来。他们认为这个物理学上的伟大时刻，也是全人类的伟大时刻，所以应该有一个最不懂物理学的人到场。加速器已经启动，大显示屏上的能量曲线像刚苏醒的蚯蚓一样懒洋洋地爬着，向标志着临界能量的红线升去，那就是击碎夸克所需的能量。“电视为什么不转播”丁仪指着大厅一角的一台电视机问，电视中正转播着一场人山人海的足球赛。这位物理学家从北京到这儿一直身着一件蓝工作服，很容易被误认为是勤杂工。“丁博士，我们并非世界中心，试验结果出来后，能出一条三十秒的小新闻就不错了。”总工程师说。“麻木，难以置信的麻木。”丁仪摇摇头说。“但这是生存之必须。”琼斯说，他一副颓废派打扮，头发老长，还不时从衣袋中掏出一个银制酒瓶喝一口，“我很不幸地不麻木，所以难以生存下去。” 他说着掏出了一张纸，在空中晃着，“先生们，这是我的遗书。” 语惊四座，记者们立刻围着了琼斯。 “这个试验结束后，物质世界将不再有什么可以探索的秘密，物理学将在一个小时内完结！我是来迎接自己世界的末日，我的物理学啊，你这个冷酷的情人，你已穷尽之后我如何活得下去！” 丁仪不以为然地说：“这话在牛顿时代和爱因斯坦时代都有人说过，比如上世纪的马克斯。玻恩和史蒂芬。霍金，但物理学并没有结束，将来也不会结束。您很快就会看到，夸克将被击破，我们在通向无的阶梯上又踏上一级，我是来迎接自己世界的早晨！” “您这是抄袭毛**的理论，丁博士，他在上世纪50年代就提出物质无限可分的思想了。”琼斯反唇相讥。“你们过分沉湎于自己的思想了。”总工程师插进来说，“通过阳光同一时刻在埃及和希腊的干井中不同的投影，可以推测出地球是圆的，甚至由此可以计算出它的直径，但只有麦哲伦的旅行才是真正激动人心的。你们的这些理论物理学家以前只是呆在井里，今天我们才要在微观世界做真正的环球航行！”大屏幕上，能量曲线接近了那条红线。外面的世界似乎觉察到了这沙漠深处涌动的巨大能量，一群鸟儿从红柳丛中惊飞，在夜空中久久盘旋，远方传来阵阵狼叫……终于，能量曲线越过了红线，加速器中的粒子已获得了撞击夸克所需的能量，这是人类有史以来所获得的最高能量的粒子。控制计算机立刻把这些超能粒子引出了加速器周长150 公里的环道，进入一条支线，以接近光速的速度向靶标飞去。在这极限能量的轰击下，靶标立刻迸发出一场粒子辐射的暴雨。无数个传感器睁大眼睛盯着这场暴雨，它们能一瞬间分辨出暴雨中几个颜色稍有不同的雨滴，正是从这几个雨滴的组合中，超级计算机将判断出是否发生了撞击夸克的事件，并进一步判断夸克是否被撞碎。超能粒子在源源不断地产生，加速器中的撞击在持续，人们在紧张地等待着。超能粒子击中夸克的几率是很小的，他们不知道要等多长时间。“哦，来自远方的朋友们，”迪夏提老人打破沉默，“十多年前，这些东西开始修建时我就在这里。那时工地上有上万人，钢铁和水泥堆得像山一样高，还有几百个像大楼一样高的线圈，他们告诉我那是电磁铁……我不明白，这样多的钱和物，这样多的人力，能灌溉多少沙漠，使那里长满葡萄和哈密瓜，可你们干的事情，谁都不明白。“迪夏提大爷，我们在寻求物质世界最深的秘密，这比什么都重要！”丁仪说。 “我没有读过多少书，但我知道，你们这些世界上最有学问的人，在找世界上最小的沙粒。” 哈萨克老牧人对粒子物理出色的定义使在场所有的人都兴奋起来。“妙极了！”琼斯在听到翻译后叫起来，“他认为，”他指指丁仪，“沙粒要多小就有多小；而我认为，存在最小的沙粒，这粒沙子不能再小了，用最强有力的锤都不可能砸碎它，尊敬的迪夏提大爷，您认为我们谁对呢”迪夏提在听完翻译后摇了摇头：“我不知道，你们也不可能知道，世界万物究竟是怎么回事，凡人哪能搞清呢”“这么说，您是一位不可知论者”丁仪问。老牧人饱经风霜的双眼沉浸在梦幻般的回忆中：“世界真让人想不透啊！从小，我就赶着羊群在无边的戈壁滩上寻找青草。多少个夜晚，我和羊群躺在野外，看着满天的星星，那些星星密密麻麻的啊，晶亮晶亮的啊，像姑娘黑发中的宝石。夜深时，身下的戈壁还是热的，轻风一阵阵的，像它的呼吸……这时世界是活的，就像一个熟睡的大娃娃。这时不用耳朵，而用心听，你就能听到一个声音，那声音充满天地之间，那是真主的声音，只有他才知道世界究竟是怎么回事。”这时，蜂鸣器刺耳地响了，这是发生夸克撞击事件的信号，人们都转向大屏幕，物理学的最后审判日到了，人类争论了三千年的问题马上就会有答案。超级计算机的分析数据如洪水般在屏幕上涌出，两位理论物理学家马上发现事情不对，他们困惑地摇摇头。结果并没有显示夸克被撞碎，但也没有显示它保持完整，试验数据完全不可理解。突然，有人惊叫了一声，那是迪夏提，这里只有他对大屏幕上撞击夸克的数据不感兴趣，仍站在窗边：“天啊，外面怎么啦，你们快过来看啊！”“迪夏提大爷，请别打扰我们！”总工程师不耐烦地说，但迪夏提的另一句话使所有人都转过身去。“天……天怎么啦！”一片白光透进窗来，大厅中的人们向外看去，他们不相信自己的眼睛：整个夜空变成了乳白色！人们冲出了大厅，外面，在广阔的戈壁之上，乳白色的苍穹发着柔和的白光，像一片牛奶海洋，地球仿佛处于一个巨大的白色蛋壳的中心！当人们的双眼适应了这些时，他们发现乳白色的天空中有一群群的小黑点，仔细观察了那些黑点的位置后，他们真要发疯了。“真主啊，那些黑点……是星星！”迪夏提喊出了每个人都看到但又不敢相信的结论。他们在看着宇宙的负片。震惊之中，有人从窗外注意到了大厅中的那台正在转播球赛的电视机，屏幕上的情形证明了他们不是在做梦：千里之外的体育场也笼罩在一片白光中，看台上的几万人都惊恐地仰望着天空……“这是什么时候发生的”首先镇静下来的总工程师问。“刚才里面那个声音响起来的时候。”迪夏提说。人们沉默了，他们把目光都集中到琼斯和丁仪身上，希望这两位自爱因斯坦以来最杰出的物理学家，能对眼前这噩梦般的现实做出哪怕一点点解释。这时，两位物理学家已不看天空了，他们都在低头沉思。顷刻，丁仪首先抬起头来仰望着乳白色的宇宙，长长地出了一口气。“我们早该想到的。”他说。琼斯也抬起头来，望着丁仪：“是的，这就是超统一理论方程中那个变量的含义！”“你们在说什么”总工程师喊道。“工程师，我们的环球航行成功了！”丁仪笑着说。“你是说，是我们的试验导致了这一切”“事实正是！”琼斯说，同时掏出了那个银酒瓶，“现在麦哲伦知道了，地球是圆的。”“圆……的”其他的人都困惑地看着两位物理学家。“地球是圆的，从其表面任一点一直向前走，就会回到原点。现在我们知道了宇宙的时空形状，很类似。 我们一直向微观的深层走，当走到微观尽头时，就回到了整个宏观。加速器刚才击穿了物质最小的结构，于是其力量作用到最大的结构上，把整个宇宙反转了。“琼斯解释说。丁仪说：“琼斯博士，您可以活下去了，物理学没有完结，才刚刚开始，就像人类知道地球形状后，地理学刚刚开始一样。我们都错了，要说最接近事实的论述，是迪夏提大爷刚才说的，我虽不相信真主，但宇宙之深奥之神奇远远超过了我们的想像。” “我想起来了，上世纪，英国人阿瑟。克拉克在科幻小说中提出过宇宙负片的概念，但谁会想到它竟成为现实呢”“可现在怎么办”总工程师问。“现在很好，我很乐意生活在负片宇宙中，它和反转前的同样美，不是吗”琼斯喝干了瓶中的酒，微醉着伸开双臂，像要拥抱整个新宇宙。“可你们看……”总工程师从窗口指了指大厅里的电视，体育场里惊恐的骚动在加剧，一种集体的歇斯底里在人海中蔓延开来。从这个画面上可以想像，整个人类世界正陷入混乱之中。“继续轰击靶标。”丁仪对总工程师说。在第一次夸克撞击事件发生后，为了分析结果，控制计算机已中止了超能粒子对靶标的轰击。“你疯了鬼知道第二次夸克撞击事件会产生什么效应，也许会造成宇宙坍缩或大爆炸！”“不会的！前面的现象已证明了超统一方程的正确，我们知道下一次撞击会发生什么。”琼斯说。加速器中的超能粒子再次被引向靶标，人们期待着粒子的暴雨中那几滴不同颜色雨点的出现。1 分钟，2 分钟…… 10 分钟……各种曲线和数据在大屏幕上懒洋洋地滚动着，什么都没发生。电视屏幕上，体育场中的人海已失去了控制。在乳白色的天空下，人们无目标地乱撞，互相践踏……图像抖动了一下，电视信号中断了，屏幕上只有一片荒漠一样的雪花。宇宙的突变超出了人类所有的知识和想像，超出了他们的精神承受力，世界已处于疯狂的边缘。蜂鸣器第二次响了，夸克第二次被击中。没有任何预兆，比眨眼的速度更快，宇宙再次被反转。漆黑的夜空，晶莹的星群，人类的宇宙又回来了。“天啊，你们在干真主的事！”迪夏提大爷说。核子中心的人们这时都聚集在外面的戈壁滩上，聚集在醉人的星空下。“是的，对物质本原的不懈探索使我们拥有了上帝的力量，这真是做梦都想不到的。”琼斯说。“但我们仍是人，谁知道以后还会发生什么呢”丁仪说。 人们全都静了下来，凝望着夜空中灿烂的群星，似在谛听那若有若无的流淌在整个宇宙间的曼妙乐曲。 “真主啊……”迪夏提大爷对着星空伏下身来。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"}]},{"title":"坍缩_刘慈欣","date":"2016-12-12T08:36:35.000Z","path":"2016/12/12/20161212-1985坍缩-刘慈欣/","text":"坍缩作者：刘慈欣日期：1985 坍缩将在凌晨1时24分17秒时发生。 对坍缩的观测将在国家天文台最大的观测厅进行，这个观测厅接收在同步轨道上运行的太空望远镜发回的图象，并把它投射到一面面积有一个蓝球场大小的巨型屏幕上。现在，屏幕上还是空白。到场的人并不多，但都是理论物理学、天体物理学和宇宙学的权威，对即将到来的这一时刻，他们是这个世界上少数真正能理解其含义的人。此时他们静静地坐着，等着那一时刻，就象刚刚用泥土做成的亚当夏娃等着上帝那一口生命之气一样。只有天文台的台长在焦燥地来回踱着步。巨型屏幕出了故障，而负责维修的工程师到现在还没来，如果她来不了的话，来自太空望远镜的图象只能在小屏幕上显示，那这一伟大时刻的气氛就差多了。 丁仪教授走进了大厅。 科学家们都提前变活了，他们一齐站了起来。除了半径二百光年的宇宙，能让他们感到敬畏的就是这个人了。 丁仪同往常一样的目空一切，没有同任何人打招呼，也没有坐到那把为他准备的大而舒适的椅子上去，而是信步走到大厅的一角，欣赏起那里放在玻璃柜中的一个大陶土盘来。这个陶土盘是天文台的镇台之宝，是价值连城的西周时代的文物，上面刻着几千年前已化为尘土的眼晴所看到的夏夜星图。这个陶土盘经历了沧海桑田的漫长岁月已到了崩散的边缘，上面的星图模糊不清，但大厅外面的星空却丝毫没变。 丁仪掏出一个大烟斗，向一个上衣口袋里挖了一下，就挖出了满满一斗烟丝，然后旁若无人地点上烟斗抽了起来。大家都很惊诧，因为他有严重的气管炎，以前是不抽烟的，别人也不敢在他面前抽烟。再说，观测大厅里严禁吸烟，而那个大烟斗产生的烟比十支香烟都多。 但，丁教授是有资格做任何事情的。他创立了统一场论，实现了爱因斯坦的梦。 他的理论对宇宙大尺度空间所作的一系列预言都得到了实际观测的精确证实。后来，使用统一场论的数学模型，上百台巨型计算机不间断地运行了三年，得出了令人难以置信的结论：已膨胀了二百亿年的宇宙将在两年后转为坍缩。 现在，这两年时间只剩不到一个小时了。 白色的烟雾在丁仪的头上聚集盘旋，形成梦幻般的图案，仿佛是他那不可思议的思想从大脑中飘出…… 台长小心翼翼地走到丁仪身边，说：“丁老，今天省长要来，请到他不容易，请您一定对省长施加一些影响，让他给我们多少拔一些钱。本来不该用这些事使您分心的，但台里的经费状况已到了山穷水尽的地步，国家今年不可能再给钱，只能向省里要了。 我们是国内主要的宇宙学观测基地，可您看我们到了什么地步，连射电望远镜的电费都拿不出，现在，我们已经开始打它的主意了，“台长指了指丁仪正欣赏的古老的星图盘，”要不是有文物法，我们早就卖掉它了！“ 这时，省长同两名随行人员一起走进了大厅，他们的脸上露着忙碌的疲惫，把一缕尘世的气息带进这超脱的地方。“对不起，哦，丁老您好，大家好，对不起来晚了。 今天是连续暴雨后的第一个晴天，洪水形势很紧张，长江已接近一九九八年的最高水位了。“ 台长激动地说了许多欢迎的话，然后把省长领到丁仪面前，“下面请丁老为您介绍一下宇宙坍缩的概念……”他同时向丁仪递了个眼色。 “这样好不好，我先说说自己对这个概念的理解，然后请丁老和各位科学家指正。 首先，哈勃发现了宇宙的红移现象，是哪一年我记不清了。我们所能观测到的所有星系的光谱都向红端移动，根据开普勒效应，这显示所有的星系都在离我们远去。由以上现象我们可以得出结论：宇宙在膨胀之中，由此又得出结论：宇宙是在二百亿年前的一次大爆炸中诞生的。如果宇宙的总质量小于某一数值，宇宙将永远膨胀下去;如果总质量大于某一数值，则万有引力逐渐使膨胀减速，最后使其停止，之后，宇宙将在引力作用下走向坍缩。以前宇宙中所能观测到的物质总量使人们倾向于第一个结论，但后来发现中微子具有质量，并且在宇宙中发现了大量的以前没有观测到的暗物质，这使宇宙的总质量大大增加，使人们又转向了后一个结论，认为宇宙的膨胀将逐渐减慢，最后转为坍缩，宇宙中的所有星系将向一个引力中心聚集，这时，同样由于开普勒效应，在我们眼中所有星系的光谱将向蓝端移动，即蓝移。现在，丁老的统一场论计算出了宇宙由膨胀转为坍缩的精确时间。“ “精彩！”台长恭维地拍了几下手，“象您这样对基础科学有如此了解的领导是不多的，我想，丁老也是这么认为的。”他又向丁仪使了个眼色。 “他说的基本正确。”丁仪慢慢地把烟灰磕到干净的地毯上。 “对，对，如果丁老都这么认为……”台长高兴得眉飞色舞。 “正确到足以显示他的肤浅。”丁仪又从上衣口袋挖出一斗烟丝。 台长的表情凝固了，科学家们那边传来了低低的几声笑。 省长很宽容地笑了笑，“我也是学的物理专业，但以后这三十年，我都差不多忘光了，同在场的各位相比，我的物理学和宇宙学知识，怕是连肤浅都达不到。唉，我现只记得牛顿三定律了。” “但离理解它还差得很远。”丁仪点上了新装的烟丝。 台长哭笑不得地摇摇头。 “丁老，我们生活在两个完全不同的世界里。”省长感慨地说， “我的世界是一个现实的、无诗意的、烦锁的世界，我们整天象蚂蚁一样忙碌，目光也象蚂蚁一样受到局限。有时深夜从办公室里出来，抬头看看星空，已是难得的奢侈了。您的世界充满着空灵与玄妙，您的思想跨越上百光年的空间和上百亿年的时间，地球对于您只是宇宙中的一粒灰尘，现世对于您只是永恒中短得无法测量的一瞬，整个宇宙似乎都是为了满足您的好奇心而存在的。说句真心话，丁老，我真有些嫉妒您。我年轻时做过那样的梦，但进入您的世界太难了。”** “但今天晚上并不难，您至少可以在丁老的世界中呆一会儿，一起目睹这个世界最伟大的一瞬间。”台长说。 “我没有这么幸运。各位，很对不起，长江大堤已出现多处险情，我得马上赶到防总去。在走之前，我还有个问题想请教丁老，这些问题在您看来可能幼稚可笑，但我苦想了很长时间也没有弄明白。第一个问题，坍缩的标志是宇宙由红移转为蓝移，我们将看到所有星系的光谱同时向蓝端移动。但目前能观测到的最远的星系距我们二百亿光年，按您的计算，宇宙将在同一时刻坍缩，那样的话，我们要过二百亿年才能看到这些星系的蓝移出现。即使最近的半人马座，也要在四年之后才能看到它的蓝移。** 丁仪缓缓地吐出一口烟雾，那烟雾在空中飘浮，象微缩的旋涡星系。“很好，能看到这一点，使您有点象一个物理系的学生了，尽管仍是一个肤浅的学生。&gt; 是的，我们将同时看到宇宙中所有星系光谱的蓝移，而不是在从四年到二百亿年的时间上仍次看到。这源于宇宙大尺度范围内的量子效应，它的数学模型很复杂，是物理学和宇宙学中最难表述的概念，没有希望使您理解。但由此您已得到第一个启示，它提醒您，宇宙坍缩产生的效应远比人们想象的复杂。您还有问题吗？哦，您没有必要马上走，您要去处理的事情并不象您想象的那样紧迫。” “同您的整个宇宙相比，长江的洪水当然微不足道了。但丁老，神秘的宇宙固然令人神往，现实生活也还是要过的。我真的该走了，谢谢丁老的教诲，祝各位今晚看到你们想看的。” “您不明白我的意思，”丁仪说，“现在长江大堤上一定有很多人在抗洪。” “但我有我的责任，丁老，我必须回去。” “您还是不明白我的意思，我是说大堤上的人们一定很累了，你可以让他们也离开。” 所有的人都惊呆了。 “什么……离开？！干什么，看宇宙坍缩吗？” “如果他们对此不感兴趣，可以回家睡觉。” “丁老，您真会开玩笑！” “我是认真的，他们干的事已没有意义。” “为什么？” “因为坍缩。” 沉默了好长时间，省长指了指大厅一角陈列的那个古老的星图盘说：“丁老，宇宙一直在膨胀，但从上古时代到今天，我们所看到的宇宙没有什么变化。坍缩也一样，人类的时空同宇宙时空相比，渺小到可以忽略不计，除了纯理论的意义外，我不认为坍缩会对人类生活产生任何影响。甚至，我们可能在一亿年之后都不会观测到坍缩使星系产生的微小位移，如果那时还有我们的话。” “十五亿年，”丁仪说，“如果用我们目前最精密的仪器，十五亿年后我们才能观测到这种位移，那时太阳早已熄灭，大概没有我们了。” “而宇宙完全坍缩要二百亿年，所以，人类是宇宙这棵大树上的一滴小露珠，在它短暂的寿命中，是绝对感觉不到大树的成长的。您总不至于同意互联网上那些可笑的谣言，说地球会被坍缩挤扁吧！” 这时，一位年轻姑娘走了进来，她脸色苍白，目光暗淡，她就是负责巨型显示屏的工程师。 “小张，你也太不象话了！你知道这是什么时候吗？！”台长气急败坏地冲她喊到。 “我父亲刚在医院去世。” 台长的怒气立刻消失了，“真对不起，我不知道，可你看……” 工程师没再说什么，只是默默地走到大屏幕的控制计算机前，开始埋头检查故障。 丁仪叮着烟斗慢慢走了过去。 “哦，姑娘，如果你真正了解宇宙坍缩的含义，父亲的死就不会让你这么悲伤了。” 丁仪的话激怒了在场的所有人，工程师猛地站起来，她苍白的脸由于愤怒而胀红，双眼充满泪水。 “您不是这个世界上的人！也许，同您的宇宙相比，父亲不算什么，但父亲对我重要，对我们这些普通人重要！而您的坍缩，那不过是夜空中那弱得不能再弱的光线频率的一点点变化而已，这变化，甚至那光线，如果不是由精密仪器放大上万倍，谁都看不到！坍缩是什么？对普通人来说什么都不是！宇宙膨胀或坍缩，对我们有什么区别？！但父亲对我们是重要的，您明白吗？！” 当工程师意识到自己是在向谁发火时，她克制了自己，转身继续她的工作。 丁仪叹息着摇摇头，对省长说：“是的，如您所说，两个世界。我们的世界，”他挥手把自己和那一群物理学家和宇宙学家划到一个圈里，然后指指物理学家们，“小的尺度是亿亿分之一毫米，”又指指宇宙学家们，“大的尺度是百亿光年。这是一个只能用想象来把握的世界；而你们的世界，有长江的洪水，有紧张的预算，有逝去的和还活着的父亲……一个实实在在的世界。但可悲的是，人们总要把这两个世界分开。 “可您看到它们是分开的。”省长说。 “不！基本粒子虽小，却组成了我们；宇宙虽大，我们身在其中。微观和宏观世界的每一个变化都牵动着我们的一切。” “可即将发生的宇宙坍缩牵动着我们的什么吗？” 丁仪突然大笑起来，这笑除了神经质外，还包含着一种神秘的东西，让人毛骨耸然。 “好吧，物理系的学生，请背诵您所记住的时间空间和物质的关系。” 省长象一个小学生那样顺从地背了起来：“由相对论和量子力学所构成的现代物理学已证明，时间和空间不能离开物质而独立存在，没有绝对时空，时间、空间和物质世界是融为一体的。” “很好，但有谁真正理解呢？您吗？”丁仪问省长，然后转向台长，“您吗？”，转向埋头工作的工程师，“您吗？”，又转向大厅中的其他的技术人员，“你们吗？”，最后转向科学家们，“甚至你们？！ 不，你们都不理解。你们仍按绝对时空来思考宇宙，就象脚踏大地一样自然，绝对时空就是你们思想的大地，离开它你们对一切都无从把握。谈到宇宙的膨胀和坍缩，你们认为那只是太空中的星系在绝对的时间空间中散开和会聚。” 他说着，踱到那个玻璃陈列柜前，伸手打开柜门，把那个珍贵的星图盘拿了出来，放在手上抚摸着，欣赏着。台长万分担心地抬起两只手在星图盘下护着，这件宝物放在那儿二十多年，还没有人敢动一下。台长焦急地等着丁仪把星图盘放回原位，但他没有，而是一抬手，把星图盘扔了出去！ 价值连城的古老珍宝，在地毯上碎成了无数陶土块。 空气凝固了，大家呆若木鸡。只有丁仪还在悠然地踱着步，是这僵住的世界中唯一活动的因素，他的话音仍不间断地响着。 “时空和物质是不可分的，宇宙的膨胀和坍缩包括整个时空，是的，朋友们，包括整个时间和空间！” 又响起了一声破裂声，这是一只玻璃水杯从一名物理学家手中掉下去。引起他们震惊的原因同其他人不一样，不是星图盘，而是丁仪话中的含义。 ※ ※ ※ “您是说……”一名宇宙学家死死地盯住丁仪，话卡在喉咙里说不出来。 “是的。”丁仪点点头，然后对省长说，“他们明白了。” “那么，这就是统一场数学模型的计算结果中那个负时间参量的含义？！”一名物理学家恍然大悟地说。丁仪点点头。 “为什么不早些把它公布于世？！您太不负责任了！”另一名物理学家愤怒地说。 “有什么用？只能引起全世界范围的混乱，对时空，我们能做些什么？” “你们都在说些什么？！”省长一头雾水地问。 “坍缩……”台长，同时是一名天体物理学家，做梦似地喃喃地说。 “宇宙坍缩会对人类产生影响，是吗？” “影响？不，它将改变一切。” “能改变什么呢？” 科学家们都在匆匆地整理着自己的思绪，没人回答他。 “你们就告诉我，坍缩时，或宇宙蓝移开始时，会发生什么？”省长着急地问。 “时间将反演。”丁仪回答。 “……反演？”省长迷惑地望望台长，又望望丁仪。 “时光倒流。”台长简短地解释。** 巨型屏幕这时修好了，壮丽的宇宙出现在大家面前。为了使坍缩的出现更为直观，太空望远镜发回的图象由计算机进行变频处理，并对频率变化所产生的色彩效应进行了视觉上的夸张。现在所有的恒星和星系发出的光在大屏幕上都呈红色，象征着目前膨胀中宇宙的红移。当坍缩开始时，它们将同时变为蓝色。屏幕的一角显示出蓝移出现的倒计时：一百五十秒。 “我们的时间随宇宙膨胀了二百亿年，但现在，这膨胀的时间只剩不到三分钟了，之后，时间将随宇宙坍缩，时光将倒流。”丁仪走到木然的台长面前，指指摔碎的星图盘，“不必为这件古物而痛心，蓝移出现后不久，碎片就会重新复原，它会回到陈列柜中去，多少年以后，回到土中深埋，再过几千年的时间，它将回到燃烧的窑中，然后做为一团潮泥回到那位上古天文学家的手中……”，他走到那位年轻的女工程师身边， “也不要为你的父亲悲伤，他将很快复活，你们很快就会见面。如果父亲对你很重要，你应该感到安慰，因为在坍缩的宇宙中，他比你长寿，他将看着你做为婴儿离开这个世界。是的，我们这些老人都是刚刚踏上人生旅途，而你们年轻人则已近暮年，或说幼年。”他又走到省长面前，“如果过去没有，那么长江的洪水未来永远不会在您的任期内越出江堤，因为现在宇宙中的未来只剩一百秒了。坍缩宇宙中的未来就是膨胀宇宙中的过去。最大的险情要到一九九八年才会出现，但那时您的生命已接近幼年，那不是您的责任了。还有一分钟，现在无论做什么，都不会对将来产生后果，大家可以做各自喜欢的事情而不必顾虑将来，在这个时间里已经没有将来了。至于我，我现在只是干我喜欢，但以前由于气管炎而不能干的一件小事。”丁仪又用大烟斗从口袋里挖了一锅烟丝，点上悠然地抽了起来。 蓝移倒计时五十秒。 “这不可能！”省长叫到，“从逻辑上这说不通，时间反演？一切都将反过来进行，难道我们倒着说话吗？这太难以想象了！” “您会适应的。” 蓝移倒计时四十秒。 “也就是说，以后的一切都是重复，那历史和人生变得多么乏味。” “不会的，你将在另一个时间里，现在的过去将是您的未来，我们现在就在那时的未来里。您不可能记住未来，蓝移开始时，您的未来一片空白，对它，您什么都不记得，什么都不知道。”** 蓝移倒计时二十秒。 ※ ※ ※ “这不可能！” “您将会发现，从老年走向幼年，从成熟走向幼稚是多么合理，多么理所当然，如果有人谈起时间还有另一个流向，您会认为他是痴人说梦。快了，还有十几秒，十几秒后，宇宙将通过一个时间奇点，在那一点时间不存在。然后，？我们将进入坍缩宇宙。 蓝移倒计时八秒。 “这不可能！真的不可能！！” “没关系，您很快就会知道的。” ※ ※ ※ 蓝移倒计时五秒，四，三，二，一，零。 宇宙中的星光由使人烦燥的红色变为空洞的白色…… ……时间奇点…… ……星光由白色变为宁静美丽的蓝色，蓝移开始了，坍缩开始了。 …… ……了始开缩坍，了始开移蓝，色蓝的丽美静宁为变色白由光星…… ……点奇间时…… ……色白的洞空为变色红的烦燥人使由光星的中宙宇 。零，一，二，三，四，秒五时计倒移蓝 “。的道知会快很您，系关没” “！！能可不的真！能可不这” 。秒八时计倒移蓝 “。宙宇缩坍入进将们我，后然。在存不间时点一那在，点奇间时个一过通将宙宇，后秒几十，秒几十有还，了快。梦说人痴是他为认会您，向流个一另有还间时起谈人有果如，然当所理么多……","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"}]},{"title":"刘慈欣作品-按创作时间排序","date":"2016-12-12T00:47:24.000Z","path":"2016/12/12/刘慈欣作品-按创作时间排序-20161212/","text":"刘慈欣作品（按创作时间排序） 01.坍缩 【短篇 1985】02.微观尽头 【短篇 1987】03.中国2185 【长篇 1989】04.超新星纪元 【长篇 1991】05.大艺术三部曲之 &lt;梦之海&gt; 【短篇 1997】06.大艺术三部曲之 &lt;诗云&gt;(又名&lt;李白&gt;) 【短篇 1997】07.大艺术三部曲之 &lt;欢乐颂&gt; 【短篇 1997】","tags":[{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"},{"name":"书单","slug":"书单","permalink":"http://sniperkaka.com/tags/书单/"}]},{"title":"Doom启示录-读书笔记-03","date":"2016-11-29T07:37:15.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129-03/","text":"第十三章 死亡竞赛 1997 年初，约翰·罗梅洛——王牌程序员、现实富翁、死亡竞赛手术师——永远地离开了。 卡马克的第一个尝试是正处在萌芽时期的三维图像加速卡。在过去，只有街机具备专门的三维图像加速及改善功能，随着 Doom 和Quake 等强大的三维引擎不断涌现，一些刚起步的公司看到了把三维加速带入普通家庭的商机，那些高速图像处理芯片可以被嵌入到显卡中，然后用户可以把这显卡插入他们的计算机。3Dfx 公司推出了名为 Voodoo 的首批三维图像加速卡，他们还说服卡马克，请他把 Quake引擎用 OpenGL 图像编程接口重写，以发挥出新硬件的优势。卡马克用一个周末完成了这项工作，并把 OpenGL 版本的 Quake 免费发布到了网上。 卡马克的成果让玩家们咋舌不已：游戏至少比原来流畅了 20%，而且图像更为逼真。由简入奢易，由奢入简难，一旦他们看过了硬件加速下的 Quake，他们就再也不想回到原来的软件渲染模式，他们毫不犹豫地把标价几百美元的 Voodoo 卡带回家升级爱机。其他程序员们也开始针对 3Dfx 加速卡编程，没错，跟随卡马克，这已经慢慢变成一种模式。其他显卡制造商也加入了三维加速市场的争夺，一个高科技的产业诞生了。伴随着 GLQuake 成功的，还有卡马克的另一个项目：Quakeworld，他写的这个免费程序把 Quake 的多人游戏带到了一个新的高度。随着 OpenGL 带来的图像改进，以及 Quakeworld 带来的网络改进，Quake 达到了前所未有的完美。 在那时，游戏开发者的名气起着举足轻重的作用，席德·梅尔——《文明》系列的传奇设计师，有他自己的公司：Firaxis；威尔·赖特（Will Wright）——畅销游戏《模拟城市》的创造者，有他自己的公司：Maxis；理查德·盖略特——《创世纪》之王，有他自己的公司：维真；甚至盖略特的前雇员，克里斯·罗伯茨（Chris Roberts），也开办了自己的 Digital Anvil 公司。在《德军总部 3D》、Doom、Quake 这些巨大成功背后的罗梅洛，已不止是声名显赫，他简直是个金矿。 狂热的 Doom 和 Quake 迷们蜂拥而至，他们的简历和他们制作的模式塞满了离子风暴公司的电子邮件服务器，罗梅洛在其中挑选了一些他满意的：那些能让他眼前一亮的作品。 1997 年初，这些终极玩家们从四面八方赶到离子风暴的临时办公室来上班，以及，和他们的精神领袖——罗梅洛，进行死亡竞赛。要知道，他们过去几年完全就是生活在罗梅洛创造的游戏世界里。布赖恩·爱瑟罗（Brian Eiserloh），那著名的天体创作营主办者，在寄来一篇中世纪风格的散文后获得录用；威尔·罗康托（Will Loconto）放弃他在工业金属乐队“信息社会”（Information Society）的演出，担任了离子风暴的音响师；斯维若·克维恩莫（Sverre Kvernmo），Doom 社群里的明星作家，离开了故土挪威，成为罗梅洛麾下的首席关卡设计师。这无疑是他们人生道路上的一次重大抉择，但他们几乎不经考虑就做出了决定，毕竟，“我们是罗梅洛时代的产物。” 斯维若如是说。 离子风暴把自己描绘成了自由与梦想的化身，而 id，只是个毫无生气和生机的老顽固。这不只是两家公司的对比，这是两种世界观的对比：设计和技术，艺术和科学，狄俄尼索斯和阿波罗。“id 是一家以技术为主导的公司，”麦克说：“而离子风暴则着重于艺术美感的自由发挥。在 id，当图像引擎完成时，设计师和美工们已经没有多少时间来制作游戏本身了，我们认为这不是一个很好的做法，它没有合理地平衡技术和设计所占的比重。” 卡马克一直保持着沉默，但办公室里的火药味越来越浓，这让他无法置身事外，最终，他决定体验一下放弃自控力的感觉，或者，用他的话说，做一次“情绪操控方面的试验”。他选择了一个大牌媒体来作为他首次参战的舞台：《时代》周刊。在那一期上，有篇两页多长的罗梅洛个人介绍，卡马克在接受访谈时，直言不讳地告诉公众，和罗梅洛的一贯说法相反：这位前任拍档的离去不是辞职，而是被解雇。“在变得有钱有名后，罗梅洛失去了工作的动力，然后公司把辞职书放到了他面前。”卡马克嘲弄了罗梅洛对于财富和名望的野心，“而我只想拥有几辆法拉利。”卡马克还补充道，罗梅洛“不可能”像他承诺的那样在圣诞节前拿出《大刀》。 Quake 引擎里的真三维技术是一次质的飞跃，而 Quake2，卡马克不觉得它在技术上有多大进步。尽管如此，新引擎仍然足以使人过目难忘，最显著的，就是 Quake2 能够以软件和硬件加速两种模式进行渲染，也就是说，拥有三维加速卡的玩家将看到前所未有的图像效果——彩色的光影、平滑的物体表面、等等，那是一种栩栩如生的、流畅的、影院般的游戏体验。 大展进行到尾声时，玩家们纷纷把注意力投向了另一项活动：id 公司赞助的“赤色全歼”（Red Annihilation）死亡锦标赛。房间正中放着比赛的奖品——卡马克那辆红色的法拉利 328 跑车。“在《德军总部 3D》获得成功后，我买了我的第一辆法拉利，”卡马克告诉媒体：“Doom 和 Quake 又为我带来了三辆，我一个人开不了那么多，但我不想把它们卖掉或是停在车库里，我要把它送给玩家，说到底，id的成功离不开玩家们的支持，这次死亡竞赛的王者就将获得这顶桂冠。” 这世界永远充满竞争，和意外。 第十四章 硅堡 主视角射击游戏。Doom、Quake、毁灭公爵 3D。 铺天盖地的射击游戏已使媒体猜测起谁能扮演“Quake 终结者”的角色，从而把 id 赶下神坛。《毁灭公爵 3D》早已被认为是很有潜质的一部作品，而现在，一家由几个前微软职员在西雅图开设的公司：Valve，使用 Quake 的引擎制作了《半条命》（Half-Life），它在 E3 大展上博得玩家和媒体的一致称赞。斯科特·米勒前些年在北加州发现的一家名叫 Epic 的公司也制作了一款主视角射击游戏：《虚幻》（Unreal），它的演示版同样好评如潮；当然，还有《罗梅洛的大刀》。所有这些游戏都即将上市，包括 id 自己的 Quake2。硅堡的决战必将是近几年最精彩纷呈的一出大戏。 他们时常举办这样的跑车大赛，前一次，卡马克甚至把电话打给了麦斯奎特的市长，请他把当地机场关闭一段时间以用于赛车，市长没有什么好考虑的——恭敬不如从命，因为，卡马克给当地警察局捐助过上万美元的装备和设施，其中包括绣着 Doom标志的防弹服，他的请求自然应该得到满足。 1997 年 12 月 9 日，id 发布 Quake2。 当他一个星期后回到麦斯奎特的办公室里更新计划文件时，他发现自己还想说说其他心情，这在卡马克而言是难得一见的： 姓名：约翰·卡马克职务：程序员项目：Quake2最近更新：1998 年 2 月 4 日 03:06:55 （美国中部标准时间） 嗯，我太长时间没有更新计划文件了。 封闭研究进行得很顺利，在一个礼拜里，我除了买可乐外就没有出过旅店的门，这简直太安逸了，因为办公室里的杂事已经让我有点无法忍受。以后，在项目不紧时，我很可能会经常做这样的封闭式研究，每季度一次听起来比较合适。 现在要具体谈论三次元引擎还为时过早，Quake 在架构完全成型之前走了不少弯路（光树、门洞、等等），所以我知道，现在研究的东西很可能会有变动，我不想说任何会被某些人当做是“承诺”的话。 我只能说，工作的进展很激动人心。 许多游戏开发者从事这一行是为了制作出最终的游戏，中间漫长的开发阶段只是不得不经历的过程，我尊重他们的工作态度，但我从事游戏开发的动机略有不同。当然，我也为游戏的完成而自豪，但这途中所克服的各种困难却更加让我铭记。我已记不清我们那些老游戏发布时的情景，但我清楚地记得那些技术上的突破，早至《基恩》时的 CRTC 回绕，以实现平滑的卷轴效果（准确地说，早至理解苹果 2 汇编语言中并联数组里的结构体……），知识是需要积累的，学习是需要循序渐进的。 我的人生就是以知识的积累和学习的不断深入来分为不同阶段。 我启蒙阶段用的是学校里的苹果 2 型机，但当时的条件局限了我的学习速度和深度。今天的状况已经好多了，只要有一台便宜的二手PC 机、一张 Linux 光盘和一个因特网的账号，你就拥有了足够的工具和资源，你就可以达到任何你期望的编程境界。 《软盘》的头六个月对我而言如同活在梦里，平生第一次，我身边有了比我更博识的程序员（罗梅洛和罗瑟），我手边有了大量的书籍和资料，而且我可以全身心投入到编程中，那真是一段好时光。 接下来的两年，直到 Doom 和几个家用机版本移植完成，我在稳步提高着我的知识面和技术水平，其中包括：更深入的图像编程、网络、Unix、编译原理、跨平台、RISC 架构、等等。 Quake 开发的第一年简直如同腾云驾雾，有迈克尔·亚伯拉什作为顾问，我尝试了大量新鲜课题。如果科班出身的图像程序员们知道我在写 Doom 时有多业余，他们肯定会大吃一惊，那时的我甚至不能正确地剪切墙体多边形（这就是为什么我用了那莫名其妙的极坐标系统），Quake 逼着我踏上正轨，同时探索出新思路。 Quake 开发的最后半年是在痛苦中度过的，那时我满脑子只想着把这该死的东西做完，当然，一切付出到后来都有了回报，但我绝不怀恋这段时光。 Quake2 开发的过程中，我的学习经历又得到了进一步扩充：GLQuake、quakeworld、radiosity、OpenGL 工具开发、Win32 编程、等等，与此同时，我也有了不少关于下一步如何做的想法。 我认为接下来三位元引擎的开发将和 Quake 一样硕果累累。我在一些课题上已经有了非常深入的理解，我还正在尝试一些图像编程以外的全新领域，它们将会和我所有其他方面的工作产生积极互动。 末了，自然也会有一个精彩的游戏。:） 麦基想道，自从罗梅洛离开后，公司迟早会走到今天的地步：一个缺乏制衡的 id。 麦基不是惟一怀念罗梅洛的人，从未和罗梅洛共事过的斯蒂德也开始认为解雇罗梅洛是一个惨痛的错误。“罗梅洛是随意散漫，而卡马克是严肃认真，他们的搭配就像是一动一静的太极两仪，但如果他们分开，那是什么？” 五月份举行的 1998 年度 E3 大展上，《大刀》的演示依然让人失望，其他射击游戏，譬如刚发布的《虚幻》和即将发布的《半条命》，以及 id 的 Quake3，夺走了所有风头。 第十五章 1999 年 4 月 20 日中午，埃里克·RebDoomer·哈里斯（Eric “RebDoomer” Harris）和他最要好的朋友迪伦·Vodka·克里波德（Dylan “Vodka” Klebold）浑身挂满弹药，冲进科罗拉多州利特尔顿城的科隆比纳中学，制造了死亡十五人——包括他们自己——的校园枪击案。这起通过电视直播的惨剧震惊了全美国，惶惶然的家长们、教师们、政客们，以及同学们怎么也想不通，为什么两名毫不起眼的中学生竟是冷血杀手？他们需要一个合理的解释，为此，他们要找件事物来加以责难。 1999 年 4 月 21 日下午 4 点 13 分，Blue’s News 网站的编辑史蒂夫·西斯里普（Steve Heaslip）发布消息：“据几名网友反映，他们透过电视上装有嫌疑犯物品的塑料袋看到了 Doom 标记……到目前为止，还没有人把这些物品和案件联系起来。”但随着杀手的 Doom 游戏、Doom 书籍、Doom 影带被一一发现，这联系很快就建立了起来。 由此，总统先生启动了一项联邦调查活动，以决定游戏或其他娱乐公司是否需要为向儿童推销暴力产品而承担法律责任。业界人士声称游戏都是由成人制作，并且也是面向成人的，但这无法令人信服，克林顿总统补充道：“谁能毫不心虚地说，暴力游戏的初衷就是面向成人？”三天后，列博曼议员和约翰·麦肯（John McCain）颁布了解决方案：《二十一世纪媒体职责法案》（Twenty-first Century Media Responsibility Act），它的强大之处在于，它试图建立起一个涵盖电影、音乐、游戏的评定标准，如果它得以通过，那么，卖暴力游戏给未成年人的零售商就要面临一万美元的罚款。游戏业界一贯赞成分级系统，他们已经成立了自己的 ESRB，只是政府的干预和建立所谓的标准让他们无法接受。但华盛顿方面的意思很强硬：你们再好好反省反省。 《雷神竞技场》（Quake III Arena） 现在看起来，罗梅洛心中所谓‘大公司’的梦想似乎走得太远了，他们太放纵、太浮躁、太自大，他那些卡马克曾斥责过的毛病——三心二意、盲目自信、人海战术——终于使他在残酷的现实面前撞得头破血流，但现在说什么都为时已晚。 在圣何塞市举办的年度游戏开发者大会上，id 的人们看到了《虚幻竞技场》（Unreal Tournament），它的制作者就是在 1998 年出品了《虚幻》的 Epic 公司，这家公司已成为了 id 最强有力的竞争对手，其主程序员提姆·斯威尼也赢得了广泛尊敬，他们甚至还雇到了两位前 id 职员来做市场商务：杰伊·威尔伯和马克·瑞恩——《德军总部 3D》时的“试用经理”。Epic 的《虚幻》，和 Valve 的《半条命》类似，给主视角射击流派带来了更多的内涵，此外，它的图像引擎是自行开发的，这已经颇让 id 为之侧目，而他们这次的《虚幻竞技场》则更让 id 惊诧莫名——它是个只支持多人对战的游戏，和 Quake3 一样。 第十六章 2000 年底，卡马克双喜临门，一是 id 发布了 Quake3，二是他迎来了自己的婚礼。加利福尼亚一位女商人兼 Quake迷凯瑟琳·安娜·康（Katherine Anna Kang） “女人并不是男人的附属，跨种族的联姻不是什么孽缘，就好比，资本主义不是毒草，社会主义也不一定就是万金油。”美籍俄裔女作家艾·兰德（Ayn Rand）是安娜的精神偶像，她希望自己能像兰德笔下《源泉》（The Fountainhead）里的盖尔·威纳德（Gail Wynand）一样强大。在 Quake 的世界里，她做到了。 在一次访谈中，卡马克被问起童年的经历，他讲述了一些关于火箭、炸弹、少年之家的故事，以及，他回想道，那时的他是一个多么“不识好歹的小子”。采访结束后，卡马克到网上浏览了一番业余火箭界的近况，展现在他眼前的是一片多姿多彩并充满竞争的景象，黒客们、工程师们、爱好者们，正在建造大型的高能载人火箭，他们要进入外太空。卡马克一下子就来了兴趣。 头几个礼拜，卡马克买了一些火箭模型回来，他看着它们呼啸爬升，他开始深入了解起业余火箭爱好者们的世界：这里的人们认为美国国家航天总署（NASA）只不过是一家载重货运公司，爱好者们的目标是一千万美元的“X 大奖”——把三名乘客送到外太空。当然，让卡马克感兴趣的是技术上的挑战。 卡马克支起发射台：一个红黑相间的架子，配有一根指向天空的细长固定杆。他拿出火箭，这时他还要估计一下风力和风向。他以前在这玩的时候曾经被强风把火箭吹得不见了踪影，后来他想了个办法：由便携式计算机和无线调制解调器组成接收端，再给火箭配备上信号发射器，他就有了一个很实用的定位系统。 卡马克厌恶那种貌似先哲圣贤般的夸夸其谈，但如果你一定坚持，他也会聊聊他的想法。“在信息时代，客观障碍已不复存在，”他说：“所谓障碍都是主观上的。如果你想动手开发什么全新的技术，你不需要几百万美元的资金，你只需要在冰箱里放满比萨和可乐，再有一台便宜的计算机，和为之献身的决心。我们在地板上睡过，我们从河水中趟过。” 他揿下按钮，一阵浓烟和爆炸声后，火箭高高飞扬在了秋日牧场的上空。 跋 id 的游戏及技术授权给他带来了足够的财富，他经常给慈善事业捐款，他不需要那么多钱。在技术上，长年浸淫于图像编程中的他几乎达到了禅宗般的境界，浴室墙壁上的光斑在他眼里只不过是水龙头上镜面反射光产生的漫反射效果，但这种理解方式并没有使他与现实世界脱节，相反，这使他更加对世界心存感激：“这些就是摄人魂魄的景象，我不需要走到大峡谷边才能感叹于造物的神奇，我可以就坐在屋里，看光线反射的样子。” 罗梅洛则乐意把心思都放到家里，他和斯狄薇愉快地享受着田园生活。他已决定重头来过，他说，回到自己的老本行：设计和制作游戏。尽管外界对《异次元》的评价都不错，但在看过几份传统的出版订单后，罗梅洛、斯狄薇、汤姆三人还是决定去探索未知的掌上电脑和手机等移动市场。作为第一个进军这新生产业的游戏名人，罗梅洛无疑又成了啦啦队长，只不过以前是为 PC，而现在是为手持设备。 作者后记及致谢 我尤其要感谢两位约翰。我不知道他们在回答我那些问题时会作何感想，在那许多个夜里，他们一直无比耐心和宽容。卡马克毫无保留地托出了他的想法和回忆——就像他与世界分享他的代码一样，他还带我一起去放飞火箭，甚至让我亲手驾驶了一会改装过的法拉利。罗梅洛总是乐于去发掘他那包罗万象的收藏库：游戏、艺术品、漫画、汉堡王的收据、等等、等等、等等，他和斯狄薇甚至还让我在他们的乡间农庄里自行翻找，对此我至今心存感激。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"Doom启示录-读书笔记-02","date":"2016-11-29T06:55:58.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129-02/","text":"第四章 买比萨的钱 罗梅洛和卡马克在性格上有一个很明显的不同，这个差异在他们合作的早期就已显现出来，那就是他们对待时光的态度。也正是类似这样的差异，使他们成为完美的搭档，也使他们无可挽回的决裂。 卡马克只活在他当前的时刻。专注，是他力量的源泉。他心中既没有对未来的憧憬，也没有怀旧的思绪，他的注意力全部集中于如何解决眼前错综复杂的问题：思考、编码。他不保留任何过去的东西：照片、记录、游戏、磁盘。他甚至连他的那些处女作——《鬼魂》和《造影》——都没有留一份拷贝。他没有学校的年鉴可唤起他学生时代的回忆，他也不保存刊登过他早期作品的杂志。他只有他在当下要用到的东西。他的卧室由一盏台灯、一个枕头、一条毯子和一堆书组成，甚至没有床垫。他什么都没从家里带出来，除了咪子（Mitzi），一只他继母送给他的猫。 罗梅洛则完全相反，他沉浸在所有的时光里：过去、现在、未来。他不光对这些时光都充满热情，而且还付诸行动：他收藏起曾经的事物、他陶醉于眼前的欢欣、他勾画着未来的蓝图。他记得每一个约会、每一个名字、每一个游戏，他保留着信件、杂志、磁盘、“汉堡王”的收据、照片、各种存根。他也抓住所有机会让每一天都开开心心，譬如开一个更逗的玩笑，或是讲一个更有趣的故事，或是做一个更夸张的鬼脸。但他这绝不是狂躁，他知道如何去专注，他只是过于情绪化而已，当他愉快的时候，他对所有的事物都充满热爱，而当他沮丧的时候，他又变得冷漠迟钝。汤姆管他这种情绪变动叫“像比特一样摇来摆去”，因为他就像计算机里存储数据的二进制比特一样，一会是开，一会是关。 1990 年 9 月 20 号的那个宿命的早晨，罗梅洛的状态跳到了开，他会把这个早晨深深地烙在记忆里，而卡马克则没过多久就会把它忘了，但不管怎样，这个早晨对他们而言都同样的重要。卡马克用他非凡的专注解决了一个迫在眉睫的挑战：在 PC 上实现卷轴效果。罗梅洛则预见了卡马克的成果可能带来的事物。卡马卡制作了调色板，然后罗梅洛用这个调色板绘出了一个未来，很明显，这个未来不会和《软盘》有任何关系。 他们已经有了一个梦幻般的团队：卡马克，天才小子和图像编程的领头羊，罗梅洛，游戏制作的多面手和公司的啦啦队长，艾德里安，沉迷于黑暗的艺术家，汤姆，游戏设计师和超现实主义漫画家，还有雷恩——尽管罗梅洛对他仍不是很满意，但还是想再给他一次机会。更重要的是，他们正好能互相取长补短：卡马克的沉静平衡了罗梅洛那四溢的热情，艾德里安那阴森的画风与汤姆那卡通般的喜剧风格正好相反。他们现在只缺一个人来处理商业事务——筹集经费、平衡账目以及日常管理。说到这里，每个人都看向了杰伊。 在做《超级马里奥》演示版的这个周末，他们就簇拥在这房子里。一张大桌子上架起了两台计算机，这桌子本是卡马克用来和他们通宵玩《龙与地下城》用的，罗梅洛和卡马克现在坐在这桌子边一起写程序，汤姆一人扛下了所有美工的活，雷恩负责做动画，譬如那些小海龟。他们已经事先把游戏的过程录制了下来，为了不错过任何一个细节，汤姆把录像带倒来倒去，不时按下暂停，好仔细地观察。 连续的七十二小时里，他们进入了压榨模式。没有人睡觉，他们喝掉了无数含咖啡因的苏打水，送比萨的小伙子每隔一段时间就来一次，杰伊烤了不少肉饼和热狗，但大部分都放在那里没人碰。他们分毫不差地复制出了这个游戏：马里奥蹲着走的时候的小碎步，他跳起来的动作，他踩到小海龟上以及把它们踢飞时的样子，那些掉下来的金币，那些云彩，以及——那平滑的卷动。当他们完成的时候，屏幕上的东西已经和那有史以来卖得最好的游戏毫无二致了，惟一有点不同的是开始画面，在任天堂的版权声明下方，多了一行制作公司的名称，那自然是罗梅洛和雷恩的“深思软件”。 于是他按照当时的做法，发布了两个完整的文本游戏，坐等着收钱，但汇款过来的玩家却少得可怜，几乎没有。他开始觉得：玩家，和那些真正购买工具软件的人是不尽相同的，他们大都只对可以直接得到的免费东西感兴趣。斯科特又观察了一段时间，发现像他这样快破产的游戏制作者还有很多，他们的共同之处是他们都把整个游戏一起作为共享软件发布。他意识到，玩家也许是诚实的，愿意购买他们喜欢的游戏，但同时他们也是怕麻烦的，既然已经玩到了整个游戏，他们也就懒得再去办付款的手续。要给他们一个付款的理由和动机。 于是他想出个点子：为什么要把整个游戏一起放出去呢？为什么不只发布其中的一小部分，然后让玩家们从他手里购买完整的游戏呢？没有人尝试过这种做法，但它看上去没有什么问题。斯科特在做的新游戏恰好很适合用这种方式来发行，因为这个游戏是由若干段情节，或者说是“关卡”组成的。他可以只发布其中的一部分，譬如十五个关卡，然后告诉玩家，如果他们想玩其余的三十个关卡，那么，请寄张支票过来。 斯科特向罗梅洛解释道，一个理想的共享软件游戏应该具备这么几个要素：尺寸小，动作类，可以分成若干个关卡。因为共享软件大都通过 BBS 分发，所以它必须足够小，才能通过调制解调器下载。图像丰富的大型游戏，譬如雪乐山娱乐公司出版的那些，根本无法通过 BBS 传播。而且，它还得是有趣的快节奏游戏，类似街机那样能让人们的肾上腺分泌加速，这样才能吸引着玩家们来购买。如果罗梅洛把他的《埃及金字塔》交给斯科特发行的话，斯科特答应先给罗梅洛一笔预付款，以及 35％的版税，这比任何大出版商给的版税都要高，而且，罗梅洛不需要为市场推广或者是订单处理而操心。 《指挥官基恩》 “不要乱吹你不懂的东西” 角色们各就各位：汤姆是主设计师——负责制定游戏的各种元素：情节、角色、武器。卡马克和罗梅洛这两个多年来一直独立制作游戏的老手很乐意把设计工作分给汤姆来做，因为他们现在完全被编程工作占据了。卡马克不断地完善着游戏的引擎，直到屏幕不光是可以平滑地左右卷动，而且还可以平滑地上下卷动。与此同时，罗梅洛制作好了关卡编辑器，其他制作者们可以通过这个编辑器把各种图像放到一起：主角、房间、敌人等，它就是设计师的工具箱。 汤姆还设计了一个名叫“唷扑”（Yorp）的角色，那是个肥肥的绿色小怪物，头上长着个像潜望镜一样的眼睛。 所有科学技术，以及文化、知识、理论，都是在前人的基础上发展起来的。去注册一项专利，就等于宣布说：“这个想法是我的想法，你不能使用或扩展它，因为，我‘拥有’这个想法。”在卡马克这样的黒客眼里，这听起来简直荒谬绝伦。专利制度威胁到了他生命的最重要的事情：编写代码去解决问题。如果这个世界上充斥着各种专利，以至于他连解决一个简单的问题都要侵犯到某项专利的话，那么这将不是一个他所乐意生活在其中的世界。 斯科特也给游戏提出了他自己的建议，他在一封信中写道：“马里奥兄弟之所以那么流行，其中一个很重要的因素是那些隐藏在游戏各个角落里的秘密和奖励，我很希望《基恩》里也有这些东西，这对游戏将是个非常有益的补充。” 所有这些蛋蛋都起源于 1980 年雅达利 2600 家用机上的一个名叫《冒险》（Adventure）的角色扮演游戏，当无畏的玩家们进入一个隐秘的房间时，他们会发现里面只有一行闪烁着的字：“沃伦·罗宾尼特”（Warren Robinett），一些玩家明知道不会有什么事发生，但也只能朝它放几枪，而剩下的玩家只是看着它，不得其解地挠头。其实罗宾尼特是一个制作者的名字，他不愿看到出自他手里的游戏只被标记上公司名称，于是他通过这种方式来获得认同。 雷神（Quake）！ 卡马克和罗梅洛也一天比一天更加默契。他们就像是两个网球选手，在独孤求败了那么多年后，终于找到个可以一较高下的对手。罗梅洛促使着卡马克成为一个更好的程序员，而卡马克也促使着罗梅洛成为一个更棒的设计师，而他们的共同之处，就是他们年轻的激情，对工作的热爱。 1991 年 2 月 1 日，id Software 成立了。 第五章 比现实更有趣的世界 PC 机的性能还不足以运行那样的游戏。卡马克翻遍了各种书籍和期刊，但没发现什么有价值的东西。他又像当初做卷轴效果时一样：先尝试最直接的办法，如果不行，再拓宽思路。三维游戏之所以很慢的一个原因是要画的物体表面太多，但卡马克又想到，是不是可以让计算机每次少画些表面，就像给马儿戴上个眼罩，譬如，在绘制走道时，省略掉地板和天花板，只画出两侧的墙壁，用透视法的话，它们就是两个简单的梯形。此外，卡马克又独辟蹊径地使用了所谓的“射线追踪”算法（raycasting），在剔除掉玩家视角外的物体后，游戏的速度得到了极大的提高。这时，就只剩下最后一个挑战：在三维的世界里加入人物，解决的办法是简单地绘制出表现这些人物的图像和动画，《银河飞将》就已经可以根据玩家和目标之间的距离远近来动态缩放图像的大小。在综合了削减多边形、射线追踪、动态缩放这些技术后，卡马克已经可以做出一个流畅的三维世界了。 整个研究工作花费了卡马克六个星期，以前他顶多都只需要四个星期。当罗梅洛看到这成果时，他再次叹服于卡马克的天才。他们接下来讨论了应该制作个什么样的游戏，才能发挥出这个引擎的优势。他们最终决定制作一个未来核战后的世界，玩家在里面开着坦克营救幸存者。《气垫坦克》（Hovertank）于 1991 年 4 月发布——id 创造了主视角射击类游戏。 汤姆撰写了《再见，银河》（Goodbye Galaxy）这个三部曲的故事大纲。这次，基恩发现了一个试图摧毁银河系的阴谋，他必须立即乘坐他的飞船去拯救这个世界，在此之前，他还要照料好父母，他们被他不小心用眩弹枪击晕了。汤姆在游戏里加入了眩弹枪这个新玩意，因为在前一个三部曲发布后，忧心忡忡的家长们给 id 寄来了一些不满的信件，他们不喜欢游戏中角色死亡的方式，他们不喜欢死了以后还留在屏幕上的唷扑：“为什么这些角色不能直接消失呢？就像其他游戏里一样？”汤姆仍想坚持他的做法，但他也不愿去惹不必要的麻烦，他只好加入了这种新式武器，角色们不会死去，他们被击中的时候只会晕倒在原地，头顶上盘旋着一串金星。 第六章 阴郁的日子 材质贴图指的是把一幅精细的纹理应用到屏幕里的某个物体表面，这样就可以画出一面有质地的砖墙，而不是一个棕色的方块。罗梅洛从保罗·纽拉斯（Paul Neurath）那里听说了这个词，纽拉斯的公司“蓝天制作”（Blue Sky Productions）正在开发一个叫做《地下创世纪》（Ultima Underworld）的游戏，这个游戏将由创世纪系列原作者盖略特的维真公司发行。纽拉斯告诉罗梅洛，他们正在把材质贴图应用于三维世界中的多边形上。 《基恩》的第二个三部曲行将完工，id 把注意力集中到了下一个给天极的游戏上。这个时候，他们各自的角色也更为清晰明确：卡马克是技术方面的头，负责制作出新的引擎用于接下来的游戏；汤姆是主设计师，负责构思游戏的情节和方方面面的内容；罗梅洛则恰好介于他们之间，既可以帮助卡马克编写工具，又可以和汤姆一起创造各种点子；艾德里安负责把他们的要求付诸于图画，并不时在里面添几道血污。 《德军总部》！这个词立刻让卡马克和汤姆为之一振，就像罗梅洛一样，他们这些苹果机玩家就是玩着这个经典的动作游戏长大的，它是希拉斯·华纳这个传奇人物在 20 世纪 80 年代早期的一款杰作。他们立刻领会了罗梅洛的意思。《德军总部》这个主题非常适合卡马克的新技术，因为它本质上就是一个迷宫射击游戏，玩家们在其中和纳粹搏斗，寻找各种财宝，最后面对希特勒本人。尽管原作的画面很粗糙，但它能让玩家感觉到自己是在一个很大的世界里，这在那时是非常独特的。当时的计算机或街机游戏，譬如《乒乓》，都只在一个屏幕上进行，但在《德军总部》里，屏幕上显现的只是那个巨大的城堡里的一个房间，每一个房间都是由墙壁组成的一个迷宫。当玩家穿过某个迷宫后，他就可以进入下一个房间，屏幕上的画面随之改变，尽管没有平滑卷动，但玩家的确能感受到自己是在一个巨大的世界里探索，而且他不知道下一个房间里等待着他的将是什么：当然，通常是一个操着德语尖叫的纳粹士兵。 卡马克和罗梅洛把他们各自的角色发挥到了极致，一个在精益求精地改进引擎，另一个则不断地发掘引擎的能力，在工具中加入新的元素。卡马克那做工考究的吉他只有到了罗梅洛手里，才被谱出动人的音色。但他们之间的友谊和普通人之间的友谊不太一样，他们不讨论他们的生活，也不讨论他们的梦想。在一些夜晚，他们会坐在一起玩 F-Zero 赛车游戏，他们的友谊在很大程度上来说，是工作上的友谊，是他们对游戏的共同热爱，是他们为此不羁的追求。 流畅、简洁、快速的引擎 第七章 命运之矛 希拉斯是《德军总部》的创作者。 完成了所有的关卡后，id 决定周末每人花五千美元到迪斯尼乐园庆祝一番。他们坐了一遍又一遍过山车，还观看了各种表演，晚上，他们下榻在主题公园旁的佛罗里达大酒店。围坐在巨大的温泉浴缸里时，他们觉得生活是如此美好，他们决定回去以后给他们自己加薪到每年四万五千美元——这在那时是一笔不小的数字。 卡马克的技术。他带着在《造影者》引擎里取得的成果回到了 id 的办公室，大家立刻注意到，这是个相当大的飞跃。引擎里一眼就能看出来的新特性有：亮度衰减，带材质贴图的地板和天花板。 亮度衰减的意思是，就像在现实世界中，当你打着手电筒行走时，越远的物体就越陷入黑暗。在《德军总部 3D》里，所有的房间，所有的角落，都是亮堂堂的，没有色调的变换，而画家们都知道，光的效果是使图画栩栩如生的关键一环。有了亮度衰减后，卡马克的虚拟世界更加鲜活了。 卡马克还学会了如何把材质贴图应用于地板和天花板，此外，他还摸索出了如何实现不等高的墙体。 末日（Doom） 第八章 召唤群魔 杰伊向卡马克保证，离开天极只会给 id 带来好处：“我们将真正地独立起来，我们不再依靠任何人，我们要给自己创造机会，我们不能坐在这里等着幸运女神来敲门，我们要打开门，揪着她的领子把她拽进来！”而且，卡马克可以继续心无旁骛地钻研技术。拗不过杰伊，卡马克最终同意了：斯科特出局。 在 Doom 启航之前，斯科特不是惟一要离开 id 的人——还有咪子。卡马克的这只猫一直是 id 的心病，在湖畔小屋的时候，她就从来不安分地呆在窝里，现在脾气还更加古怪，整天在办公室里四处蹦跶，闲游乱逛，当她把卡马克新买的皮沙发尿得惨不忍睹后，卡马克向id 的人们宣布了这个消息： “咪子给我带来的只有麻烦，我要把她送到动物收养所去。” “什么？”罗梅洛难以置信。咪子一直是卡马克密友，他们甚至已经把咪子作为卡马克的另一半列进了公司员工目录——现在，她就这么走了？“你知道你在做什么吗？”罗梅洛向卡马克问道：“没有人会要她,那些人会弄死她的！你这么做她就玩完了！” 卡马克不以为然地耸了耸肩，回到房间继续工作。 这样的规则适用于一只猫，或是一个程序，甚至，一个人：当它成为问题的时候，由它去，或者，必要的话，把它剔除掉。 编程这门学问是基于有限的资源而展开的，人们只能在当前的硬件和软件基础上进行开发。1992 年秋天，卡马克还在使用着 VGA 显卡，也就是说，屏幕上最多只能同时显示 256 种颜色，而他要使 Doom 的世界能够由近及远平滑地过渡到黑暗中。 解决的办法是巧妙地组合这 256 种颜色，也就是利用所谓的“调色板”。比如，可以在里面放入 16 种红色，从亮红到暗红。然后，卡马克根据玩家在房间里所处的位置，把不同的颜色应用到不同距离的墙壁上。如果玩家走进一个大厅或是露天空地，程序会做一次简要计算，把最暗的颜色应用到最远的地方，当玩家继续往前走时，程序还会动态地调整附近的亮度。就这样，Doom 的世界不但变得更加逼真，还更加阴森。 地图编辑器、关卡编辑器 第九章 最酷的游戏 法拉利的引擎只是卡马克试图使之变得更快的引擎之一，此外还有 Doom。尽管 Doom 已经很快了，但以他的标准来看还是不够，这个游戏在速度上还面临着很大挑战，譬如那些带贴图的地面和天花板，以及那些高低不一的墙壁。在移植《德军总部 3D》到超任的过程中，卡马克读到了一篇讲述二叉空间分割（BSP）算法的文章，贝尔实验室（Bell Labs）的一个程序员通过这种算法来更快地在屏幕上绘制出三维模型。用最简单的术语来说，这个算法就是把一个模型分割成大量的片断，每个片断的数据作为全局树状结构中的一个叶结点，然后程序就可以快速地筛选出需要绘制的多边形，避免无谓地重绘整个模型，从而提高了绘制的速度。当卡马克读到这里时，他忽然想到，如果用这个算法来绘制一个巨大的虚拟世界，而不是一个小模型的话，会是什么样？ 没有人做过——甚至可能都没有人想到过——这种尝试，毕竟，没有多少人在试图建造虚拟世界。通过把 Doom 关卡的几何数据分割成一棵巨大的 BSP 树，计算机就不必在玩家每次改变视角或位置的时候重新绘制所有叶结点，而只需绘制玩家面对着的那些物体。当这个改动完成后，卡马克那已经很快的 Doom，就可以起飞了。 id 的人们开始翻看应聘简历，寻找汤姆的继任者，凯文留意到一个看上去很不错的家伙，也是一个玩家：桑迪·彼得森（Sandy Petersen）。比起 id 的人而言，37 岁的桑迪就像是个老古董，但他在游戏领域有着令人敬佩的经验。他在 20 世纪 80 年代早期创作了一个名为《邪神召唤》（Call of Cthulhu）的纸上角色扮演游戏，里面有各种食人僵尸和毛腿异形，这个游戏曾风靡一时，总共卖出了十万多份。计算机游戏兴起后，桑迪进入了一家位于巴尔的摩的游戏公司：MicroProse，这家公司的创始人就是后来制作了历史策略类游戏《文明》的传奇人物：席德·梅尔（Sid Meier）。 1993 年 12 月 10 号，星期五，历史性的时刻到了。连续测试三十小时后，id 已经准备好把 Doom 上传到因特网上。一个名叫大卫·达特（David Datta）的好心人给 id 提供了文件服务器，他是威斯康星大学的系统管理员，这台服务器在他们校园网里。这事听起来很不错，因为大学总是带宽最充裕的地方，从而可以容纳更多的用户来下载。id 就是这么想的：先上传，让玩家们来下载它，然后他们会再把它不断地传播出去，这比起其他花大价钱的分发方式好太多了，玩家们相当于是帮了 id 一个大忙。而杰伊已经于头一天在聊天室里向他们宣布了这个消息：Doom 将在 10 号午夜钟声响起时放出。 第十章 Doom时代第十一章 雷神们 卡马克清楚地知道，他喜欢的事情就是——编程，他系统地安排着生活，以便把大部分时间都用于此。从制作 Doom 时起，他就决定开始调整生物钟，以达到一种更孤寂更专注的境界，以避开罗梅洛的尖叫，避开记者的电话，避开所有这些日常生活中使他分心的事物。他开始强迫自己每天睡觉前多熬一个小时夜，然后第二天再晚一个小时到办公室。到 1995 年初，他养成了他觉得最理想的作息规律：下午四点到公司，凌晨四点离开。为了 Quake，他得全神贯注才行。 计算机图形学的泰斗级人物：迈克尔·亚伯拉什（Michael Abrash），正是他的书，指引着卡马克和罗梅洛完成了他们早期的游戏， 第十二章 审判日 Doom 类游戏充斥了货架，并高据销售榜前列。卢卡斯工作室推出了基于《星球大战》主题的一款射击游戏：《黑暗原力》（Dark Forces）；Interplay 则发行了一款主视角飞行射击游戏：《天旋地转》（Descent）；一家名叫牛蛙（Bungie）的小公司制作了在苹果机上运行的《马拉松》（Marathon）；甚至汤姆·霍尔，这个在 id 时一心想让游戏富有内涵的人，也在为斯科特·米勒的天极公司开发一款名叫《龙霸三合会》（Rise of the Triad）的射击游戏。 [idsoftware.com]登录名：johnc真实姓名：约翰·卡马克主目录：/raid/nardo/johnc命令行解释器：/bin/csh从未登录计划： 这是我的日常工作…… 当我完成一件事情的时候，我就给它标上星号；当我发现一个错误或是某个尚未实现的功能时，我也会把它记在这里，一些问题在被解决之前可能会被多次提到。我会不时地整理这个列表，并在我已经修正好的问题前标上一个加号。 ——约翰·卡马克 二月十八日：―――――――――――――――― 调页错误 拉伸控制台 加快水中移动速度 杀伤力的方向性 盔甲颜色闪烁 杀伤力足够大时的碎尸效果 调整榴弹 加亮玩家昵称 钉枪造成的延迟 一场游戏结束时服务器端异常终止 记分牌 可选的全尺寸 平视键 视频模式 15 时的异常 状态栏上的弹药图标 程序出错时允许“重启” 重生时的血迹残影？ 火箭弹数量有时会出现负值 玩家携带宝物时的发光效果 作战室里依然硝烟弥漫，卡马克觉得应该让玩家们知道，id 真的是在 Quake 的道路上稳步前进着，于是他决定通过计划文件的方式来把他的工作日志发布到因特网上，计划文件原本只该用于开发者之间的互相沟通，而不是面向大众，但 id 迷们已经被罗梅洛早先的天花乱坠吊了太长时间的胃口，卡马克觉得，现在该给玩家们展示些过硬的数据了。 经过若干个礼拜的通宵苦战后，卡马克和他的良师益友迈克尔·亚伯拉什终于解决了那个恼人的蓝色虚空问题，屏幕上呈现出一个完整无暇的真三维虚拟世界。大功告成，卡马克会静静地盯着墙角，或是随意地在里面走动，他感受着这个世界的一致，这个世界的真实。1996 年 2 月 24 日，Quake 已经初具雏形，为了在玩家们各种不同的机器配置上进行测试，id 上传了附带一个死亡竞赛关卡的演示版。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"Doom启示录-读书笔记-01","date":"2016-11-29T05:37:14.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129/","text":"Doom启示录的读书摘要Masters of DOOM: How Two Guys Created an Empire and Transformed Pop Culture 读后感：卡马克和罗梅洛把他们各自的角色发挥到了极致，一个在精益求精地改进引擎，另一个则不断地发掘引擎的能力。一个专注于技术，另一个专注于设计。两个人只有在一起才是完美的，只可惜他们没能走到最后，我想如果他们彼此互让一步，站在对方的角度替对方多想一下，或许还会创造更大的辉煌。个人觉得，罗梅洛成功后的表现更贴近于常人，在未成功时努力拼搏，成功后享受硕果，但他的的确确做的过分了些；卡马克缺乏的却是沟通，与伙伴的沟通，以及缺少站在伙伴们的角度考虑，太自我，只专注于自己喜欢的领域和想法，不会向伙伴们妥协。 推荐序一Doom无疑是游戏行业划时代的天才级作品，是FPS品类乃至3D游戏的鼻祖。 推荐序二 约翰。卡马克（John Carmack）是入列“互动科学艺术协会名人堂”的天才极客，凭借《德军总部》《DOOM》被誉为“FPS之父”，他在计算机图像引擎以及游戏研发方面的贡献使其无愧殊荣。 约翰。罗梅洛（John Remore），与卡马克共同创立了id software，作为《德军总部》《DOOM》事实上的总设计师，罗梅洛总能第一个发觉卡马克历代引擎的潜能，并通过超然的设计理念将其呈现给所有玩家。两位约翰在《DOOM》开发过程中的分工合作，堪称这个行业最理想的典范和样板：前者代表游戏创意理念，后者代表游戏技术能力；前者让创意得以实现，后者让技术能够发挥最大效能。正式得益于两位约翰的卓越才华和默契配合，《DOOM》成为超越时代的殿堂级神作。相比而言，他们二人在产品研发合作和公司创业上的默契程度，绝不比上个世纪八十年代创立苹果电脑的乔布斯和沃斯尼亚克这两位史蒂夫逊色。然而，《DOOM》史无前例的成功，放大了两位伙伴性格上的差异，而这种差异最终导致了罗梅洛的离开。 《QUAKE》发布之后，卡马克认为罗梅洛没有做好他的本职工作，于是，发动所有股东辞退了他。而所有股东只能同意，他们认为引擎技术才是id的根本，换句话说，卡马克才是唯一不可缺之人。 启示并没有结束。新的启示，仍然不断发生在我们身边。 推荐序三 这本书出版在2004年。 书中写卡马克说，‘在信息时代，客观障碍已不复存在，所谓障碍都是主观上的。如果你想动手开发什么全新的技术，你不需要几百万美元的资金，你只需要在冰箱里放慢比萨和可乐，再有一台便宜的计算机和为之献身的决心。’这种浓郁的极客言论，虽然有点极端，但是我认为没有这样一种心无旁骛追求梦想的执着，在游戏行业也许是难以生存下去的。 两个启示：一是这两位游戏信徒卡马克和罗梅洛–用信徒来形容他们实不为过–在充满荆棘的游戏开发道路上如何做到颠覆，做到极致；二是时势造英雄。 推荐序四 从《Doom启示录》主人公之一–卡马克身上，你会发现一个真正游戏人的风骨：专注，热情，坚持，自律，黑客精神，以及更多。 不仅有与世界过招、与时间赛跑的理想、也有与朋友诀别、与商业和解的现实。 2013年，卡马克离开了一手创办的id，以CTO的身份加入Oculus VR，在虚拟现实领域大展拳脚。 推荐序五 从《德军总部3D》到《毁灭战士》（DOOM）到《雷神之锤》（Quake），每款游戏都呈现出革命性的，前所未有的畅快淋漓。 长年浸淫于图形编程中的他几乎达到了禅宗般的境界。2013年，卡马克离开了id software，至此id的创始人均离开了公司，回头望去，不禁让我想起苹果的广告词：向那些疯狂的家伙致敬他们特立独行他们桀骜不驯他们惹是生非他们格格不入他们用与众不同的眼光看待事物他们不喜欢墨守成规他们也不愿安于现状你可以赞美他们、引用他们、反对他们质疑他们、颂扬或是诋毁他们但唯独不能漠视他们因为他们改变了事物他们推动人类向前发展或许他们是别人眼里的疯子但他们确实我们眼中的天才因为只有那些疯狂到以为自己能够改变世界的人才能真正地改变世界 推荐序六 罗梅洛最后说，id是一间被技术所奴役的公司，他一直相信设计决定一切，他最终离开了id，开启他的“离子风暴”游戏设计公司之旅，主张设计决定一切，而他的自大与浮夸最终也将他的新公司带向失败的结局。 从Quake结束到现在，五年过去了，尽管罗梅洛和卡马克也经常在各种场合见面，但这是罗梅洛第一次找卡马克谈一件生意上的事情，一个创意，一款游戏。当罗梅洛走进房间时，卡马克一如往常坐在显示器前优化着下一代图像引擎。他的房间比以前大了不少，也更干净整洁，但仍然是那么简朴无华。 序 两位约翰 《毁灭战士》（Doom）和《雷神之锤》（Quake），是以第一人称视角的方式来模拟现实世界里彩弹射击游戏的计算机程序。它们开创了一种被称为“主视角射击”的计算机游戏类型.** 29 岁的卡马克是一个计算机程序员，一个清心寡欲并且乐善好施的人，一个在业余时间里建造高能火箭的人，比尔·盖茨（Bill Gates）心目中为数不多的天才之一。程序代码的优雅清晰是他的追求，也是他的游戏。32 岁的罗梅洛是个自大的游戏设计师，他那坏孩子般的形象使他成为了游戏界的明星，为了实现他心目中那些狂野的幻景，他愿意付出一切代价，甚至是他的名望。卡马克在他们分手时有过一句简短的描述：“罗梅洛想建立一个帝国，而我只想写出优秀的程序。” 第一章 摇滚明星 11岁罗梅洛最喜欢的《行星撞击》（Asteroid）他的全名阿方索·约翰·罗梅洛（Alfonso John Romero）的首字母缩写 AJR 占据着那里《行星撞击》游戏高分榜的榜首 D&amp;D，或者是全称《龙与地下城》，于 1972 年由两个二十几岁的年轻人加里·盖克斯（Gary Gygax）和戴夫·阿纳森（Dave Arneson）创造，然后很快发展成一种地下文化现象，尤其是在大学校园里，人们的相互转告使它得以迅速传播。一个名为詹姆士·达拉斯·艾戈珀特（James Dallas Egbert）的学生还于某天消失在密歇根湖底的下水道里，据传是为了进行现实中的 D&amp;D 冒险。汤姆·汉克斯（Tom Hanks）主演的一部名为《迷宫和妖怪》（Mazes and Monsters）的电影就取材于这个事件。这类游戏还带动了世界各地的家庭手工业，每年相关的小说、游戏、T 恤、规则手册的销售额达到了 2500 万美元。 第一个计算机游戏于 1958 年在一个听起来不太可能的地方出现——美国政府的核实验室。威利·海金博塞姆（Willy Higinbotham）是这个位于纽约长岛的美国能源部布鲁克海文（Brookhaven）国家实验室的头，为了打消周围农场主们对这个建在他们家门口的核实验室的担心，他得筹划一次巡回演说，所以他就琢磨着弄个什么东西来博得他们的好感。于是，他和同事一起用计算机在圆形的示波器上制作了一个非常简陋的网球模拟程序，他给这个游戏命名为《双人网球》（Tennis for 2），其实只不过是一个白色的圆点在一条白线两边跳来跳去。农场的人们对这个新鲜玩意惊讶不已，但威利他们回到实验室以后就把机器拆除了。 三年后的 1961 年，史蒂夫·斯拉格·拉塞尔（Steve “Slug” Russell）和其他麻省理工学院（MIT）的学生在第一台小型机 PDP-1 上创作了一个名为《空间战争》（Spacewar）的游戏，游戏里两个玩家在黑洞中漂移，同时用火箭弹互相射击。十年后的 1971 年，波士顿一个程序员，同时也是一个洞穴探险爱好者，威尔·克劳瑟（Will Crowther），创作了一个模拟洞穴探险的文本游戏。一个在斯坦福大学的名叫唐·伍兹（Don Woods）的黑客看到了这个游戏后，向他询问是否可以在上面做一些改动，加入更多的神话元素，然后就有了《洞穴深处的冒险》。这个游戏引发了文本冒险游戏的热潮，全国各地计算机实验室里的学生们和黑客们不光是玩它，还修改它，制作出了各种各样新的故事，有的甚至跳出了《龙与地下城》的背景，譬如在《星际迷航》（Star Trek）的世界里展开探险。 罗梅洛是成长于 20 世纪 80 年代的第四代游戏黑客。第一代是五六十年代那些在小型机上做开发的麻省理工的学生们，七十年代硅谷和斯坦福的接力者们是第二代，八十年代早期的一些刚起步的小游戏公司算是第三代。 苹果 II 型机（Apple II）。它的前身苹果机于 1976 年首次在一个加州的计算机俱乐部被介绍给世人它尤其适合于用来玩游戏和制作游戏，这一切都得感谢苹果公司的两位创始人，史蒂夫·乔布斯（Steve Jobs）和史蒂芬·沃兹涅克（Stephen Wozniak），或者叫，两个史蒂夫。 第一代苹果机是在 1976年给“家酿”（HomeBrew）计算机俱乐部会员们用的一个原型，价格高达 666.66 美元。接下来 1977 年出产的苹果 II 型机则是针对普通用户的，它带一个键盘，兼容 BASIC 语言，最重要的，它的图像是彩色的，尽管它没有硬盘驱动器，但它随机附送了两个在现在看起来很简陋的游戏手柄——它就是用来玩游戏的。 罗梅洛十六岁了，他渴望着通过他的游戏取得成功。在经过屡试无果的八个月投稿后，1984 年 3 月 5 日，一个《苹果汁》（InCider，“内行”）杂志的编辑说他们决定要出版罗梅洛的一个名为《搜寻侦察兵》（Scout Search）的游戏。这是个低分辨率的迷宫游戏，玩家——游戏中的一个点，需要赶在灰熊——另一个点——的前面，把侦察兵们——若干个点——集合到一起。它看上去很普通，但很好玩。 罗梅洛迫不及待地想和他居住在犹他州的生父分享这些成功，他草草地做了张信纸，抬头是只有他自己一个人的所谓公司的名称：顶级思想软件（Capitol Idea Software），在信里，罗梅洛讲述了他发表的东西，他赢得的竞赛. 第二章 火箭科学家 约翰·卡马克是个很晚才开口说话的孩子，他父母亲的担心一直持续到 1971 的一天，这个 15 个月大的男孩拿着一块海绵蹒跚着走进客厅，说出不光是一个单词而是一个完整的句子：“爸爸，你的洗澡巾。”就好像他一直不屑于说单个的词，而非要等到能用它们组合出完整的句子才肯开口。 小约翰·卡马克出生于 1970 年 8 月 20 日，小名约迪。 《黑客：计算机革命的英雄们》（Hackers: Heroes of the Computer Revolution）是卡马克的启示录。 BBS 大约诞生于 1978 年。沃德·克里斯滕森（Ward Christensen）和兰迪·瑟斯（Randy Seuss）这两名黑客编写了第一个能在两台计算机之间通过电话线传输数据的软件，从而一台计算机可以“呼叫”另外一台并进行信息交换。在 20 世纪 80 年代，BBS 迅速传播开来，并形成了有史以来真正意义上的虚拟社区，在这里，人们可以对换或是交易软件，并通过在论坛里发布信息进行“交谈”。 《造影》（Shadowforge）是他的第一个游戏，在很多方面都和《创世纪》很相像，但有几个很独特的创新，譬如角色可以朝任意方向攻击。主营电池的“夜鹰”（Nite Owl Productions）公司花一千美元购买了它，这是卡马克平生第一笔收入，他用这笔钱把他的苹果机升级到了苹果II GS。 卡马克的第二个游戏——《鬼魂》（Wraith）。 第三章 侵犯版权的戴夫 和罗梅洛一样，雷恩也只想做游戏，他自己的公司名叫蓝山科技（Blue Mountain Micro），和罗梅洛的“顶级思想”一样，雷恩是蓝山科技的光杆司令。在新罕布什尔的时候，他们合并为“深思软件”（Ideas from the Deep）。 罗梅洛告诉艾尔，他过去一年里都在关注各种 PC 游戏的事物，他觉得这里面有很大的发展空间，因为那个时候 PC 机还不如苹果机强劲，所以它上面的游戏毫无亮点——全都是些简陋的静态画面，跟苹果机上面那些丰富多彩的游戏根本没法比。现在正是出手的好时机。艾尔赞同罗梅洛的想法，他建议发行一份游戏特刊，每月一期。 雷恩将会成为这个名为《玩家之刃》（Gamer’s Edge）的 PC 游戏双月刊编辑 罗梅洛、雷恩和卡马克这三个程序员几乎是一见面就开始了关于游戏编程的热烈讨论，从苹果机上 16 位图像模式下的双倍分辨率，到 8086 汇编语言的技巧，他们一刻不停地谈论着，不光是计算机方面的东西，还有其他方面的共同爱好：《龙与地下城》、《行星撞击》、《魔戒》。卡马克讲到他小时候是多么渴望拥有一台计算机，罗梅洛听了后说：“伙计，我那时候要是能给你买一台就好了。” 卡马克完全没有预料到能遇上和他一样聪明的人，尤其是在编程方面。这两个家伙不光是能侃，他们的确知道比卡马克更多的东西。“他们不只是和我差不多，他们比我还要优秀。”卡马克想道。罗梅洛是个让人振奋的家伙，不光是他编程的水平，还有他其他方面的能力——他的艺术天分、他的设计创意。 《危险的戴夫》是罗梅洛在 1989 年给《新时代》做的，这是款简单的冒险类游戏，玩家在游戏里是一个穿着紫色紧身衣戴着绿帽的小人——屏幕上的几个像素，他需要连跑带跳地穿过各种迷宫，搜集珍宝，当然前提是保住性命。这和罗梅洛很欣赏的一个叫《大金刚》（Donkey Kong）的任天堂街机游戏很类似。 《墓窖》是卡马克继《造影》和《鬼魂》之后最新的一款角色扮演游戏，卡马克显然是受了街机游戏《金手套》（Gauntlet）的影响。在那个流行的游戏里，玩家要在迷宫里射击、施魔法，杀出一条血路，它就像是《龙与地下城》的动作版。这也是罗梅洛和卡马克的一个共同点：他们都喜欢动作类的街机游戏，他们渴望着自己也能做出那样的游戏，而且，他们对自己的能力充满自信。 但对罗梅洛，这自由生活的背后其实隐藏着难言的苦衷——他离婚了。未来富翁这个目标对二十二岁的罗梅洛来说已经是一个不小的挑战，更别提同时还要做一个合格的丈夫和父亲。但凯俐对罗梅洛所热爱的游戏毫无兴趣，她的情绪变得愈发消沉，她想要家庭晚餐、到教堂做礼拜、周末野餐，而罗梅洛又对这些事情打不起精神。他也曾尝试着使事业和爱情能双丰收，他甚至在其他同事还在干活的时候就提前离开办公室。但家庭生活是个无底洞，罗梅洛不知道他有没有那么多的时间和精力，尽管他也想拥有一个他儿时没有的美满家庭，但他有时又觉得自己天生不是那样的好老公和好爸爸。最后他和凯俐都认为只有分手是对大家都好的办法，但凯俐不止要分手，她还要回到加州的家里，罗梅洛听到她这个决定后几近崩溃，他同时还得知孩子们也不会和他生活在一起。但他安慰自己说距离远一点没什么关系，只要有心，就算隔着几个州，孩子们和他之间的距离肯定能比他儿时和父亲之间的距离要近。 卡马克和罗梅洛在移植游戏的过程中完成了磨合，他们找到了最能互相取长补短的合作方式。卡马克最感兴趣的是编写游戏的核心部分——引擎，这个模块负责指示计算机如何在屏幕上显示图像。罗梅洛乐于做各种辅助工具，由此他们才能制作出游戏的角色、环境、地图，此外，罗梅洛还喜欢做游戏设计，譬如游戏是如何操作、打斗是什么样子、怎么个玩法最有意思。他们两人就像阴和阳那样和谐互补：卡马克编程很有天分，而罗梅洛则擅长设计以及美工和音效。 小艾德里安的心灵还遭受着一些其他事情的冲击。他的父亲，本地一家餐饮公司的腊肠销售员，在艾德里安十三岁的时候因心脏病突发去世，这使得本就沉默敏感的艾德里安愈发的乖僻，尽管他那做信贷员的母亲和两个妹妹尝试过帮助他，但他还是逃避到绘画的世界里，他还养了一个蝎子作为宠物。对于这样的一个孩子，萦绕在他心头的自然都是一些黑暗的主题。 在艾德里安上大学的时候，他经历了更为真实的体验。为了挣钱念书，他在本地一家医院做起了助手，他的工作就是冲洗那些在急救室里拍下的病人照片，那全是疾病和惨祸——他看到严重的褥疮导致的皮肤脱落，他看到枪伤，他看到残肢断臂。有一次他甚至看到一根栅栏柱穿过一个农夫的腹股沟，照片质量很好，非常清晰，他拿了几张卖给朋友。 他的绘画变得更加阴暗，但也更具水准。他在大学的美术导师列莫恩斯·巴坦（Lemoins Batan）很赏识他的才能，尤其是他的准确和看似毫不费劲的精细。当列莫恩斯问他想做什么的时候，艾德里安说他以后就想从事美术行业，他正在积累这方面的经验，列莫恩斯告诉他，听说《软盘》正在招人。 罗梅洛和卡马克向艾尔建议下一期《玩家之刃》最好只做一个游戏，一个全新的大型商业游戏，艾尔同意了，放手让他们去追逐他们的梦想。尽管两个月的时间对于一个这样的游戏来说仍然很紧，但现在他们人员都已各就各位——卡马克负责引擎，罗梅洛负责游戏设计以及制作辅助工具，艾德里安做美工，雷恩负责协调管理的同时也做一些零碎的编程，看起来他们可以做到。 下一个游戏的点子是卡马克提出来的。他正在尝试一项编程上的突破：让游戏的世界不再局限于屏幕的边界——所谓的“卷轴效果”。街机是这项技术的样板，早期街机游戏的移动也是局限在一个静态的屏幕内，譬如《乒乓》，用于把球击来击去的球拍只能在屏幕的底部和顶部之间移动，再譬如《吃豆子》里的迷宫，也是局限于屏幕那么大，还有《太空入侵者》，玩家控制的飞船只能在屏幕下方左右移动，外星飞船们则是从屏幕顶部涌现。所有这些游戏都把玩家局限在那一小方天地里，缺乏一种宽广的可延伸的感觉，这种状况一直持续到1980 年，在那一年，威廉斯公司推出了一款名叫《防御者》（Defender）的街机游戏，这是第一个流行的卷轴游戏，在这个科幻射击游戏里，玩家不再受屏幕大小的限制，他操纵飞船在行星的表面水平移动，一路上击落敌机营救人质，屏幕上的一幅小地图显示着玩家在整个世界里的当前位置。如果把地图扩展为正常尺寸，这个世界大概有三个半屏幕那么大。与其他街机比起来，《防御者》显得宏大得多，玩家就像进入了一个更为广阔的虚拟空间。它很快变得和《太空入侵者》一样流行，还胜过《吃豆子》成为了业界的年度游戏。无数的卷轴游戏随之出现，到 1989 年的时候，卷轴技术已经是新游戏的一项必不可少的标准，这其中最成功的莫过于任天堂红白机上的《超级马里奥兄弟 3》（Super Mario Brothers 3）。 但在那时，1990 年 9 月，还没有人研究出如何在 PC 上实现卷轴效果，大家都用一些蹩脚的技巧来让玩家觉得游戏的世界比屏幕要大，譬如当玩家移动到屏幕最右边的时候，游戏会停顿一会，然后右边的场景出现在屏幕上。部分原因是 PC 的性能还很差，无论是街机还是苹果机，或是任天堂那样的家用机都比 PC 强不少。而卡马克下定决心要找出一种办法来在 PC 上实现像《防御者》或《超级马里奥》那样的平滑卷轴效果。 《玩家之刃》的下一个游戏就要朝着这个方向走。当大伙聚在一起讨论的时候，卡马克给他们演示了他最新的成果，他已经可以让屏幕上的内容平滑地往下方移动，和那些成熟的卷轴游戏比起来，这项技术还很粗糙，它就像是一条传送带，图像按照固定的速度和路线落下，玩家还不可能随心所欲地在里面畅游，那就像是拖动演员背后的舞台布景。 他们给游戏命名为《搜捕》（Slordax），一个简单的飞船射击游戏，就像《太空入侵者》或《小蜜蜂》（Galaga）一样。 他们有四个星期的时间。从一开始他们就配合得非常默契：卡马克紧张地修改图像引擎的代码，罗梅洛编写制作角色和关卡的工具，当卡马克差不多的时候，罗梅洛也开始了游戏性的设计。汤姆经常摸进他们的办公室来做一些角色和背景。艾德里安也在屏幕上画出了飞船和行星的草图，罗梅洛看到后立刻就觉得这个沉默的临时工是个才华横溢的家伙。 《搜捕》已经很圆满地结束了，卡马克正开始研究新的东西，他是个天生的夜猫子；他喜欢在办公室里呆到凌晨，他喜欢那种宁静，那种孤寂；他喜欢那种可以让他更加融入到工作中的感觉，他很开心，他做着他一直以来想做的事情：编写游戏。在这种时候，他根本不会去想以后会怎么样，如果他能就这么编写游戏并且有足够的钱买比萨和书，他就很满足了。他很早就说过，只要给他一台计算机，一些比萨和可乐，哪怕把他锁到柜子里，他也可以过得很好。 当汤姆在卡马克身边坐下时，卡马克给他看了他正在做的东西，一种可以把动画应用于游戏背景的技术。计算机屏幕是由许多像素组成的，一组像素则可以构成一个图素（tile），美工们首先用像素来画出图素，然后再用创作好的图素来搭建整个世界，这就像是给厨房铺瓷砖（tile）。而卡马克刚找到了一种可以让这块瓷砖上的图像动起来的办法，“而且，”他对汤姆说，“我还可以在你们接触到某块图素的时候激活一些事件”。 “这个东西做起来简单么？”汤姆问道。 “当然，嗯”卡马克回答说，他只需要加一些代码来处理这个事件就行了。汤姆清楚地知道这会是多么惊人，因为《超级马里奥》之类的游戏靠的就是动画背景，而且，当玩家跳起来顶到某块闪烁着的砖头时，会触发一些事件，譬如落下若干金币。想到这里，汤姆来了精神。而卡马克要给他看的还不止这些。 卡马克在键盘上敲了几下，向汤姆展示了他的另一项成就：平滑的卷轴效果。这种由《防御者》和《超级马里奥》带来的技术，能够在玩家走到屏幕边缘的时候通过背景卷动让玩家体验到一个连续的世界。经过几个夜晚的尝试，卡马克终于在 PC 上也实现了这种效果。和往常一样，他用了一种独特的手段。很多人会一上来就试图走捷径，卡马克觉得这不是解决问题的方法。他一开始先试了最直接的途径，在整个屏幕上重新绘制图像，但行不通，因为那时的 PC 实在太慢了。然后他尝试着优化——可以通过多使用一些内存来换取性能的提高吗？他试了几次，发现这也是死路一条。 最终卡马克冷静了下来，从头开始考虑，“我要的是什么？——我要在玩家穿过游戏的时候图像能够平滑地移动。”他回想起他以前做的《墓窖》，在那个游戏里，当玩家走到屏幕上地牢边缘时，他会让背景做一次很大的调整，这种基于图素的卷动在当时是很常见的技术，而他现在要的是基于像素的卷动，哪怕玩家只移动了一点点，背景也要随之调整。问题是如此频繁地重绘远远超出了当时 PC 机的能力，但卡马克很快找到了突破口。 如果，卡马克想道，不是每次重绘整个屏幕，而是只重绘那些真正改变了的部分，会怎么样呢？那样的话，卷轴效果执行起来会快很多。他盯着屏幕，假想着一个由蓝天白云组成的背景，玩家跑向屏幕右边，如果它跑得足够远，那些云朵将会被它逐渐抛在身后，直到从屏幕上消失，尽管改变的只是一片白云，大部分蓝色的区域没有变化，但计算机不知道这些细节，它不知道其实有更快捷的办法，它只会笨拙地重绘每一个组成蓝天的像素，从屏幕的左上方开始，一个像素一个像素地往右，再一行行往下，直到完成整个屏幕。接下来卡马克就干了一件漂亮的事情，使得效率得到极大的提高。他写了一段代码，用来哄骗计算机，让它觉得譬如左数第七块图素其实是屏幕上的第一块，这样的话，卡马克就可以让计算机在他指定的地方开始绘制图像，计算机就可以直接绘制白云，而不需要再一个像素一个像素地填充蓝色的天空。为了确保玩家移动时感觉到平滑的效果，卡马克还想出了一个小技巧：让计算机在屏幕右边以外的地方画一块额外的天空，这其实是画在计算机的显存里，但当它们真正进入屏幕的时候，它就不再需要重新绘制，而是直接从显存里反映到屏幕上。卡马克把这个过程叫做“图素自动刷新”。 汤姆立刻感觉到了这技术的潜能：这意味着他们可以在 PC 上做出《超级马里奥》！还没有任何地方的任何人做过这样的事情，而他们现在就可以做出来，就在这里，就在现在，在 PC 上实现他们最喜欢的游戏。这简直是颠覆性的革新。 罗梅洛按下方向键，戴夫开始沿着地面走动，就在背景开始平滑卷动的一刹，他整个人呆住了。罗梅洛几乎喘不过气来，他简直无法相信屏幕上发生的事情，他就坐在那里用手指摁住键盘，控制着戴夫在场景里来回走动——这难道是真的？难道卡马克这小子原模原样地做出了任天堂的东西？难道我们实现了世界上每一个玩家都曾有过的想法？我们在 PC 上有了这样的突破？天哪，它将带给我们马里奥带给任天堂的那些东西——凭借着《超级马里奥》，任天堂就即将要取代本田（Toyota）成为日本最成功的公司，它每年的销售额达到了十亿美元。宫本茂（Shigeru Miyamoto），这个马里奥系列的创作者，本是个不名一文的乡下孩子，现在已经变成了游戏界的沃尔特·迪斯尼（Walt Disney），《超级马里奥兄弟 3》卖出了一千七百万份拷贝，相当于十七白金的记录——这是迈克尔·杰克逊（Michael Jackson）那种流行巨星才能做到的事。罗梅洛被这突如其来的惊喜击溃了，他动弹不得，甚至都站不起来。直到卡马克几个小时后回到办公室，他才有力气说话。他只有一件事要告诉他这个朋友，这个编程天才，这个绝配般的搭档：“不用想了，我们走人！”","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"vim cheat sheet for programmers print","date":"2016-11-25T06:15:58.000Z","path":"2016/11/25/VimCheatSheetForProgrammersPrint-20161125/","text":"vim cheat sheet for programmers print","tags":[{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"}]},{"title":"Markdown语法快速入门","date":"2016-11-24T06:38:05.000Z","path":"2016/11/24/Markdown语法快速入门-20161124/","text":"Markdown语法说明快读入门-笔记截图 参考链接 Markdown-Syntax-CN–githttps://github.com/riku/Markdown-Syntax-CN Markdown语法说明（简体中文版）http://www.appinn.com/markdown/ Markdown语法说明快速入门http://www.appinn.com/markdown/basic.html Dingus在线转换工具–Markdown 格式转成 XHTML格式链接","tags":[{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"}]},{"title":"我家的新成员-二炮大人","date":"2016-11-23T05:40:22.000Z","path":"2016/11/23/我家的新成员-二炮大人-20161123/","text":"二炮是媳妇2016年11月05日考完试后在路边捡回来的流浪狗。据媳妇说，二炮也就两个月的样子，至于怎么看出来的，我就不知道了，一直持怀疑态度，哈哈~umm…二炮这高大上的名字是我思忖两天想出来的。毕竟是要跟随一生的名字，怎可儿戏… 昨晚正式任命二炮为我家三当家的。上几张二炮最近的靓照：瞧瞧二炮这忧郁的小眼神…哎呦卧槽~刚发现这货的嘴被我那腹黑的媳妇用皮筋给绑瓷实了…这下可不能到处乱啃了… 刚来到家的时候很喜欢这个呼啦圈，这是她第一个最喜欢的东东 后来给她买了个网球玩儿，这是她最近最爱的玩具 超喜欢酸奶，至今我也没搞明白她是喜欢舔酸奶盒底，还是喜欢顶酸奶盒子玩儿，狗的世界岂是卡卡大魔王能懂的？就不能让她来屋里玩啊，每次进来玩儿就弄的地面一片乱乱脏脏的…","tags":[{"name":"生活","slug":"生活","permalink":"http://sniperkaka.com/tags/生活/"}]},{"title":"两个人的周末","date":"2016-11-19T15:12:05.000Z","path":"2016/11/19/两个人的周末-20161119/","text":"此二货也够无聊，吃块蛋糕也要摆拍，哈哈哈…PS:其实床边还有二炮，没有把她拍进来…","tags":[{"name":"生活","slug":"生活","permalink":"http://sniperkaka.com/tags/生活/"}]},{"title":"个人博客搭建 hexo + github","date":"2016-11-18T09:52:32.000Z","path":"2016/11/18/hehe-20161118/","text":"umm…暂时没更新上来… changing book list Note 1: 财经周刊 第一财经周刊 哈佛商业周刊 百家讲坛杂志 五子棋入门 （进行中） 帝王之死 初恋即是绝恋 三体 如何阅读一本书 Doom启示录 （完成） Note 2: C和指针 C++ Primer Unity 5.x游戏开发指南 （进行中） Learn OpenGL 算法的乐趣 深入理解计算机系统 疯狂Android讲义 自己动手写编译器、链接器 编码：隐匿在计算机软硬件背后的语言 linux命令行大全 代码大全 Git权威指南 Note 3: Core 4.2 HFP A2DP AVRCP PBAP AVCTP AVDTP OBEX SPP Misra （进行中）","tags":[{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"},{"name":"环境搭建","slug":"环境搭建","permalink":"http://sniperkaka.com/tags/环境搭建/"}]},{"title":"博客搭建成功后的第一篇日志","date":"2016-11-18T01:11:46.000Z","path":"2016/11/18/个人博客的第一篇-20161118/","text":"博客搭建成功后的第一篇日志个人博客终于搭建成功了，并绑定了自己申请的域名(www.sniperkaka.com)超开心，打算以后的读书笔记及生活点滴记录在这里。希望来此的朋友有所收获~ 加油！！！","tags":[{"name":"杂七杂八","slug":"杂七杂八","permalink":"http://sniperkaka.com/tags/杂七杂八/"}]}]