[{"title":"十五从军征-读懂了就长大了","date":"2017-07-10T03:01:21.000Z","path":"2017/07/10/20170710-十五从军征-读懂了就长大了/","text":"祭典韦，祭郭奉孝，祭荀令君，祭夏侯渊，祭庞令明，祭天下无辜死者，祭过往无数英雄，祭千秋黎民百姓。为生者祭，为死者祭，为过去未来祭。 黯淡了刀光剑影，远去了鼓角铮鸣。眼前飞扬着一个个，鲜活的面容。淹没了黄尘古道，荒芜了烽火边城。岁月啊，你带不走，那一串串熟悉的姓名。兴亡谁人定啊，盛衰岂无凭啊，一页风云散啊，变幻了时空。聚散皆是缘哪，离合总关情啊，担当生前事啊，何计身后评。长江有意化作泪，长江有情起歌声。历史的天空闪烁几颗星。人间一股英雄气，在驰骋纵横。 —毛阿敏&lt;历史的天空&gt; 十五从军行， 八十始得归。道逢乡里人， 家中有阿谁？遥望是君家， 松柏冢累累。兔从狗窦入， 雉从梁上飞。中庭生旅谷， 井上生旅葵。烹谷持作饭， 采葵持作羹。羹饭一时熟， 不知贻阿谁。出门东向望， 泪落沾我衣。 –来自汉乐府《十五从军征》 大军师司马懿之军师联盟 第22集曹操和司马懿在洛阳城外听见一个小女孩唱民歌,当时听到小女孩唱这歌，初觉悦耳动听，继而触动很大，女孩稚嫩的嗓音与歌词内容形成一种强烈的反差。我们每个人都会经历的，说来不过是生老病死、怨憎会、爱别离、求不得、五阴盛。小的时候哪里懂得这些，就好像剧里边，那个坐在牛背上唱《十五从军行》的小姑娘，歌声清澈，笑容纯真，她不懂自己在唱什么，可是枭雄一世的曹操懂，懂得什么叫做“十五从军行，八十始得归”，才会泪落沾我衣！ 是什么时候开始觉得有点懂这样的诗，这样的词了？大概是经历了些愁苦、离别、相思和痛哭吧。 行行重行行，与君生别离。相去万余里，各在天一涯；道路阻且长，会面安可知。胡马倚北风，越鸟巢南枝。相去日已远，衣带日已缓；浮云蔽白日，游子不顾返。思君令人老，岁月忽已晚。弃捐勿复道，努力加餐饭。 —《行行重行行》 前面写的都很有意境，最后一句“努力加餐饭。”突然有点出戏。现在看来，这句反而成了最扎心的一句了，我们离家在外，父母牵挂着远在天涯的儿女，心里有那么多话要叮嘱，但到嘴边的，还是一句“多吃饭，照顾好自己”。无论爱情还是亲情，千百年来差不多。 其实不管你在哪里，在这一趟无法回头的人生里啊，我们都只是远行客罢了，渐行渐远…. 心里堵堵的… 【END】","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-白鹿原","date":"2017-07-04T05:00:45.000Z","path":"2017/07/04/20170704-读书笔记-白鹿原/","text":"书名：白鹿原作者：陈忠实 白秉德，白嘉轩的父亲鹿泰恒, 鹿子霖的父亲马驹叫白孝文，骡驹叫白孝武(白嘉轩的大儿子和二儿子)鹿兆鹏和鹿兆海,鹿子霖的大儿子和二儿子 摘要01第二房娶的是南原庞家村殷实人家庞修瑞的奶干女儿。这女子又正好比他小两岁，模样俊秀眼睛忽灵儿。她完全不知道嫁人是怎么回事，而他此时已经谙熟男女之间所有的隐秘。他看着她的羞怯慌乱而想到自己第一次的傻样反倒觉得更富刺激。当他哄唆着把躲躲闪闪而又不敢违拗他的小媳妇裹入身下的时候，他听到了她的不是欢乐而是痛苦的一声哭叫。当他疲惫地歇息下来，才发觉肩膀内侧疼痛钻心，她把他咬烂了。他抚伤惜痛的时候，心里就潮起了对这个娇惯得有点任性的奶干女儿的恼火。正欲发作，她却扳过他的肩膀暗示他再来一次。一当经过男女间的第一次交欢，她就变得没有节制的任性。 02第三个女人是北原上樊家寨的一户同样殷实人家的头生女儿，十六岁的身体发育得像二十岁的女人一样丰满成熟，丰腴的肩膀和浑圆的臀部，又有一对大奶子。她要么是早熟，要么是婚前有过男女间的知识，一钻进被窝就把他紧紧搂住，双臂上显示着急迫与贪婪，把丰满鼓胀的奶子毫不羞怯地贴紧他的胸脯。当他进入她的身体时，她嗷嗷直叫，却不是痛苦而是沉迷。 03这时候，远远近近的村子热烈地流传着远不止命硬的关于嘉轩的生理秘闻，说他长着一个狗的家伙，长到可以缠腰一匝，而且尖头上长着一个带毒的倒钩，女人们的肝肺肠肚全被捣碎而且注进毒汁。 04他不多说话倒不怠慢焦急如焚的患者。他永远镇定自若成竹在胸，看好病是这副模样看不好也是这副模样看死了人仍是这副模样，他给任何患者以及比患者更焦虑急迫的家属的印象永远都是这个样子。看好了病那是因为他的医术超群此病不在话下因而不值得夸张称颂，看不好病或看死了人那本是你不幸得下了绝症而不是冷先生医术平庸，那副模样使患者和家属坚信即使再换一百个医生即使药王转世也是莫可奈何。 05一位伯伯朗然说：“人说‘瞻前顾后’，前后总是不能兼顾，就只能是先瞻前而后顾后；生死不能同时顾全，那就先顾生而后顾死。” 06秦腔剧《五典坡》里的王宝钏排行为三，称三姑娘，乡间就把排行为三的女子视做命苦的人。 07嘉轩惊异地发现，母亲办事的干练和果决实际上已经超过父亲，更少一些瞻前顾后的忧虑，表现出认定一条路只顾往前走而不左顾右盼的专注和果断。 08他甚至开始真的怀疑自己那个东西里头流出的货是否有毒，偷偷把那货抖落到猪食里观察猪吃了以后的动静，共计三次，猪的活动毫无异常。 09胡氏解除了心头禁讳也就扯去了裤带，俩人一样热烈一样贪婪一样不觉满足也不感困乏，直到把两页炕面的土坯弄塌，俩人又嘻嘻笑着挪一个地窝儿。胡氏放开腰禁后的狂热持续了整整三个通宵，俩人都累坏了。第四天夜里再也折腾不起，相依相偎着进入睡梦。 10他愈加小心地挖刨着泥土，又露出来同样颜色的叶片。再往深层挖，露出来一根嫩乎乎的同样粉白的秆儿，直到完全刨出来，那秆儿上缀着五片大小不一的叶片。他想连根拔起来却又转念一想，说不定这是什么宝物珍草，拔起来死了怎么办？失了药性就成废物了。他又小心翼翼地把湿土回填进去，把周围的积雪踢刮过来伪装现场，又蹲下来挣着屁股挤出一泡屎来，任何人都不会怀疑这儿的凌乱了。 11圣人能看透凡人的隐情隐秘，凡人却看不透圣人的作为；凡人和圣人之间有一层永远无法沟通的天然界隔。圣人不屑于理会凡人争多嫌少的七事八事，凡人也难以遵从圣人的至理名言来过自己的日子。 12很古很古的时候（传说似乎都不注重年代的准确性），这原上出现过一只白色的鹿，白毛白腿白蹄，那鹿角更是莹亮剔透的白。白鹿跳跳蹦蹦像跑着又像飘着从东原向西原跑去，倏忽之间就消失了。庄稼汉们猛然发现白鹿飘过以后麦苗忽地蹿高了，黄不拉几的弱苗子变成黑油油的绿苗子，整个原上和河川里全是一色绿的麦苗。白鹿跑过以后，有人在田坎间发现了僵死的狼，奄奄一息的狐狸，阴沟湿地里死成一堆的癞蛤蟆，一切毒虫害兽全都悄然毙命了。更使人惊奇不已的是，有人突然发现瘫痪在炕的老娘正潇洒地捉着擀杖在案上擀面片，半世瞎眼的老汉睁着光亮亮的眼睛端着筛子拣取麦子里混杂的沙粒，秃子老二的瘌痢头上长出了黑乌乌的头发，歪嘴斜眼的丑女儿变得鲜若桃花……这就是白鹿原。 13一只雪白的神鹿，柔若无骨，欢欢蹦蹦，舞之蹈之，从南山飘逸而出，在开阔的原野上恣意嬉戏。所过之处，万木繁荣，禾苗茁壮，五谷丰登，六畜兴旺，疫疠廓清，毒虫灭绝，万家乐康，那是怎样美妙的太平盛世！ 14鹿子霖早已领得父教，严谨地把握着自己的情绪，把买地者的得意与激动彻底隐藏，表现出对于白家兄弟不幸遭遇的同情与体悯. 15那温馨的气息像玫瑰花香一样沁人心脾，心里的灰冷渐渐被逐出，又潮起一种难以抑制的焦渴。他鼓起勇气伸手把她揽进怀里，抚摸她的脖颈、丰腴的肩膀和最富诱惑的胸脯。她默默地接受了，没有惊慌也不反抗。她在他的怀里微微颤抖着身子，出气声变得急促起来。他受到鼓舞，就把手往腹部伸去，却触到了一只倒霉的小棒槌，心里又泛起一缕阴冷之气。 16仙草重新爬上炕，打断他的话：“算了！”说着，一把一个扯掉了腰带上的六个小棒槌，“哗”地一下脱去紧身背心，两只奶子像两只白鸽一样扑出窝来，又抹掉短裤，赤裸裸躺在炕上说：“哪怕我明早起来就死了也心甘！” 17两架纺车嗡嗡吱吱的声音互相衔接，互相重合，此声间歇，彼声响起，把沉稳和谐的气氛弥漫到四合院的每一个角落。白嘉轩沉浸在这古老悠远而又新鲜活泼的乐曲里，浑身的筋骨和血液就鼓涨起来。 18仙草心安理得地享受了婆婆白赵氏无微不至的服侍。坐满了月子，跳下炕来的时候，她容光焕发，挺着两只饱满肥实的乳房，完全是一个动人的少妇了。 19他没有费多少心思就给孩子取下马驹的乳名，正如他的父亲给他取过拴狗的乳名一样的用意，越是贵重越是值钱的娃子越取那种丑陋的名字才更吉利；一当孩子度过多灾多祸的幼儿期进入私塾读书阶段，那时才应该费点心思取一个雅而不俗的官名，供其在一切公众场合使用。 20孩子刚刚过岁就断奶了，马驹双手抱着仙草的乳房却吸不出乳汁，昼夜啼哭。仙草尚无做母亲的经验，急得心神不安问婆婆怎么回事。白赵氏不仅不慌不急反而有些幸灾乐祸地说：“奶汁儿怕是给另一个暗里夺了吃光了。”仙草突然红了脸，又想起夜里丈夫和她做爱时吮咂乳房的情景。后来才悟出阿婆并没有取笑的意思，暗里夺了吃光了奶汁儿的是指自己肚里又有一个了。 21隔了一年多点儿，仙草又坐月子了，这是她第八次坐月子。她现在对生孩子坐月子既没有恐惧也没有痛苦，甚至完全能够准确把握临产的时日。她的冷静和处之泰然的态度实际是出于一种司空见惯，跟拉屎尿尿一样用不着惊慌失措，到屎坠尿憋的时候抹下裤子排泄了就毕了，不过比拉屎尿尿稍微麻烦一点罢了。 22她相信儿子在族里和在家里的许多方面都超过了父亲；她恪守幼时从父母，出嫁从丈夫，老来从儿子的古训，十分明智地由儿子处理家务和族里的事而不予干涉。 23鹿三一般不参与白家家庭内部的事务，不像有些浅薄势利之徒，主家待他好了自个就掂不来轻重也沉不住气了，骚情得恨不能长出个尾巴来摇。他只恪守一条，干好自己该干的事而决不干他不该干的事。 24朱先生在他的书房里接待白嘉轩，他一如往常，看不出任何异样的神态。白嘉轩脑子里顿时蹦出“处世不惊”四个字来。 25渭城朝雨浥轻尘，客舍青青柳色新。劝君更进一杯酒，西出阳关无故人。 26车辚辚，马萧萧，行人弓箭各在腰。耶娘妻子走相送，尘埃不见咸阳桥…… 27一树既老且朽，根枯了，干空了，枝股枯死，只有一枝一梢荣茂，这一枝一梢还能维系多久？ 28《乡约》： 一、 德业相劝 德谓见善必行闻过必改能治其身能修其家能事父兄能教子弟能御童仆能敬长上能睦亲邻能择交游能守廉洁能广施惠能受寄托能救患难能规过失能为人谋事能为众集事能解斗争能决是非能兴利除害能居官举职凡有一善为众所推者皆书于籍以为善行。业谓居家则事父兄教子弟待妻妾在外则事长上结朋友教后生御僮仆至于读书治田营家济物好礼乐射御书数之类皆可为之非此之类皆为无益。 二、过失相规 犯义之过六：一曰酗酒斗讼二曰行止逾违三曰行不恭逊四曰言不忠信五曰造谣诬毁六曰营私太甚。犯约之过四：一曰德业不相劝二曰过失不相规三曰礼俗不相成四曰患难不相恤。不修之过五：一曰交非其人所交不限士庶但凶恶及游惰无形众所不齿者若与之朝夕游从则为交非其人若不得已暂往还者非二曰游戏怠惰游谓无故出入及谒见人止多闲适者戏笑无度及意在侵侮或驰马击鞠之类怠惰谓不修事业及家事不治门庭不洁者三曰动作无仪进退疏野及不恭者不当言而言当言而不言者衣冠太饰及全不完整者不衣冠而入街市者四曰临事不恪主事废妄期会后时临事怠慢者五曰用度不节不计家之有无过为侈费者不能安贫而非道营求者以上不修之过每犯皆书于籍三犯则行罚。 三、礼俗相交 ………… 29白嘉轩从街巷里走过去，瞥见白满仓之妻坐在街门外的捶布石上给娃子喂奶，扯襟袒脯，两只猪尿泡一样肥大的奶子裸露出来，当晚就在众人聚集的祠堂里当作违反礼仪的事例讲了。白满仓羞得赤红着脸，当晚回去就抽了丢人现眼的女人两个耳光。从此，女人给孩子喂奶全都自觉囚在屋里。 30黑娃就攥起拳头轻轻在她手指的地方捶击。小女人呻唤一声：“哎哟太重了！”黑娃就更轻一点叩击。小女人怨怨艾艾地说：“黑娃你真笨！你轻轻揉一揉。”黑娃就松开拳头，用手掌抚摩起来。小女人穿着一件白色细格洋布衫，比家织的粗布衫儿绵软而光滑，温热的肌肤透过薄薄的洋布传感到黑娃粗硬的掌心，胸腔里便涨起汹涌鼓荡的潮水，他想跳上炕去把她压扁挤碎，又想一把揪起她来搂住。但他却压抑着种种念头轻轻问：“你好点了没有二姨？我该饮牛去咧。”小女人说：“好了好得多了。你再揉一下下就全好了。”黑娃就继续揉抚着。他看一眼小女人仰躺着的隆起的胸脯，小女人迷离的眼睛异样地瞅着他说：“黑娃，你日后甭叫我二姨了，你该叫我姐姐……娥儿姐。”黑娃忙说：“那不乱了辈分儿咧？你家郭举人我叫大叔，怎么能跟你叫姐呢？”小女人挖一眼他说：“你真是个瓜蛋儿！有旁人在场，你就还叫二姨；只有你跟我在一搭时，你叫娥儿姐。记下记不下？”黑娃似乎心领神会了一个信号，一个期待着的又是令人惊悸的信号，他的头发似乎倒提起来，手臂抖颤，喉咙憋得说不出话，只好点点头。小女人就悄着声说：“你试着先叫一声姐……”黑娃咬着嘴唇，自觉血已涌上脸膛，颤着声叫道：“姐吔——娥儿姐——”小女人听着一把抓住他的胳膊，从炕上翻坐起来，扑进他的怀里。黑娃双臂紧紧搂抱着小女人，那个美好的肉体在他怀里抖颤不止。他不知道怎么办，一股无法遏止的欲望催着他把她死死地箍抱到怀里，似乎要把她纳进自己的胸膛才能达到某种含混的目标。她的双臂箍住他的脖子，浑身却像一口袋粮食一样往下坠。他就这样紧紧地搂着她，不知道还应该做什么。她突然往上一蹿，咬住他的嘴唇。他就感到她的舌头进入他的口腔，他咬住那个无与伦比的舌头吮咂着，直到她嗷嗷嗷地呻唤起来才松了口。她痴迷地咧着嘴，示意他把她咬疼了，却又把嘴唇努着迎上来，暗示着他的嘴唇。他在这一瞬间准确无误地解开了那个哑语式的暗示，就把舌头伸进她的嘴里。她的咂吮比他更贪婪更狠劲，直到他忍不住也嗷嗷嗷地呻唤起来，她却仍旧咂住不放，只是稍微放松了口。她同时就倒下去，背倚在炕边上，把他也坠倒了，压在她的身上。这当儿，他的浑身像遭到电击一样，一股奇异的感觉从腹下潮起，迅即传到全身，他几乎承受不住那种美妙无比的感觉的冲击，突然趴在她身上，几乎要融化成水了。那种美妙的感觉太短暂了，像夏天的一阵骤雨，他一身松软一身疲惫一身轻松，喉咙里通畅了，胸腔里也空寂了，燥热退去了。他有点懊悔，站起来说：“二姨——噢——娥儿姐，我该饮牛饮马去了。”小女人跳起来猛地抱住他，又深深地在他的嘴上亲了两口：“好兄弟……” 31黑娃瞧着小女人用木盘端来了盐碟辣碟醋碗和蒜罐儿，就不由得心跳；看见她戴着银镯的手腕，就回味到握着时的那种温柔和细腻；瞧见她颤动着的胸脯，就异常清晰地感到贴着时的痴迷和消融。 32黑娃嚼着凉凉的面皮，还是察觉到了李相和王相没有察觉出来的变化，小女人走路的步子轻盈了，两只秀溜的小脚麻利地扭着，胸脯上的那两团诱人的奶子就颤悠悠弹着，眼睛像雨后的青山一样明澈，往日里那种死气沓沓的神色已经扫荡净尽。","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-三体-死神永生","date":"2017-06-22T05:15:53.000Z","path":"2017/06/22/20170622-读书笔记-三体-死神永生/","text":"书名：三体：死神永生作者：刘慈欣 读后感01 印象比较深刻的有两段：一段是云天明的三个故事，故事本身，以及故事的隐喻，这脑洞太大了，环环相扣，太棒了。简直是本书的高潮。一段是程心的两次错误，让我情不自禁想到王者荣耀里面的坑队友。气的要命。无可奈何到绝望….既有优柔寡断的一面，又有屈服命运的一面.嘿嘿嘿，怀着险恶的用心去知乎搜了搜，发现黑程心的人还真不少，哈哈，反正对我来说，再怎么解释，我也不会原谅她，我就是这么肤浅，可惜了一个好名字… 02知乎有人爆料：真结局其实是整个宇宙都呵呵了，就因为那5公斤。只不过被要求改了。（卧槽！！！）三体x里说小宇宙是宇宙的主宰创造的，可以强制把小宇宙扔回大宇宙里，而且为了以防有文明可以创造小宇宙还发送了几百万种语言的超膜广播。但主宰无法控制小宇宙内部，要归还只能全部归还，不能归还大部分只剩下五公斤，所以相当于一个bug。5公斤对于宇宙重生刚好是一个至关重要的质量。其实我觉得宝树是看大家这么讨厌程心就顺便又一次黑了她，三体x算是同人，不喜欢这个也可以只认大刘的结局。 03 通往地狱的道路是被人类的善意铺成的。 04 她真正的问题在于，没有金刚钻，却硬要揽瓷器活。程心的错误不在于放弃按下按钮，而在于去竞选执剑人；不在于选择让维德停止战争准备，而在于冬眠前强制要求保留这项最终决定权。 05 刘慈欣：写这个人就没想过让读者喜欢，这不是读者会喜欢的人。她其实很自私，但这种自私和普通的自私不一样，因为她自己觉察不到。遵循道德的人其实很自私，因为他们除了道德和良心什么都不管，程心恰恰就是一个这样的人。她会认为自己很崇高，认为自己不自私，认为自己的价值观和道德准则是普世的、正确的。至于遵循它会带来什么后果，她只考虑能不能让自己的良心得到平安。这种人有牺牲精神，能够为自己的价值观和道德准则牺牲生命，但这也不能改变他们自私的本质。在小说里，真正做到“大爱无仁”不自私的人，会从人类的整体去考虑，因为牺牲良心是最难的事情，比牺牲生命要难得多。 摘要01与三体文明的战争使人类第一次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了寻友的篝火，在暗夜中发抖。自以为历经沧桑，其实刚刚蹒跚学步；自以为悟出了生存竞争的秘密，其实还远没有竞争的资格。使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到，因为战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。宇宙的田园时代已经远去，昙花一现的终极之美最终变成任何智慧体都无法做出的梦，变成游吟诗人缥缈的残歌；宇宙的物竞天择已到了最惨烈的时刻，在亿万光年暗无天日的战场上，深渊最底层的毁灭力量被唤醒，太空变成了死神广阔的披风。太阳系中的人们永远不会知道这一切，最后直面真相的，只有两双眼睛。 02三体星系由于拥有三颗太阳，其不规则运动使得三体文明的生存条件极为严酷。为了应对变幻莫测的自然环境，他们随时可以将自己体内的水分完全排出，变成干燥的纤维状物体，以躲过完全不适合生存的恶劣气候。 03这是一个游戏，游戏背后是一个遥远星际文明二百次毁灭与重生的专奇，游戏由中的人物却是孔子、墨子、秦始皇、伽利略、葛力高利教皇、牛顿、爱因斯坦……古今中外各路人马走马灯似的上场。这是一场跨越时空的狂欢，历史、文革、三体又构成了另一个意义上的三体关系，它们之间遥相辉映而又扑朔迷离，在最不可思议的生存景象中蕴涵着触手可及的现实针对性，把三体系统的复杂性发挥得淋漓尽致。 04要是换了别人，《三体》写到这个程度，大可满意收场了，但是对大刘来说，好戏才刚刚开始。在《三体II·黑暗森林)中，地球、三体和宇宙更高级文明构成了一个更大规模的三体结构。面对三体人令人难以置信的科技和前来毁灭地球的庞大舰队人类举全球之力，制订了“面壁计划”，由四位“面壁人”独立设计四套反击方案。说真的，其中每一套对策都构思独特、气势磅礴，令人拍案叫绝。放到其他人的作品中，每个都可以作为构筑大结局的终极解决方案.但对大刘来说.这些都只不过是铺垫和浮云 05假如在太空中存在着无数的文明，它们之间应该是什么样的关系?大刘别出心裁地设想了一门“宇宙社会学”，专门研究这个问题。宇宙社会学设定两条公理:“第一，生存是文明的第一需要;第二，文明不断增长和扩张.但宇宙中的物质总量保持不变。”乍一看这“公理”很俗很平淡很没意思.但等到最后底牌翻出来绝对震死你。 06精骛八极，心游万仞可上九天揽月，可下五洋捉鳖 07在整个三部曲中，我个人认为第一部最有历史感和现实感，第二部的完成度最高，结构最完整，线索最清晰，也最华丽好看，第三部则是把宇宙视野和本质性的思考推向了极致。 08我把太阳移到西天,随着阳光角度的变化,田野中禾苗上的水珠一下予晶晶闪亮起来,像突然睁开的无数眼睛。我把阳光调暗些,提前做出一个黄昏,然后遥望着地平线上自己的背影。我挥挥手,那个夕阳前的剪影也挥挥手。看着那个身影,我感觉自己还是很年轻的。这是个好时光,很适合回忆。 09一队蚂蚁不停搬运米粒大小的石块,给它们十亿年,就能把泰山搬走。只要把时间拉得足够长,生命比岩石和金属都强壮得多,比飓风和火山更有力。 10不过可以猜。植物、动物和细菌,都对形成现在这样的大气层产生过重要作用,如果没有生命,现在的大气成分会有很大不同,可能已经无法阻拦紫外线和太阳风,海洋会蒸发,地球大气先是变成金星那样的蒸笼,水汽从大气层顶部向太空蒸发,几十亿年下来,地球就成干的了。 11“如果有一个像这样的数学模型来模拟整个宇宙,像刚才那样,在开始运行时把生命选项去掉,那结果中的宇宙看起来是什么样子?” 12“年轻人,医治不死病,佛度有缘人。” 13程心、云天明来了、爱了、给了她一颗星星、走了 14当程心介绍完自己并请他以后多多指教时,他才抬起头来,那目光给她最初的印象是疲倦和懒散,但在深处隐约透出一丝令她不安的锐利。他脸上出现了一抹笑意,但丝毫没有使程心感到温暖和放松,那微笑像冰封的河面上一条冰缝中渗出的冰水,在冰面上慢慢弥散开来。 15朝鲜战争中,美军发现你们被俘的士兵竞然知道得那么多,你们把作战方案交给基层部队讨论,希望从士兵的讨论中得到更多的好办法,这就是MD。MD是军事民主。 16美国的“和平卫士”、俄罗斯的“白杨”和中国的“东风”（洲际导弹的名字） 17在人类传统的情报战中,把一个身份完全暴露的间谍送人敌人内部是毫无意义的举动,但这不是传统的战争,一个人类进人外星舰队的内部,本身就是一个伟大的壮举,即使他(她)的身份和使命暴露无遗也一样。他(她)在那里能做什么不是现在需要考虑的,只要他(她)成功地进入那里,就存在无限的可能性;而三体人的透明思维和谋略上的缺陷,使这种可能性更加诱人。 18晚上,程心登上新世贸大厦的楼顶,迫不及待地想看到自己的星星。这之前她已经仔细看过随证书寄来的观星资料,但当天纽约上空阴云密布。第二天第三天也都是阴的,云层像一只逗弄她的巨掌,捂着她的礼物不放开。但程心并没有失落,她知道她收到的是一件最不可能丢失的礼物,DX3906就在宇宙中,可能比地球和太阳的寿命还长,她总有一天能看到它的。 晚上。她长久地站在公寓的阳台上,看着夜空想象那颗星星的样子,城市的灯海在云层上映出一片暗黄色的光晕,她却想象那是她的DX3906给云照出的玫瑰色。她梦到那颗星星,梦中她在恒星的表面飞翔,那是一颗玫瑰色的星球.没有灼人的烈焰,只有春风般的清凉,恒星表面是清澈的海洋,能清晰地看到水中玫瑰色的藻群…… 19程心站在医院外面,她不敢进去,但又不忍心离开,只能站在那里咀嚼自己的痛苦。同来的维德径自向前走去,走了几步停卞来,转身欣赏了几秒钟程心的痛苦,然后满意地把最致命的一击抛给她:“哦.还有一个惊喜:你的那颗星星是他送的。” 20加利福尼亚,公元1967年,发生了这样一件事:一个名叫岁恩·琼斯的高中教师,为了让他的学生透彻地理解什么是极权、什么是纳粹,就在班上用摸拟的方式建立了一个极权社会。只用了五天时间,琼斯就成功了.他的班级成了一个微型的纳锌德国,在那里,每个学生都自愿放弃了自我和自由.融入至高无上的集体。并对集体的目标充满宗教般的狂热。最后,这场以游戏开始的教学试验几乎失控。后来这件事被德国人拍成了电影,当事人还写过一本书,名叫《极权只需五天)。 21因为杀的人太少了。杀一个人是要被判死刑的.杀几个几十个更是如此.如果杀了几千几万人,那就罪该万死;但如果再多些,杀了几十万人呢?当然也该判死刑,但对于有些历史知识的人,这个回答就不是太确定了;再进一步,如果杀了几百万人呢?那可以肯定这人不会被判死刑,甚至不会受到法律的惩处,不信看看历史就知道了,那些杀人超过百万的人,好像都被称为伟人和英雄;更进一步,如果这人毁灭了一个世界,杀死了其中的所有生命.那他就成了救世主!. 22关一帆收回目光,看着韦斯特说:“昨天我做了一个梦,梦里到了一个地方,那是一个很宽敞的地方,宽敞到你不可能想象的程度。醒来后感觉现实很狭窄,就感到幽闭恐惧了。就好像,从一出生就一直把你关在一个小箱子里,也无所谓,可一旦把你放出来一次再关回去,就不一样了。” 23“可你刚说过是在做梦。”关一帆摇摇头,努川回忆着什么,“我不知道那是不是梦,也不知道那时是不是醒着。有时候,你会在梦中觉得醒来了,却发现仍在梦中;有时候,你本来醒肴,却好像在梦中。” 24他端坐在那里,呈一个稳定的倒丁字形,仿佛是海滩上一只孤独的铁锚,任岁月之风从头项吹过.任时间之浪在面前咆哮,巍然不动,以不可思议的坚定等待着一艘永不归航的船。 25新老执剑人默默相对。他们的目光只是交会了短暂的一刹那,那一瞬间,程心感觉有一道锐利的光芒扫过她灵魂的暗夜,在那目光中,她感觉自己像纸一样薄而轻飘,甚至完全透明了。她无法想象,五十四年的面壁使这位老人悟出了什么,他的思想也许在岁月中沉淀得像他们头顶的地层一样厚重,也可能像地层之上的蓝天一样空灵。她不可能真正知道,除非自己也走到这一天。除了不见底的深邃,她读不懂他的目光。 26与罗辑不同,她没感觉到这是一场生死决斗,只感觉这是一盘棋,她平静地在棋盘前坐下,想好了各种开局,假设了对方的各种棋路并一一想好应对的方法.她准备用一生的时间下这盘棋。但对方方没有移动一枚棋子.而是抓起棋盘向她劈头盖脸砸过来。 27太古代21亿年,元古代的震旦纪18亿3000万年;然后是古生代:寒武纪7000万年,奥陶纪6000万年,志留纪4000万年,泥盆纪5000万年,石炭纪650万年,二叠纪5500万年;然后中生代开始了:三叠纪3500万年。侏罗纪5800万年,白至纪7000万年;然后是新生代:第三纪6450万年,第四纪250万年。然后人类出现,与以前漫长的岁月相比仅是弹指一挥间,王朝与时代像焰火般变幻,古猿扔向空中的骨头棒还没落回地面就变成了宇宙飞船。最后.这35亿年风雨兼程的行进在一个小小的人类个体面前停下了. 28到目前为止一言不发的罗辑仍很从容,而他对茶道显然更内行些,左手托着茶碗,右手把碗转了三圈才开始喝。他喝得很慢,让时间在寂静中流逝。直到窗外的云雾染上了夕阳的金色,他的茶才喝完,然后他慢慢放下碗,说出了第一句话:“我也不能再问了吗?” 29程心担忧地看着罗辑,后者却几乎没有停顿,果断地说:“我考虑好了,下面是我的问题:如果从宇宙尺度的远距离观察,三体世界显现出某种危险特征,那么,是否存在某种安全特征,或者叫安全声明,可以向宇宙表明一个文明是安全的,不会对其他世界构成任何威胁,进而避免黑暗森林打击?地球文明有办法向宇宙发出这样的安全声明吗?” 30曾经有过一个天真的时代,那时科学家相信,能够通过远距离观测发现遥远恒星系中存在的文明迹象,比如探测行星大气中氧气、二氧化碳和水的吸收光谱,以及文明发出的电磁辐射等,甚至提出戴森球迹象这类异想天开的猜测。现在知道,这是一个所有文明都在隐藏自己的宇宙,如果一个恒星系从远方观察没有任何智慧迹象,可能是因为它真的处于蛮荒状态,也可能是那个星系中的文明已经成熟的标志。 31这时,程心的意识就像太空一般透明而空旷,没有回忆,没有明显的感觉.精神的水面平滑如镜.倒映着正在落下的生命的太阳,像每一个黄昏一样自然……这就对了,如果一个世界都能在弹指一挥间灰飞烟灭,一个人的终结也就应该如露珠滚下草叶般平静淡然。 32寂静中,程心抿了一小口绿茶,闭起双眼品味着,一阵沁人心脾的清苦,像饮下了冷寂的星光。茶喝得很慢,但最后还是喝完了。 33那时云天明就常常向她投来这样的目光,他做得很隐蔽,但女孩子的直觉能感受到。现在,这目光与他的成熟合在一起,像穿过光年距离的阳光,让她沉浸在温暖的幸福中。 34 程心紧张起来,她现在知道云天明并没有放弃。关健时刻到来了.她必须做些什么.但要万分谨慎!她徽笑着说:“既然咱们不能说别的,那些故事总能讲把?那真的只和我们有关……“讲我编的还是你编的?”“讲我编的吧,把我的竟年带回来。“程心的回答几乎没有迟疑.连她都惊异自己思维的速度,仅一瞬间,她明白了云天明的用意。“这很好,那我们下面不再说别的了,就讲故事,讲你编的那些故事。“云天明说这话时摊开两手看着上方,显然是说给监听者听的,意思很明白:这样行了吧.肯定部是安全的内容。然后他转向程心,“我们还有一个多小时的时间,讲哪个呢?那我就讲.嗯《……国王的新画师吧。”于是,云天明开始讲那个叫《国王的新画师》的童话故事.他的声音低沉舒缓,像在吟诵一首长长的古老歌遥。程心开始是在努力记忆,但渐渐就沉浸在了故事中。时间就在云天明的童话中流逝。他先后讲了内容连续的三个故事:《国王的新画师》、《婆餐海》和《深水王子》。当第三个故事结束时,在智子的显示画面上出现了一个倒计时,显示会面的时间只剩一分钟了。 分别的时刻即将来临。 程心从童话的梦中突然惊醒,什么东西猛烈地撞击着她的心扉,让她难以承受。她说:“宇宙很大,生活更大,我们一定还能相见的。”这话脱口而出,说完她才意识到自己重复了智子的话。 “那我们约定一个相会的地点吧,除了地球,再约另一个地方,银河系中的一个地方。” “那就在你送给我的那颗星吧,那是我们的星星。”程心不假思索地说。 “好,在我们的星星!” 35云天明的三个故事 36在盟洗台上,她用小刀片从香皂上切下了小小的一片,然后把小纸船的尾部扎了一个小孔,把那一小片香皂插人小孔中,抬头对程心神秘地一笑,轻轻地把纸船放进已灌满水并且水面已经平静下来的浴缸中。小船向前移动了,在这片小小的水面上,从此岸航向彼岸。程心立刻明白了原理:香皂在水中溶解后,降低了小船后方水面的张力,但船前方水面的张力不变,小船就被前方水面的张力拉过去了。 37死亡是唯一一座永远亮着的灯塔,不管你向哪里航行,最终都得转向它指引的方向。 38“第一题:有一盏灯,关着,一分钟时闪亮了一下,再过半分钟又闪亮一下,再过十五秒再闪亮一下,以后就这样每过前面间隔时间的一半就闪亮一下,请问到两分钟时灯闪亮了多少次?”“无数次。” 39“第二道题:一根粗细不均匀的绳子,从一头点燃后烧完要用一个小时,如何用它来做15分钟的计时?注意,不均匀!”“绳子对折后从两头烧!” 40“阿姨,他们在下面会死吗?”那过绍孩子问。“我们每个人一生下来都注定要死的,只是早晚而已。” 41处于幼年的人类文明曾经打开家门向外看了一眼,外面无边的暗夜吓住了他,他面对黑暗中的广表和深邃打了个寒战,紧紧地关上了门。 42黑洞之所以成为连光都能吸人的超级陷阱,并非因为它有巨大的引力总量(当然,由恒星坍缩而成的大型黑洞引力总量也是很大的),而是,其有超高的引力密度。从远距离上看,它的引力总量其实与相同质量的普通物质相当。假如太阳坍缩成黑洞,地球和各大行星将仍然在原轨道上运行.不会被吸进去。只有在十分靠近黑洞的范围内.它的引力才显示出魔力。 43“首先回答我一个问题。”丁仪没有理会白艾思的话,指指夕阳中的沙漠说,“不考虑量子不确定性,假设一切都是决定论的,知道初始条件就可以计算出以后任何时间断面的状态,假如有一个外星科学家,给它地球在几十亿年前的所有初始数据,它能通过计算预测出今天这片沙漠的存在吗?”白艾思想了想说:“当然不能,因为这沙漠的存在不是地球自然演化的结果,沙漠化是人类文明造成的,文明的行为很难用物理规律把握吧。”“很好,那为什么我们和我们的同行,都想仅仅通过对物理规律的推演,来解释今天宇宙的状态,并预言宁宙的未来呢?” 44“可是‘星环’号上怎么只有我们两个人,至少应该再带两个男人啊?!”AA对罗辑喊道。 45“从星环城事件到水星基地建立完成,这中间有三十五年,宝贵的三十五年耽误了。”程心替他把话说了出来。 罗辑默默地点点头,他看程心的目光已经没有了慈爱,像最后审判日的火炬,至少在她看来是这样,那目光分明在说:孩子,看看你干了什么? 现在程心知道,地球文明的三条生存之路:掩体、黑域和光速飞船,其中只有光速飞船是真正的活路。云天明指出了这条活路,但她把这条路堵死了。如果她没有制止维德,星环城有可能获得独立,即使是暂时的、有限的独立,也有可能促使他们发现曲率驱动的尾迹效应,这将使联邦政府改变对光速飞船的态度,进而使人类有足够的时间建造那一千多艘光速飞船,进而有可能建造黑域,避免这次维度打击那时,人类会分成两部分,想飞向星空的和想在黑域中过安乐生活的,前者乘光速飞船离去,为后者留下黑域,各得其所。 46她终于还是犯了第二次错误。她两次处于仅次于上帝的位置上,却两次以爱的名义把世界推向深渊,而这一次已没人能为她挽回。 47“星环”号关闭了曲率引擎,以光速滑行。航程中,AA一直在试图安慰程心,虽然她知道这已经是一件自己力所不能及的事。她对程心说,你认为是自己的错误毁灭了太阳系那是很可笑的,这样想实在是太自命不凡了,就像你在地面上做一个倒立,就认为自己举起了地球一样。即使你当时没有制止维德,那场战争的结局也很难预测,星环城真的能够获得独立吗?这点连维德自己也没有信心。联邦政府和舰队真的会被几粒反物质子弹吓住?也许星环城的守卫者能摧毁几艘战舰,甚至一座太空城,但星环城最后会被联邦舰队消灭,这种情况下可能连以后建设水星基地都不可能了。从另一个方面想,即使星环城独立,继续曲率驱动的研究并发现了尾迹效应,最后与联邦政府合作,有充足的时间造出一千多艘光速飞船,但人类世界真的会为自己建立黑域吗?要知道那时人们已经信心满满,认为掩体世界能够躲过黑暗森林打击并生存下去,他们真的会用黑域把自己与宇宙隔绝吗? 48飞船A.I.对监测系统刚刚得到的数据进行分析,重新确定了这个星系的基本状况:DX3906恒星有两颗行星,都是固态行星,其中距恒星较远的一颗体积与火星相当,但没有大气层,表面十分荒凉,由于它呈灰色,程心和AA把它叫做灰星。轨道半径较小的另一颗行星体积与地球相当,表面特征也与地球十分相似,有含氧大气层,且有明显的生命迹象,但没有发现农业和工业文明存在的痕迹;它像地球一样呈现出蓝色,她们叫它蓝星。 49“我当然知道你不怕,我只是想跟你说说话。我知道你作为执剑人的经历,只是想说,你没有错。人类世界选择了你,就是选择了用爱来对待生命和一切,尽管要付出巨大的代价。你实现了那个世界的愿望,实现了那里的价值观,你实现了他们的选择,你真的没有错。”“你后来的经历我不知道,但我相信你也没错。爱是没错的,一个人不可能毁灭一个世界,如果这个世界毁灭了,那是所有人,包括活着的和逝去的,共同努力的结果。” 50时间一天天过去,像那条小溪中的水,平静而流畅。 【END】 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"树莓派-03.设置为wifi热点ap","date":"2017-06-20T06:58:22.000Z","path":"2017/06/20/20170620-树莓派-03-设置为wifi热点ap/","text":"使用的工具 hostapdudhcpd 步骤更新软件源sudo apt-get update 安装必要的软件 sudo apt-get install hostapd udhcpd hostapd 是一个用户态用于AP和认证服务器的守护进程，它实现了IEEE 802.11相关的接入管理.udhcpd使得树莓派具备DHCP Server功能。 配置DHCP功能配置文件位于/etc/udhcpd.conf，此处共分为三步。 sudo nano /etc/udhcpd.conf nano是一个小巧自由，并且友好的编辑器，在大部分linux上都有nano命令。相对vi，不熟悉linux的我感觉nano要简单许多.完成后按ctrl+x退出，按y保存，回车 参考链接树莓派学习笔记——Wifi AP热点模式 使用RT5370将树莓派Raspberry Pi设置为无线路由器(WiFi热点AP,RTL8188CUS芯片)hostapd / wpa_supplicant - GIT accessUSING YOUR NEW RASPBERRY PI 3 AS A WIFI ACCESS POINT WITH HOSTAPDRPI-Wireless-Hotspot","tags":[{"name":"树莓派","slug":"树莓派","permalink":"http://sniperkaka.com/tags/树莓派/"}]},{"title":"树莓派-02.系统配置","date":"2017-06-01T03:17:09.000Z","path":"2017/06/01/20170601-树莓派-02-系统配置/","text":"设置root直接登录（笔者是因为懒，所以直接root直接登录，不需要考虑以后权限问题，可以不设置这一项） #设置root密码 sudo passwd root #切换到root用户sudo -s 想要在登录界面使用root身份登录，可编辑/etc/lightdm/lightdm.conf文件，如没有此文件，直接创建 1.在terminal下输入gedit /usr/share/lightdm/lightdm.conf.d/50-ubuntu-mate.conf内容添加：user-session=mateallow-guest=falsegreeter-show-manual-login=true此步结束后可以使用root用户登录。2.打开/etc/lightdm/lightdm.conf文件，更改内容如下autologin-guest=falseautologin-user=rootautologin-user-timeout=0此步结束后可以免密码登录root3.在终端中用命令vi /root/.profile，打开文件后找到“mesg n”，将其更改为“tty -s &amp;&amp; mesg n”。4.用reboot命令重启即可 修改文件系统大小 sudo fdisk /dev/mmcblk0输入d 回车 （delete a partition）输入2 回车 （Partition number）输入n 回车 （add a new partition）输入p 回车 （pint the partition table）输入2 回车 （Partition number）输入回车回车 w 回车 （write table to disk and exit）然后重启系统后输入sudo resize2fs /dev/mmcblk0p2再重启系统 设置windows远程桌面安装xrdp apt-get install xrdpWindows端使用mstsc.exe连接即可 设置ssh判断是否安装ssh服务，命令：ssh localhost如果提示： ssh: connect to host localhost port 22: Connection refused就表示没有还没有安装SSH，安装命令：sudo apt-get install openssh-server卸载命令：sudo apt-get remove openssh-server确认是否安装正常 ps -e|grep ssh 1418 ? 00:00:00 sshd看到sshd那说明ssh-server已经启动了如果没有则可以这样启动：sudo /etc/init.d/ssh start 或者 service ssh start sudo /etc/init.d/ssh restart 重启 当我们使用root用户SSH连接远程主机时，显示服务器拒绝了密码，请再试一次。这种情况一般是SSH配置没有允许root账户登录所致。解决办法是：修改SSH的配置文件/etc/ssh/sshd_config修改 vim /etc/ssh/sshd_config找到#Authentication:LoginGraceTime 120PermitRootLogin without passwdStrictModes yes改成 #Authentication:LoginGraceTime 120PermitRootLogin yesStrictModes yes然后重启SSH服务（/etc/init.d/ssh restart）即可。 ssh-server配置文件为：/etc/ssh/sshd_config，更改配置需重启SSH服务。 ps -e |grep ssh如果可以看到ssh-agent，说明Ubuntu缺省安装了openssh-client，可以在树莓派ssh登录其他系统如果可以看到sshd，说明安装了openssh-server，可以从其他系统通过ssh登录到树莓派。 安装输入法Ibus输入法是一个基于Python开发的全新输入法框架，支持多种语言。安装命令：sudo apt-get install ibus ibus-pinyin 参考链接树莓派系统镜像怎么烧录到Micro-SD卡树莓派安装Ubuntu mate15.10-系统笔记树莓派常用软件及服务三款中文输入法 [END] 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"树莓派","slug":"树莓派","permalink":"http://sniperkaka.com/tags/树莓派/"}]},{"title":"树莓派-01.树莓派初体验","date":"2017-05-31T08:39:36.000Z","path":"2017/05/31/20170531-树莓派-树莓派初体验/","text":"01.树莓派初体验包装图如下： 树莓派板子安装散热片前板子正反面图： 安装散热片后板子正反面图： 主要规格 BCM2837芯片四核64位ARM Cortex A53 CPU为1.2GHz主频400MHz的IV的VideoCore GPU1GB SDRAM LPDDR2-900支持WiFi / BT的BCM43438芯片802.11n无线网卡蓝牙4.0 树莓派系统1.下载一个树莓派系统镜像文件参考链接（笔者使用的是ubuntu-mate-16.04.2-desktop-armhf-raspberry-pi） 2.安装Win32DiskImager（windows下安装镜像的工具）参考链接 1.解压下载的操作系统镜像压缩文件，得到img镜像文件。2.将SD使用卡托或者读卡器后，连上电脑。3.解压并运行win32diskimager工具。4.在软件中选择系统镜像(img文件)，“Device”下选择SD的盘符，然后选择“Write”，期间出现对话框选择是。5.安装过程可能有些慢，根据你SD卡的速度而定的。(笔者的sd卡虽然比较快，但读卡器d读写超级慢，所以买个支持3.0的读卡器还是有必要的)等到出现对话框write successful就说明成功了。 3.启动系统插上sd卡插上usb接口的键盘和鼠标接上树莓派板子与显示器的HDMI转DVI线(如下图)插上电源，上电。设置系统使用的语言设置键盘设置wifi设置时区 桌面效果图 [END] 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"树莓派","slug":"树莓派","permalink":"http://sniperkaka.com/tags/树莓派/"}]},{"title":"读书笔记-第一行代码-02-activity","date":"2017-05-20T05:11:00.000Z","path":"2017/05/20/20170520-读书笔记-第一行代码-02-activity/","text":"第一行代码-02-探究活动","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"802-11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究-续","date":"2017-05-19T06:35:42.000Z","path":"2017/05/19/20170519-无线网络-802-11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究-续/","text":"目录 Wi-Fi认证过程 802.11标准中的数据安全加密协议 3. Wi-Fi认证过程有了802.11协议的基本格式之后，我们可以使用wireshark进行抓包实验，验证一下我们的理论 ifconfig -aifconfig wlan1 upairmon-ng start wlan1启动wireshark，选择mon0网卡(开启了Monotor模式的虚拟网卡 0x1: 普通无加密连接过程1. AP发送Beacon广播管理帧因为AP发送的这个Beacon管理帧数据包是广播地址，所以我们的PCMIA内置网卡、或者USB外界网卡会接收到这个数据包，然后在我们的”无线连接列表”中显示出来 2. 客户端向承载指定SSID的AP发送Probe Request(探测请求)帧当我们点击”连接”的时候，无线网卡就会发送一个Prob数据帧，用来向AP请求连接 3. AP接入点对客户端的SSID连接请求进行应答AP对客户端的连接作出了回应，并表示不接受任何形式的”帧有效负载加密(frame-payload-encryption)” 4. 客户端对目标AP请求进行身份认证(Authentication) 5. AP对客户端的身份认证(Authentication)请求作出回应AP回应，表示接收身份认证 6. 客户端向AP发送连接(Association)请求身份认证通过之后，所有的准备工作都做完了，客户端这个时候可以向WLAN AP发起正式的连接请求，请求接入WLAN 7. AP对连接(Association)请求进行回应AP对客户端的连接请求(Association)予以了回应(包括SSID、性能、加密设置等)。至此，Wi-Fi的连接身份认证交互就全部结束了，之后就可以正常进行数据发送了 8. 客户端向AP请求断开连接(Disassociation)当我们点击”断开连接”的时候，网卡会向AP发送一个断开连接的管理数据帧，请求进行断开连接123由此，我们可以发现，基于对数据帧格式的了解，黑客可以发起一些针对协议的攻击1. Deanthentication攻击2. Disassociation攻击 黑客可以利用这种方式加快对WEP/WPS-PSK保护的无线局域网的攻击，迫使客户端重新连接并且产生ARP流量(基于WEP的攻击)、或捕获重新进行WPA连接的四次握手，然后可以对密码进行离线字典或彩虹表破解攻击 0x2: 基于WEP加密的连接过程0x3: 基于WPA-PSK加密的连接过程 这两种连接交互过程原理上和无加密方式(开放系统方式)相同，感兴趣的朋友可以使用wireshark进行抓包实验 4. 802.11标准中的数据安全加密协议在IEEE 802.11协议中的加密算法有如下几个 WEP，Wired Equivalent Privacy: 802.11中最早期的加密标准 CCMP(CTR with CBC-MAC Protocol): 基于AES的全新加密协议，在IEEE 802.11i中提出 WPA(Wi-Fi Protected Access) TKIP(Temporal Key Integrity Protocol) WPA2(Wi-Fi Protected Access 2) 后续希望做的事研究上面描述的加密算法以及它们的协议交互过程；研究一下伪AP、流量劫持的原理、实现；SSL中间人攻击，获取明文数据；无线钓鱼 参考链接802.11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究 【END】 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"无线网络","slug":"无线网络","permalink":"http://sniperkaka.com/tags/无线网络/"}]},{"title":"802.11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究","date":"2017-05-19T02:01:34.000Z","path":"2017/05/19/20170519-无线网络-802-11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究/","text":"目录 802.11标准简介 802.11协议格式 1. 802.11标准简介IEEE 802.11是现今无线局域网通用的标准，它是由国际电机电子工程学会(IEEE)所定义的无线网络通信的标准。其中定义了媒体访问控制层(MAC层)和物理层。物理层定义了工作在2.4GHz的ISM频段上的两种扩频作调制方式和一种红外传输的方式，总数据传输速率设计为2Mbit/s。两个设备可以自行构建临时网络，也可以在基站(Base Station, BS)或者接入点(Access Point，AP)的协调下通信。为了在不同的通讯环境下取得良好的通讯质量，采用CSMA/CA(Carrier Sense Multiple Access／Collision Avoidance)硬件沟通方式. 注意：802.11和Wi-Fi技术并不是同一个东西。Wi-Fi标准是802.11标准的一个子集，并且是Wi-Fi联盟负责管理。 在802.11协议的发展过程中，衍生出了一系列的和安全、加密相关的技术 WEP，Wired Equivalent Privacy: 802.11中最早期的加密标准 CCMP(CTR with CBC-MAC Protocol): 基于AES的全新加密协议，在IEEE 802.11i中提出 WPA(Wi-Fi Protected Access) TKIP(Temporal Key Integrity Protocol) WPA2(Wi-Fi Protected Access 2) 802.11标准将所有的数据包分为3种: 数据: 数据数据包的作用是用来携带更高层次的数据(如IP数据包，ISO7层协议)。它负责在工作站之间传输数据. 管理: 管理数据包控制网络的管理功能 1) 信标帧(Beacons): 在无线设备中，定时依次按指定间隔发送的有规律的无线信号(类似心跳包)，主要用于定位和同步使用 2) 解除认证(Deauthentication)数据包 3) Probe(request and response) 4) Authenticate(request and response) 5) Associate(request and response) 6) Reassociate(request and response) 7) Dissassociate(notify)管理帧负责监督，主要用来加入或退出无线网络，以及处理接入点之间连接的转移事宜 控制: 控制数据包得名于术语”媒体接入控制(Media Access Control, MAC)”，是用来控制对共享媒体(即物理媒介，如光缆)的访问 1) 请求发送(Request To Send，RTS)数据包 2) 清除发送(Clear To Send，CTS)数据包 3) ACK确认(RTS/CTS) 4) PS-Poll: 当一部移动工作站从省电模式中苏醒，便会发送一个 PS-Poll 帧给基站，以取得任何暂存帧控制帧通常与数据帧搭配使用，负责区域的清空、信道的取得以及载波监听的维护，并于收到数据时予以正面的应答，借此促进工作站间数据传输的可靠性. 这些不同类别的数据包被统称为”数据包类型”。 WLAN有以下三种网络拓扑结构: 1) 独立基本服务集(Independent BSS, IBSS)网络(也叫ad-hoc网络)2) 基本服务集(Basic Service Set, BSS)网络3) 扩展服务集(Extent Service Set, ESS)网络 1) AD-Hoc网络win7自带的AD-Hoc组建功能，可以让我们很方便的在一个小范围内快速组建”局域网”，联网打游戏啥的很方便 2) BSS网络对于个人PC来说，使用最多的所谓”无线Wi-Fi”指的就是BSS网络模式，我们通过AP(Access Point)接入点来接入网络. 3) ESS网络其中，ESS中的DS(分布式系统)是一个抽象系统，用来连接不同BSS的通信信道(通过路由服务)，这样就可以消除BSS中STA与STA之间直接传输距离受到物理设备的限制。根据拓扑结构可以得出802.11的两类服务： 站点服务SS(每个STA都要有的服务) 1) 认证(Authentication) 2) 解除认证(Deauthentication) 3) 加密(Privacy) 4) MSDU传递(MSDU delivery) 分布式系统服务DSS(DS特有服务) 1) 关联(Association) 2) 解除关联(Deassociation) 3) 分布(Distribution) 4) 集成(Integration) 5) 重关联(Ressociation) 2.802.11协议格式数据链路层是一个很靠近底层的通信协议，它使用Bit来表示信息(也使用Bit来标识数据包的开始和结束)，所以数据链路层的协议格式并没有强制要求一个固定的长度，即802.11协议长度是可变的。不同功能的数据帧长度会不一样。这一特性说明mac802.11数据帧显得更加灵活，然而，也会更加复杂。 mac 802.11的数据帧长度不定主要是由于以下几点决定的:1231. mac地址数目不定，根据帧类型不同，mac 802.11的mac地址数会不一样。比如说 ACK帧仅有一个mac地址，而数据帧有3个mac地址，在WDS模式下，帧头有4个mac地址。2. 802.11的管理帧所携带的信息长度不定，在管理帧中，不仅仅只有一些类似于mac地址，分片标志之类的这些信息，而且另外还会包括一些其它的信息，这些信息有关于安全设置的，有关于物理通信的，比如说我们的SSID名称就是通过管理帧获得的。AP会根据不同的情况发送包含有不同信息的管理帧。 3. 加密(wep,wpa等)信息，QOS(quality of service)信息，若有加密的数据帧格式和没有加密的数据帧格式还不一样，加密数据帧格式还多了个加密头，用于解密用。然则QOS也是同样道理 0x1: 管理帧协议格式(Beacon(信标)帧) (Probe Request(探测请求)帧) (Probe Response(探测响应)帧) (ATIM帧) (Disassociation(解除关联)与Deauthentication(解除认证)帧) (Association Request(关联请求)帧) (Reassociation Request(重新关联请求)帧) (Authentication(身份认证)帧) 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192939495969798991001. 帧控制结构(Frame Control) 1) Protocol Version: (协议版本)通常为0 2) Type: 帧类型，管理帧: 00 3) Subtype: 进一步判断帧的子类型 3.1) Beacon(信标)帧 3.2) Probe Request(探测请求)帧 3.3) Probe Response(探测响应)帧 3.4) ATIM帧 3.5) Disassociation(解除关联) 3.6) Deauthentication(解除认证)帧 3.7) Association Request(关联请求)帧 3.8) Reassociation Request(重新关联请求)帧 3.9) Authentication(身份认证)帧 4) To DS: 表明该帧是否是BSS向DS发送的帧 5) From DS: 表明该帧是否是DS向BSS发送的帧 6) More Fragment: 用于说明长帧被分段的情况，是否还有其它的帧，如果有则该值设置为1 7) Retry(重传域): 表示该分段是先前传输分段的重发帧。 8) Power Management: 表示传输帧以后，站所采用的电源管理模式 8.1) 为1: STA处于power_save模式 8.2) 为0: STA处于active模式 9) More Data: 表示有很多帧缓存到站中。即至少还有一个数据帧要发送给STA是设置为1。 10) Protected Frame: 表示根据WEP(Wired Equivalent Privacy)算法对帧主体进行加密。如果帧体部分包含被密钥套处理过的数据，则设置为1，否则设置为0 11) Order(序号域): 在长帧分段传送时，该域设置为1表示接受者应该严格按照顺序处理该帧，否则设置为02. Duration/ID(持续时间/标识)表明该帧和它的确认帧将会占用信道多长时间，Duration 值用于网络分配向量(NAV)计算 3. Address Fields(地址域): 1) Destination Address 2) Source Address 3) BSS ID 4. Sequence Control(序列控制域): 用于过滤重复帧 1) MSDU(MAC Server Data Unit), 12位序列号(Sequence Number) 2) MMSDU(MAC Management Server Data Unit), 4位片段号(Fragment Number)组成 5. Frame Body(Data): 发送或接收的信息。对于不同类型的数据帧来说，这个域的格式差别较大 1) Beacon(信标)帧 1.1) Timestamp(时戳)位: 可用来同步 BSS 中的工作站 BSS 的主计时器会定期发送目前已作用的微秒数。当计数器到达最大值时，便会从头开始计数 1.2) Beacon interval位: AP点每隔一段时间就会发出的Beacon(信标)信号，用来宣布 802.11网络的存在。我们打开无线连接的时候之所以能看到很多Wi-Fi点就是因为它 1.3) Capability information位: 发送Beacon信号的时候，它被用来通知各方，该网络具备哪种性能 1.4) SSID服务集标识(Service Set Identity): 由字节所形成的字串，用来标示所属网络的BSSID，即我们在Wi-Fi连接前看到的接入点名称 1.5) 跳频参数组合(PH Parameter Set): 包含了加入 802.11跳频(frequency-hopping)网络所需要的参数 1.6) 直接序列参数集合(DS Parameter Set): 指明网络所使用的信道数 1.7) 免竞争参数集合(CF Parameter Set): 出现在支持免竞争接入点所发送的 Beacon帧中，并非必须 1.8) IBSS 参数集合(IBSS Parameter Set): 指明ATIM window (数据待传指示通知信息间隔期间) 1.9) TIM数据待传信息(Traffic Indication Map): 指示有哪些工作站需要接收待传数据 1.10) Country: 国家识别码 1.11) 功率限制(Power Constraint): 让网络得以向工作站传达其所允许的最大传输功率 1.12) 信道切换宣告(Channel Switch Announcement): 为了警告网络中的工作站即将变换信道 1.13) 禁声(Quiet): 为了避免与特定的军事雷达技术彼此干扰 1.14) 发射功率控制报告(TPC Report): 指明链路的衰减情况，可以帮助工作站了解该如何调整传输功率 1.15) 扩展物理层(ERP) 1.16) 支持速率(Supported Rates): 无线局域网络支持数种标准速率。当移动工作站试图加入网络，会先检视该网络所使用的数据速率。有些速率是强制性的，每部工作站都必须支持 ，有些则是选择性的 1.17) RSN强健安全网络(Robust Security Network) 2) Probe Request(探测请求)帧 2.1) SSID服务集标识(Service Set Identity): 由字节所形成的字串，用来标示所属网络的BSSID，即我们在Wi-Fi连接前看到的接入点名称 2.2) Supported Rate(支持速率) 2.3) 扩展支持速率(Extended Supported Rate) 3) Probe Response(探测响应)帧 3.1) Timestamp(时戳)位: 可用来同步 BSS 中的工作站 BSS 的主计时器会定期发送目前已作用的微秒数。当计数器到达最大值时，便会从头开始计数 3.2) Beacon interval位: AP点每隔一段时间就会发出的Beacon(信标)信号，用来宣布 802.11网络的存在。我们打开无线连接的时候之所以能看到很多Wi-Fi点就是因为它 3.3) Capability information位: 发送Beacon信号的时候，它被用来通知各方，该网络具备哪种性能 3.4) SSID服务集标识(Service Set Identity): 由字节所形成的字串，用来标示所属网络的BSSID，即我们在Wi-Fi连接前看到的接入点名称 3.5) 支持速率(Supported Rates): 无线局域网络支持数种标准速率。当移动工作站试图加入网络，会先检视该网络所使用的数据速率 3.6) 跳频参数组合(PH Parameter Set): 包含了加入 802.11跳频(frequency-hopping)网络所需要的参数 3.7) 直接序列参数集合(DS Parameter Set): 指明网络所使用的信道数 3.8) 免竞争参数集合(CF Parameter Set): 出现在支持免竞争接入点所发送的 Beacon帧中，并非必须 3.9) IBSS 参数集合(IBSS Parameter Set): 指明ATIM window (数据待传指示通知信息间隔期间) 3.10) Country: 国家识别码 3.11) FH Hopping Parameters 3.12) FH Pattern Table 3.13) 功率限制(Power Constraint): 让网络得以向工作站传达其所允许的最大传输功率 3.13) 信道切换宣告(Channel Switch Announcement): 为了警告网络中的工作站即将变换信道 3.14) 禁声(Quiet): 为了避免与特定的军事雷达技术彼此干扰 3.15) IBSS 动态选项(IBSS DFS):在 IBSS 中负责动态选频的工作站可以在管理帧中传递 IBSS DFS 信息元素 3.16) 发射功率控制报告(TPC Report): 指明链路的衰减情况，可以帮助工作站了解该如何调整传输功率 3.17) 扩展物理层(ERP) 3.18) 扩展支持速率(Extended Supported Rate) 3.19) RSN强健安全网络(Robust Security Network) 4) ATIM帧 5) Disassociation(解除关联) 5.1) Beacon Code 6) Deauthentication(解除认证)帧 6.1) Beacon Code 7) Association Request(关联请求)帧 7.1) Capability information位: 发送Beacon信号的时候，它被用来通知各方，该网络具备哪种性能 7.2) Listen interval位: 为了节省电池的电力，工作站可以暂时关闭 802.11网络接口的天线。当工作站处于休眠状态，接入点必须为之暂存帧 7.3) SSID服务集标识(Service Set Identity): 由字节所形成的字串，用来标示所属网络的BSSID，即我们在Wi-Fi连接前看到的接入点名称 7.4) Supported Rate(支持速率) 8) Reassociation Request(重新关联请求)帧 8.1) Capability information位: 发送Beacon信号的时候，它被用来通知各方，该网络具备哪种性能 8.2) Listen interval位: 为了节省电池的电力，工作站可以暂时关闭 802.11网络接口的天线。当工作站处于休眠状态，接入点必须为之暂存帧 8.3) Current AP Address位: 使用Current AP Address(目前接入点的地址)位来表明目前所连接的接入点的 MAC地址 8.4) SSID服务集标识(Service Set Identity): 由字节所形成的字串，用来标示所属网络的BSSID，即我们在Wi-Fi连接前看到的接入点名称 8.5) Supported Rate(支持速率) 9) Authentication(身份认证)帧 9.1) Authentication Algorithm Number: 指明认证程序所使用的认证类型 9.2) Authentication Transaction Sequence Number: 用以追踪身份认证的进度 9.3) Status Code: 状态代码用来表示某项过程成功或失败 9.4) 质询口令(Challenge Text): 802.11所定义的共享密钥身份认证系统。会要求移动工作站必须成功解码一段加密过的质询口令。这段质询口令的发送系通过 Challenge Text (质询口令)信息元素6. FCS(CRC): 包括32位的循环冗余校验(CRC)，用于检错，注意是检错不是纠错 0x2: 数据帧协议格式数据帧的形式取决于网络的形式。帧究竟属于哪种类型，完全取决于subtype(子类型)位，而与其他位是否出现在帧中无关 (IBSS 数据帧的一种) (接入点发送(From AP)的帧，数据帧的一种) (发送至接入点(To AP)的帧，数据帧的一种) (WDS帧，数据帧的一种)control123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566671. 帧控制结构(Frame Control) 1) Protocol Version: (协议版本)通常为0 2) Type: 帧类型，数据帧: 10 3) Subtype: 进一步判断帧的子类型，不同类型的数据帧这个字段的格式是不同的 3.1) IBSS帧 3.1.1) 0000: Data 3.1.2) 0010: Null 3.2) From AP帧 3.2.1) 0000: Data 3.2.2) 1000: Data+CF+ASK 3.2.3) 0100: Data+CF+Poll 3.2.4) 1100: Data+CF+ACK+CF+Poll 3.2.5) 1010: CF+ACK 3.2.6) 0110: CF+Poll 3.2.7) 1110: ACK+CF+Poll 3.3) To AP帧 3.3.1) 0000: Data 3.3.2) 1000: Data+CF+ACK 3.3.3) 0010: Null 3.3.4) 1010: CF+ACK(no data) 3.4) WDS帧 null 4) To DS: 表明该帧是否是BSS向DS发送的帧时 4.1) IBSS: 设置为0 4.2) To AP: 设置为1 4.3) From AP: 设置为0 4.4) WDS: 设置为1 5) From DS: 表明该帧是否是DS向BSS发送的帧时 5.1) IBSS: 设置为0 5.2) To AP: 设置为0 5.3) From AP: 设置为1 5.4) WDS: 设置为1 6) More Fragment: 用于说明长帧被分段的情况，是否还有其它的帧，如果有则该值设置为1 7) Retry(重传域): 表示该分段是先前传输分段的重发帧。 8) Power Management: 表示传输帧以后，站所采用的电源管理模式 8.1) 为1: STA处于power_save模式 8.2) 为0: STA处于active模式 9) More Data: 表示有很多帧缓存到站中。即至少还有一个数据帧要发送给STA是设置为1。 10) Protected Frame: 表示根据WEP(Wired Equivalent Privacy)算法对帧主体进行加密。如果帧体部分包含被密钥套处理过的数据，则设置为1，否则设置为0 11) Order(序号域): 在长帧分段传送时，该域设置为1表示接受者应该严格按照顺序处理该帧，否则设置为02. Duration/ID(持续时间/标识)表明该帧和它的确认帧将会占用信道多长时间，Duration 值用于网络分配向量(NAV)计算 3. Address Fields(地址域): 这个域的具体格式和控制帧的子类型有关，不同的子类型会有一些微小的差别 1) IBSS 1.1) Destination Address 1.2) Source Address 1.3) BSSID 每个BSS都会被赋予一个BSSID，它是一个长度为48个bit的二进制识别码，用来辨识不同的BSS 2) From AP 2.1) Destination Address 2.2) BSSID 2.3) Source Address 3) To AP 3.1) BSSID 3.2) Source Address 3.3) Destination Address 4) WDS 4.1) BSSID 4.2) Source Address 4.3) Destination Address4. Sequence Control(序列控制域): 用于过滤重复帧 1) MSDU(MAC Server Data Unit), 12位序列号(Sequence Number) 2) MMSDU(MAC Management Server Data Unit), 4位片段号(Fragment Number)组成[SA，只有WDS中的帧有这个字段]5. Frame Body(Data): 发送或接收的信息。6. FCS(CRC): 包括32位的循环冗余校验(CRC)，用于检错，注意是检错不是纠错 0x3: 控制帧协议格式(RTS帧，控制帧的一种) (CTS帧，控制帧的一种) (ACK帧，控制帧的一种) (PS-Poll帧)1234567891011121314151617181920212223242526272829303132333435363738394041424344454647481. 帧控制结构(Frame Control) 1) Protocol Version: (协议版本)通常为0 2) Type: 帧类型，控制帧: 01 3) Subtype: 进一步判断帧的子类型: 控制帧 3.1) 请求发送(Request To Send，RTS)数据包 3.2) 清除发送(Clear To Send，CTS)数据包 数据帧 3.3) ACK确认(RTS/CTS) 3.4) PS-Poll: 当一部移动工作站从省电模式中苏醒，便会发送一个 PS-Poll 帧给基站，以取得任何暂存帧 4) To DS: 表明该帧是BSS向DS发送的帧时，该值设置为1 5) From DS: 表明该帧是DS向BSS发送的帧时，该值设置为1 控制帧负责处理无线介质的访问，因此只能够由无线工作站产生。传输系统并不会收送控制帧，因此这两个Bit必然为0 6) More Fragment: 用于说明长帧被分段的情况，是否还有其它的帧，如果有则该值设置为1。 控制帧不可能被切割，这个Bit必然为0 7) Retry(重传域): 表示该分段是先前传输分段的重发帧。 控制帧不像管理或数据帧那样，必须在序列中等候重送，因此这个 Bit必然为0 8) Power Management: 表示传输帧以后，站所采用的电源管理模式 8.1) 为1: STA处于power_save模式 8.2) 为0: STA处于active模式 9) More Data: 表示有很多帧缓存到站中。即至少还有一个数据帧要发送给STA是设置为1。 More Data bit只用于管理数据帧，在控制帧中此Bit必然为0 10) Protected Frame: 表示根据WEP(Wired Equivalent Privacy)算法对帧主体进行加密。如果帧体部分包含被密钥套处理过的数据，则设置为1，否则设置为0。 控制帧不会经过加密。因此对控制帧而言，Protected Frame bit必然为0。 11) Order(序号域): 在长帧分段传送时，该域设置为1表示接受者应该严格按照顺序处理该帧，否则设置为0。 控制帧是基本帧交换程序(atomic frame exchange operation)的组成要件，因此必须依序发送。所以这个Bit必然为02. Duration/ID(持续时间/标识)表明该帧和它的确认帧将会占用信道多长时间，Duration 值用于网络分配向量(NAV)计算。注意: 在PS-Poll帧中不包含Duration/ID这个字段3. Address Fields(地址域): 这个域的具体格式和控制帧的子类型有关，不同的子类型会有一些微小的差别 3.1) RTS(请求发送帧) 3.1.1) Receiver Address(接收端地址) 接收大型帧的工作站的地址 3.1.2) Transmitter Address(发送端地址) RTS帧的发送端的地址 3.2) CTS(允许发送) 3.2.1) Receiver Address(接收端地址) 3.3) ACK(应答) 3.3.1) Receiver Address(接收端地址) 3.4) PS-Poll(省电模式一轮询) 3.4.1) AID(连接识别码 association ID) 连接识别码是接入点所指定的一个数值，用以区别各个连接。将此识别码置入帧，可让接入点找出为其(移动工作站)所暂存的帧 3.4.2) BSSID 此位包含发送端目前所在 BSS(AP)的BSSID ，此BSS 建立自目前所连接的AP 3.4.3) Transmitter Address(发送端地址) 此为PS-Poll帧之发送端的 MAC地址4. FCS(CRC): 包括32位的循环冗余校验(CRC)，用于检错，注意是检错不是纠错 [END] 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！ 参考链接802.11协议帧格式、Wi-Fi连接交互过程、无线破解入门研究","tags":[{"name":"无线网络","slug":"无线网络","permalink":"http://sniperkaka.com/tags/无线网络/"}]},{"title":"读书笔记-三体-黑暗森林","date":"2017-05-19T00:26:05.000Z","path":"2017/05/19/20170519-读书笔记-三体-黑暗森林/","text":"书名：三体-黑暗森林作者：刘慈欣 读后感0.文笔比第一部好不少，故事性强了很多。1.为了应对三体人的来袭，地球人推出了面壁计划，比较讽刺的是，本来是为了战争的胜利选出了几个人，给了他们很大的权利，本来计划本身只需要面壁者自己知道就可以了，但面壁委员会还非要面壁者定期汇报，虽然汇报本身可以是真话，也可以是假话，但假如面壁者的行为让委员会觉得无意义，就将会限制面壁者的权利和使用的资源，就跟当初的计划初衷产生了矛盾….又想面壁者成为制胜的关键，又想处处了解面壁者的思维….呵呵~~2.面壁者罗辑就像一个智者，看着全世界人民的愚昧….命运的无奈….世界对其充满了期待，又对其苛刻的要求，就跟王者荣耀里碰到了猪队友，讲道理又讲不通….简直憋屈3.丁仪嘛，中规中矩的，杨冬的男友。物理学家。最后明知可能会死，也要近距离观察智子。4.章北海，虽然军人出身，但感觉他是一个预言家、智者的存在。那种跨世纪的远见。令人拜服，可惜在星际地球诞生没多久就被队友搞死了。即使死前，也是看淡了一切。使命已经完成。5.罗辑，即使被全世界人民所抛弃，还是独自一个人与三体人达成了协议，怀着牺牲地球和三体星的觉悟，迫使三体人不再向地球行进。一个人拯救了所有人。6.愚蠢的人类，为了一点点蝇头小利而误了全局。为了一点点的低端文明的进步，就以为拥有了与高级文明抗衡的能力。在太空舰队被三体人一个探测器全歼的挫折下，又绝望又自暴自弃….人类的劣根性表现的真是淋漓尽致。自己以为掌控了全局，自负，自大。7.史强大兄弟很靠谱。褐蚁、罗辑、杨冬、叶文洁/猜疑链和技术爆炸/吴岳、章北海、白蓉/坎特/面壁计划、庄颜、丁仪“活着本身就很妙，如果连这道理都不懂，怎么去探索更深的东西呢？”“只是感觉天文专业是铁板一块，在哪儿钻个眼儿都不容易；而社会学之类的是木板，总能找些薄的地方钻透的，比较好混吧。”生活需要平滑，但也需要一个方向，不能总是回副起点.“所以你最后的成果就是纯理论的，就像欧氏几何一样，先设定几条简单的不证自明的公理，再在这些公理的基础上推导出整个理论体系。”“第一，生存是文明的第一需要；第二，文明不断增长和扩张，但宇宙中的物质总量保持不变” 字幕：“想”和“说”，我们刚刚惊奇地发现，它们原采不是同义词。伊文斯：“它们本来就不是同义词啊。”字幕：按我们的理解，它们应该是同义词：想，就是用思维器官进行思维活动；说，就是把思维的内容传达给同类。后者在你们的世界是通过被称为声带的器官对空气的振动波进行调制来实现的。 字幕：我们没有交流器官，我们的大脑可以把思维向外界显示出来，这样就实现了交流。伊文斯：“显示思维，怎样实现呢？”字幕：大脑思维发出电磁波，包括我们的可见光在内的各种波长，可以在相当远的距离上显示。 伊文斯：“你们的思维对外界是完全暴露的，不可能隐藏。”字幕：思维怎么能隐藏呢？你的想法太不可思议了。伊文斯：“就是说，你们的思维和记忆对外界是全透明的，像一本放在公共场合的书，或者说是在广场上放映的电影，或者像一个全透明鱼缸里的鱼，完全暴露，可以从外界一览无遗。哦，我上面说的一些元素您可能。。。”伊文斯(沉默良久)：“原来是这样…我的主，当你们面对面交流时，所交流的一切都是真实的，不可能欺骗，不可能撒谎，那你们就不可能进行复杂的战略思维。” 字幕：人类的交流嚣官不过是一种进化的缺陷而已，是对你们大脑无法产生强思维电波的一种不得已的补偿，是你们的一种生物学上的劣势，用思维的直接显示，当然是效率更高的高级交流方式。“技术公有化”运动受挫所产生的影响是深远的，它使人们认识到，即使在毁灭性的三体危机面前，人类大同仍是一个遥远的梦想。谁走谁留涉及到人类的基本价值观，这种价值观在过去的时代促进了人类社会的进步，但在这种终极灾难面前，它就是一个陷阱，到现在为止，甚至连人类自己的大多数，都没有意识到这个陷阱有多深。《浮城》一个场面：当整个城市就要沉到海里时，有一群人挨家挨户搜缴救生圈，集中起来毁掉，为的是既然不能都活那就谁也不要活。印象最深的是一个小女孩儿，把那些人领到一家门口，兴奋地说，他们家还有！“宇宙逃亡根本不可能实现，关键是谁走谁留啊，这不是一般的不平等，这是生存权的问题，不管是谁走，精英也好，富人也好，普通老百姓也好，只要是有人走有人留。那就意味着人类最基本的价值观和道德底线的崩溃！人权和平等观念已经深入人心，生存权的不公平是最大的不公平，被留下的人和国家绝不可能看着别人踏上生路而自己等死，两方的对抗会越来越极端。最后只能是世界大乱，谁也走不了！联合国的这个决议是很英明的…”当罗辑所乘的飞机飞越海岸时，在他一万米的下方，吴岳和章北海再次注视着建造中的“唐”号。在以前和以后所有的时间里，这是罗辑距这两位军人最近的一次。章北海把目光移向“唐”号，远处的焊花在他的眸中映出两团小小的火焰。讲审讯的几个基本技巧，你以后有可能用得着，到时知己知彼容易对付些。当然，只是最基本最常用的，复杂的一时也说不清。先说最文的一种，也是最简单的一种：拉单子，就是把与案子有关的问题列一个单子，单子上的问题越多越好，八竿子刚打着的全列上去，把关键要问的混在其中，然后一条一条地问，记下审讯对象的回答，然后再从头问一遍，也记下回答，必要时可以问很多遍，最后对照这几次的记录，如果对象说假话，那相应的问题每次的回答是有出入的你别看这办法简单，没有经过反侦查训练的人基本上都过不了关，对付拉单子，最可靠的办法就是保持沉默。这一招叫黑白脸。这种审讯需要多人配合，稍复杂一些。首先是黑脸出来，一般是两人以上。他们对你很凶，可能动文的也可能动武的，反正很凶。这也是有策略的，不仅仅是让你产生恐惧，更重要的是激发你的孤独感，让你感觉全世界除了想吃你的狼就再没别的了。这时白脸出来了，肯定只有一个人，而且肯定长得慈眉善目，他制止了黑脸们，说你也是一个人，有人的权利，你们怎么能这样对待他？黑脸们说你走开，不要影响工作。白脸坚持，说你们真的不能这样做！黑脸们说早就知道你干不了这个，干不了走人啊！白脸用身体护住你说：我要保护他的权利，保护法律的公正！黑脸们说你等着，明天你就滚蛋了！然后气哼哼地走了。就剩你们俩时，白脸会替你擦擦汗呀血呀的，说别怕，有我在，他们不敢把你怎么样。不管我落到什么下场，定会维护你的权利！你不想说就别说了，你有权沉默！接下来的事儿你就能想得出了，他这时成了你在这个世界上唯一的最亲的人，在他进一步的利诱下，你是不会沉默的…这一招对付知识分子最管用，但与前面拉单子不同，你一旦知道了，它就失效了。当然，以上讲的一般都不单独使用，真正的审讯是一个大工程，是多种技术的综合…”如果你的城府真够深，那就不能显示出任何城府来，和电影上看到的不同，真正老谋深算的人不是每天阴着脸装那副鸟样儿，他们压根儿就不显出用脑子的样儿来，看上去都挺随和挺单纯的，有人显得俗里俗气婆婆蚂妈，有人则大大咧咧没个正经…关键的关键是让别人别把你当回事，让他们看不起你轻视你，觉得你碍不了事，像墙角的扫把一样可有可无，最高的境界是让他们根本注意不到你，就当你不存在，直到他们死在你手里前的一刹那才回过味来。“她好像是一个提线木偶，每个动作和每一句话都来自于我的设想，缺少一种生命感。”白蓉说：“你的方法不对，你是在作文，不是在创造文学形象。要知道，一个文学人物十分钟的行为，可能是她十年的经历的反映。你不要局限于小说的情节，要去想象她的整个生命，而真正写成文字的只是冰山的一角。”于是罗辑照白蓉说的做了，完全抛开自己要写的内容，去想象她的整个人生，想象她人生中的每一个细节。他想象她在妈妈的怀中吃奶，小嘴使劲吮着，发出满意的晤晤声；想象雨中漫步的她突然收起了伞，享受着和雨丝接触的感觉；想象她追一个在地上滚的红色气球，仅追了一步就摔倒了，看着远去的气球哇哇大哭。完全没有意识到她刚才迈出的是人生的第一步；想象她上小学的第一天，孤独地坐在陌生教室的第三排，从门口和窗子都看不到爸爸妈妈了，就在她要哭出来时，发现邻桌是幼儿同的同学，高兴地叫起来；想象大学的第一个夜晚，她躺在宿舍的上铺，看着路灯投在天花板上的树影…罗辑想象出她爱吃的每一样东西，想象她的衣橱中每一件衣服的颜色和样式，想象她手机上的小饰物，想象她看的书她的MP4 中的音乐她上的网站她喜欢的电影，但从未想象过她用什么化妆品，她不需要化妆品…罗辑像一个时间之上的创造者，同时在她生命中的不同时空编织着她的人生。他渐渐对这种创造产生了兴趣，乐此不疲。 别说在哪里！一知道在哪儿，世界就变得像一张地图那么小了；不知道在哪儿，感觉世界才广阔呢。大部分人的爱情对象也只是存在于自己的想象之中。他们所爱的并不是现实中的她(他)，而只是想象中的她(他)，现室中的她(他)只是他们创造梦中情人的一个模板，他们迟早会发现梦中情人与模板之间的差异，如果适应这种差异他们就会走到一起，无法适应就分开，就这么简单。你与大多数人的区别在于：你不需要模板。面壁计划的核心，就是选定一批战略计划的制定者和领导者，他们完全依靠自已的思维制定战略计划，不与外界进行任何形式的交流，计划的真实战略思想、完成的步骤和最后目的都只藏在他们的大脑中，我们称他们为面壁者，这个古代东方冥思者的名称很好地反映了他们的工作特点。在领导这些战略计划执行的过程中，面壁者对外界所表现出来的思想和行为，应该是完全的假象，是经过精心策划的伪装、误导和欺骗，面壁者所要误导和欺骗的是包括敌方和己方在内的整个世界，最终建立起一个扑朔迷离的巨大的假象迷宫，使敌人在这个迷宫中丧失正确的判断，尽可能地推迟其判明我方真实战略意图的时间。为了保证面壁计划的连续性，所有面壁者将借助冬眠技术跨越时间，一直到达最后决战的时代，这期间，在何时和何种情况下苏醒，每次苏醒期有多长时间，均由面壁者自行决定。在以后的四个世纪的时间里，联合国面壁法案将作为一项与联合国宪章同等地位的国际法存在，它将与各国制定的相应法律一起，保证面壁者战略计划的执行。 “面壁者所承担的，将是人类历史上最艰难的使命，他们是真正的独行者，将对整个世界甚至整个宇宙，彻底关闭自己的心灵，他们所能倾述和交流的、他们在精神上唯一的依靠，只有他们自己。他们将肩负着这伟大的使命孤独地走过漫长的岁月.第一位面壁者：弗里德里克·泰勒。他是刚刚卸任的美国国防部长，是一个对美国国家战略产生深刻影响的人。他的思想集中体现在一本名叫《技术的真相》的著作中，泰勒认为，技术的最终受益者将是小国家。大国不遗余力发展技术，实际上是为小国通向世界霸权铺下基石。因为随着技术的发展，大国所拥有的人口和资源优势将不再重要，而技术对小国而言是一个可能撬动地球的杠杆。核技术的后果之一就是使一个人口只有几百万的小国有可能对一个人口过亿的大国产生实质性威胁，而在核技术出现之前，这几乎是不可能的。泰勒的一个重要论点是：大国的优势，其实只有在低技术时代才是真正的优势，技术的飞速发展最终将削弱大国的优势，同时提升小国的战略分量，有可能使得某些小周突然崛起，像当年的西班牙和葡萄牙那样取得世界霸权。第二位面壁者：曼努尔·雷迪亚兹。他领导自己的国家，对泰勒的小国崛起理论进行了完美的证实。作为乌戈，查韦斯的继承者，雷迪亚兹继续由前者在1999年开始的“波利瓦尔革命”，在资本主义和市场经济已成为王道的今日世界，在委内瑞拉推行查韦斯所称的“二十一世纪社会主义”，在吸取了上世纪国际社会主义运动经验教训的基础上，出人意料地取得了巨大的成功，使国家各个领域的实力迅速提升。一时间，委内瑞拉成了世界瞩目的象征着平等公正和繁荣的山巅之城，南美洲各个国家纷纷效仿。整个陆军被拆分成了以班为单位的游击小组，全部潜伏于民间，以杀伤敌军有生力量为唯一的作战目标。雷迪亚兹的基本作战思想建立在这样一个明确的理念之上：现代高技术武器主要是用于对付集中式的点状目标的，对于面积目标，它们的效能并不比传统武器高，加上造价和数量的限制，基本上难以发挥作用。共生产了二十万枚这样的巡航导弹装备那几千个游击小组。这些导弹使用的部件虽然都是市场上便宜的大路货，但五脏俱全，具备测高雷达和全球定位功能，在五公里的范围内命中精度不超过五米。在整个战争中虽然只有不到十分之一的导弹命中了目标，但也给敌人造成了巨大的杀伤。雷迪亚兹还在战争中大量使用其他一些可以大批量生产的高科技小玩意儿，如装有近炸引信的狙击步枪子弹等等，同样取得了辉煌的战绩。美军在委内瑞拉战争中的伤亡在短时间内就达到了越战的水平，只得以惨败退出。雷迪亚兹也因此成为二十一世纪以弱胜强的英雄。 第三位面壁者：比尔·希恩斯。希恩斯的人生分成泾渭分明的两个阶段。在作为科学家的阶段，他是历史上唯一一名因同一项发现同时获得两个不同学科诺贝尔奖提名的科学家。在他和脑科学家山杉惠子共同进行的研究中发现，大脑的思维和记忆活动是在量子层面上进行的，而不是如以前认为的那样是一种分子层面的活动。一种猜测中的大脑信息贮存方式。能通过大脑的任一局部恢复它所贮存的全部信息。希恩斯人生的第二阶段是作为政治家，曾任过一届欧盟主席，历时两年半。希恩斯是一名公认的稳重老练的政治家。 卢浮宫“听说，如果专业地欣赏，看完这里的所有东西要一年时间。”罗辑说。艰难时世开始了，历史的车轮经历了转向的颠簸之后，开始沿着新的轨道前进。 在巨变的世界中，不变的只有时间流逝的速度，恍惚间，五年过去了。 把你们绝望的人，你们迷茫的人，把你们渴望看到胜利之光的畏惧徘徊的人都给我把那些精神失落、是魂在流浪的人都送来：在这金色的信念旁，我要为他们把灯举起。自自士神像基座上的埃玛·拉扎的诗原文为：把你们疲惫的人，你们贫穷的人，你们渴望呼吸自由空气的挤在一堆的人都给我/把那些无家可归、饱经风浪的人都送来/在这金色的大门旁，我要为他们把灯举起。同苏醒室中一样，走廊中没有灯，亮光也是直接从墙壁发出的，虽然很柔和，还是让罗辑眯起了双眼。就在他眯眼的同时，这一段走廊的墙壁暗了下来，这黯淡的一段一直跟随着他的床移动。当他的眼睛适应光亮又睁大时，这移动的一段也随之亮了起来，但亮度一直保持在舒适的范围内。看来，走廊的光度调节系统能够监测他的瞳孔变化。从太阳系观测宇宙中另一颗恒星的卫星,就像从美国西海岸观察东海岸一盏台灯旁的一只蚊子,而三体舰队只有蚊子腿上的细菌那么大。面壁者罗辑就这样梦游般地走在荒诞的现实中，恍偬中丧失了一切理智的思维能力，不知自己从哪里来，更不知要到哪里去。不知不觉间，他走到了草坪上，来到一尊雕塑前，无意中扫了一眼，他看到那是一个男人正在用铁锤砸一柄剑，这是前苏联政府送给联合国的礼物，名叫铸剑为犁。罗辑发现，萨伊脸上的微笑很熟悉，这种微笑他在那个年轻的凶手脸上也见过，以后，他也将会在每一个面对他的人的脸上和目光中看到。这微笑后来被称为对面壁者的笑，它将与蒙娜丽莎的微笑和柴郡猫的露齿笑一样著名。他竟在这种时候想起了中学物理老师出过的一道思考题：如何用大理石做一张床，使人躺上去感觉像席梦思一样柔软，答案是把大理石表面挖出一个与人的身体背部一模一样形状的坑，躺到坑里，压强均匀分布，感觉就十分柔软了。于是，他把注意力转向自己因此拥有的权力，虽然如萨伊所说，他是四个面壁者中权力最小的一个，但他能够使用的资源肯定依然是相当惊人的。关键是，他在使用这些资源时无须对任何人做出解释，事实上，他职责中很重要的部分就是使自己的行为令人无法理解，而且，更进一步，还要努力使人产生尽可能多的误解。这是人类历史上从未有过的事，古代的专制帝王也许可以为所欲为，但最终还是要对自己的行为做出解释的。委员会对面壁者可能的质疑主要在以下两个方面：使用的资源数量超过了设定的范围，或对人类生命造成伤害。除此之外，任何质疑都是违反面壁计划基本精神的。秦始皇接着说：对于每一个面壁者，我们将指定一个破壁人。与面壁者一样，破壁人将有权调用组织内的一切资源，但你们最大的资源是智子，它们将面壁人的一举一动完全暴露在你们面前，唯一成为秘密的就是他们的思想。破壁人的任务，就是在智子的协助下，通过分析每一个面壁者公开和秘密的行为。尽快破解他们真实的战略意图。一名上校说，坚定的信念难道不是建立在科学和理性之上的吗？不以客观事实为基础建立的信念是不可能牢固的。那我们首先要重新审视科学和理性，要明白，这只是我们的科学和理性。三体文明的发展高度告诉我们，我们的科学只是海边拾贝的孩子，真理的大海可能还没有见到。所以，我们在自己的科学和理性指导下看到的事实未必是真正的客观事实，既然如此，我们就应该学会有选择地忽略它，我们应该看到事物在发展变化中，不能用技木决定论和机械唯物论把未来一步看死。工质型核聚变发动机与化学火箭类似，是核聚变的能量推动有质量的工质，产生反推力推进飞船；无工质型核聚变发动机则是用核聚变辐射能量直接推进飞船。前者需要飞船携带推进工质，当远程航行长时间加速或减速时，工质的需要量将非常巨大，因而工质型发动机不可能进行星际远航。房间里的那些画，大多是现代派风格的，但与这古典气息很浓的房间并无不协调之感。罗辑特别注意到这里一幅风景画都没有，这是很成熟的审美情调：这幢房子就坐落在绝美的伊甸园中，风景画挂在这里就像往大海中加一桶水那样多余。 “那你就违反了面壁计划原则：不管面壁者的指令多么不可理解，都要报请执行，最后否决是PDC的事儿。” “那也不能用人类社会的资源为这种人过帝王生活服务！史先生，我们共事不长，但我很佩服你，你是个很老练又很有洞察力的人，那你实话告诉我：你真的认为罗辑在执行面壁计划？” 史强摇摇头，“我不知道。”他抬手制止了坎特下面的争辩，“但，先生，只是我个人不知道，不是上级的看法。这就是你我之间最大的不同：我只是个命令的忠实执行者，而你呢，什么都要问个为什么。” “这不对吗？” “没什么不对的，如果每个人都要先弄清楚为什么再执行命令，那这世界早就乱套了。坎特先生，你的级别是比我高些，但说到底，我们都是执行命令的人，我们首先应该明白，有些事情不是由我们这样的人来考虑的，我们尽责任就行了，做不到这一点，你的日子恐怕很难过。” “我的日子已经很难过了！上次耗巨款买下沉船中的酒，我就想……你说，这人有一点儿面壁者的样子吗？” “面壁者应该是什么样子？” 坎特一时语塞。 “罗辑转头看了庄颜一眼，发现她也在看着自己，而且似乎已经看了好长时间，那眼神中略带好奇，但更多的是清纯的善意。林间的光束从她脸上和身旁一道一道地掠过，看到罗辑在看自己，她的目光并没有回避。”罗辑看着雪中的庄颜，在这纯洁雪白几乎失去立体感的空间中，世界为她隐去了，她是唯一的存在。两年前，当他创造的那个文学形象在想象中活起来的时候，罗辑体会到了爱情；而现在，就在这大自然画卷的空白处，他明白了爱的终极奥秘。“庄颜，你的工作就是：使自己幸福快乐。”走在遥远的过去中想象着灰暗的未来。 “那…我们先试着用表情表达一个简单的意思？” “嗯！”庄颜兴奋地点点头，“那这样，我们每人先想一个信息，然后互相表达？” 罗辑停顿了一下说：“我想好了。” 庄颜却想了更长的时间，然后也点点头，“那我们开始。” 他们开始互相凝视，只坚持了不到半分钟，就几乎同时大笑起来。 “我的信息是：今晚想请你去香榭里舍大街吃夜宵。”罗辑说。 庄颜也笑得直不起腰来：“我的信息：你…你该刮胡子了！” “关系到人类命运的大事，我们必须严肃起来。”罗辑忍住笑说。 “这次谁也不许先笑！”庄颜说，像一个重新确定游戏规则的燕子那样郑重。 在新一轮的绝望、恐慌和迷茫之后，人类真正进入了面对三体危机的生活。 艰难时世开始了，历史的车轮经历了转向的颠簸之后，开始沿着新的轨道前进。 在巨变的世界中，不变的只有时间流逝的速度，恍惚间，五年过去了。 科学研究是一个跳跃前进的过程，长时间的量变积累才能产生质变，理论和技术突破大都是集中突发的…母亲和孩子在一张大白纸上画画，罗辑则远远地站在一边入神地看着，就像在卢浮宫中，远远地看着他所爱的现在已成为母亲的少女一样。再走近些，泰勒从他的眼神中看到了无边的幸福，那幸福就像这夕阳的光芒般弥漫于伊甸园的雪山和湖泊之间….摩尔定律指集成电路芯片上所集成的电路的数目，每隔18个月就翻一翻.在第一次放单飞时，他也是这样看着离去的大地，突然发现自己喜欢蓝天要甚于海洋，现在，他更向往蓝天之上的太空了。他注定是一个向高处飞、向远方去的人。丁仪在安全带的束缚下抬起一只手指点着章北海：“研究可控核聚变就不能上太空？你怎么和那些人一个论调？我们的最终研究目标是宇宙飞船的发动机，现在在航天界掌握实权的，有很大比例是以前搞化学火箭发动机的人，可现在，照他们的意思，我们只应该老老实实在地面搞可控核聚变，对太空舰队的总体规划没有多少发言权。第一，生存是文明的第一需要；第二，文明不断增长和扩张，但宇宙中的物质总量保持不变。在距我们最近的恒星上，出现了高等智慧文明，但整个银河系，却是一片如此空旷的荒漠.关于外星文明的费米悖论：从理论上讲，人类能用100万年时间飞往银河系的各个星球，那么，外星人只要比人类早进化100万年，现在就应该来到地球了。这个悖论之所以具有说服力，是因为它是基于银河系的两个事实：一、银河系非常古老已有约100 亿年的年龄；二、银河系的直径只有大约10 万光年。所以，即使外星人只以光速的千分之一在太空中旅行，他们也只需要1亿年左右的时间就可横穿银河系——这十时间远远短于银河系的年龄。如果真存在外星人的话，按这个道理他们早该到达太阳系了。“向宇宙中的其他观察者标示一颗恒星的位置，远没有人们想象的那么简单，做个比喻吧：您乘飞机飞越撒哈拉沙漠时，下面沙漠中的一粒沙子冲您大声喊‘我在这儿’，而您也听到了这喊声，您能够在飞机上就此确定这粒沙的位置吗？银河系有近两千亿颗恒星，几乎就是一个恒星的沙漠了。” 罗辑点点头，似乎如释重负，“我明白了，这就对了。”“什么对了？”林格不解地问。罗辑没有回答，而是问道：“那么，以我们的技术水平。如何向宇宙问标示某颗恒星的位置呢？”“用可定位的甚高频电磁波，这种频率应该达到或超过可见光频率，以恒星级功率发出信息。简单地说，就是让这颗恒星闪烁，使其本身变成一座宇宙灯塔。”“这远超出了我们的技术能力啊。”“哦，对不起，我没注意到您这个前提。以人类目前的技术能力，向遥远宁宙显示一颗恒星的位置相当用难，办法倒是有一个，但解读这种位置信息所需要的技术水平远高于人类，甚至…我想，也高于三体文明。””请说说这个办法。”“恒星间的相对位置是一个重要信息，如果在银河系中指定一片体空间区域，其中包含的恒星数量足够多，大概有几十颗就够了吧，那么这些恒星在这片三维空间的相对排列在宇宙中几乎是独一无二的，像指纹一样。”“我有些明白了：如果把要指明的恒星与周围恒星的相对位置信息发送出去，接收者把它与星图进行对照，就确定了这颗恒星的位置。”“还有更难的呢，银河系与沙漠不同，它处在运动之中，恒星间的位置在不断地发生变化，位置信息接收越晚，这种位置变化产生的误差就越大，这就需要那个数据库具有预测银河系所有千亿颗恒星位置变化的能力，理论上没问题，但实际做起来，天啊…”罗伯特.黑格，美国加州大学洛杉矶分校的教授，是全世界最权威的陨石收藏家。从二十三岁起开始收集陨石，拥有的陨石成为世界上最大的私人陨石收藏。信念中心的大门前立着一座缩小比例精确复制的自由女神像，谁也说不清其用意，也许是想用“自由”冲淡“控制”的色彩，但最引人注意的是女神像基座上那首被篡改了的诗：把你们绝望的人，你们迷茫的人，把你们渴望看到胜利之光的畏惧徘徊的人都给我把那些精神失落、是魂在流浪的人都送来：在这金色的信念旁，我要为他们把灯举起。自自士神像基座上的埃玛·拉扎的诗原文为：把你们疲惫的人，你们贫穷的人，你们渴望呼吸自由空气的挤在一堆的人都给我/把那些无家可归、饱经风浪的人都送来/在这金色的大门旁，我要为他们把灯举起。恒星由于所带的行星的引力，在行星围绕其运行时产生微小的摆动，在望远镜的观测能力不能直接观察到太阳系外行星的条件下，常通观测恒星的这种周期摆动来间接推测测行星的存在。雷迪亚兹接着说：“这个系统的代号为‘摇篮’，意思是摇篮停止摇动婴儿就会醒。它不断地发出信号，水星上的氢弹系统不断地接收，信号一旦中断，系统将立刻引爆氢弹。一部美国电影，里面的一个男人就戴着个这玩意儿，它不停地发信号，但如果这人的心脏停止跳动，它的信号也就停止了；另一个人身上被装上了一枚无法拆除的炸弹，如果炸弹收不到信号就立刻爆炸，所以，这个倒霉鬼虽然不喜欢前面那个人，还是必须尽全力保护他…随着老人们的离去，渐渐远去的黄金海岸完全消失在历史的烟波之中。现在，人类文明的航船已经孤独地驶到了茫茫的大洋中，举目四望，只有无边无际的险恶波涛，谁也不知道，彼岸是不是真的存在。蒂莫西·利里。美国心理学家，主张用LSD致幻剂控制人类思想，进面达到灵魂的拯救，在上世纪中期有大批心理学界和文化界的追随者。“KILLER 第5.2版。”“一种计算机网络病毒，地球三体组织在危机一个世纪左右首次传播的，以后又有多次变种和升级。这是一种谋杀病毒，它首先识别目标的身份，有多种方式，包括通过每人体内的身份芯片。一旦发现和定位了目标，KILLER病毒就操纵一切可能的外部硬件进行谋杀，具体表现就是你们今天经历的，好像这世界上的所有东西都想杀你，所以当时有人把这东西叫现代魔咒。有一段时间KILLER软件甚至商业化了，从网络黑市买来后，只要输人目标的身份特征，把病毒放到网上，那这人就是逃脱一死，在社会上也很难生活下去。给岁月以文明，而不是给文明以岁月。给岁月以文明，给时光以生命。 “Men always remember love because of romance only”传说中万宝路的英文含义。男人永远只是因为爱情浪漫而铭记于心中子星的表面就几乎绝对光滑，中子星的原子都被压在一起，排列很整齐。中子星物质的比重相当于水的10的14次方倍. 物体的温度是分子振动引起的。强相互作用力是自然界所有力中最强的一种，强度是电磁力的一百倍，但只能在原子核内部的极度短距离上起作用，原子核的尺度与原子相差很大，如果原子是一个剧场大小，原子核只有核桃大，所以，原子的尺度远超过强相互作用力的范围，在原子间和分子间起作的主要是电磁力。 其实，章北海的思考是异常理智的，他清楚地球之所以如此适合人类生存，并不是巧合，更不是什么人择原理的作用，而是地球生物圈与自然环境长期相互作用的结果，这种结果，在其他遥远恒星的行星上不太可能完全重复，他飞向NH558J2的选择蕴涵了一种可能：可生存世界可能永远也找不到，新的人类文明将是永远在航行之中的星舰文明。次声波氢弹。一种太空核武器，用于打击对常规辐射有良好屏蔽的飞船目标，能够以空气中的次声波的频率连续发生多资核爆炸，每次都产生强烈的电磁辐射，电磁辐射与目标飞船的金属外壳相互作用，将电磁能量转化为飞船内部空气的声能，产生超强次声波，杀死飞船内部的一切宏观生命，但对于飞行的设施基本没有损坏。用隐形导弹发射，很难防御。由于次声波氢弹通过电磁脉冲产生杀伤，帮不需要直接命中目标，在距目标相当远的距离爆炸就能杀伤目标内部的人员。而对雷达隐形的导弹，只有接近目标时才能被包括可见光观测在内的其他探测手段发现。突然，警报声响彻飞船，如同来自黑暗太空的万鬼哭号，显示界面从半空中像雪片般疯狂地跳出，显示着已经突破“自然选择”号防御系统的来袭导弹的大量信息，但没有人来得及看了。从警报响起到来袭的次声波氢弹爆炸，只间隔了四秒钟。从“自然选择”号最后传回地球世界的影像看，章北海可能只用了一秒钟就明白了一切。他本以为自己在两个多世纪的艰难历程中已经心硬如铁，但没有发现心灵最深处隐藏着的那些东西，在做出最后决断前他曾犹豫过，曾经努力抑制住心灵的颤抖，正是心中这最后的柔软杀了他，也杀了“自然选择”号上的所有人，在长达一个月的黑暗对峙中，他只比对方慢了几秒钟。“终极规律”号并没有成为伊甸园最后的幸运儿.在追击舰队其他三艘战舰中，“蓝色空间”号做好了应对意外事变的准备，在受到攻击前，它的内部已被抽成真空，所有人员都穿上了航天服。由于真空条件下不可能产生次声波。所以没有任何人员伤亡，只是舰体在超强的电磁脉冲中受到了轻微损伤。当核弹的火球刚剐亮起时，“蓝色空间”号就开始了反击。首先使用反应速度最快的激光武器射击，“终极规律”号立刻被五束高能伽马射线激光击中，舰体被灼出了五个大洞，内部迅速被火焰吞没，并发生了局部爆炸，丧失了一切作战能力。“蓝色空间”更为猛烈的攻击接踵而至，在连续的核导弹和暴雨般的电磁动能弹攻击下，“终极规律”号发生了剧烈爆炸，其中人员无一生还。拉格朗日点。地球和月球的引力平衡点。不同生命性质的文明间需占有不同的资源，所以宇宙文明的资源分配可能分成相互平行的很多层次，从碳基生命、硅基生命直至恒星生命和电磁生命，所需的资源基本包括了宇宙间所有的物质形态，各层所涉及的资源大部分互不干扰，但也有重叠。如果你认为我是善意的，这并不是你感到安全的理由，因为按照第一条公理，善意文明并不能预先把别的文明也想成善意的，所以，你现在还不知道我是怎么认为你的，你不知道我认为你是善意还是恶意；进一步，即使你知道我把你也想象成善意的，我也知道你把我想象成善意的，但是我不知道你是怎么想我怎么想你怎么想我的，挺绕的是不是？这才是第三层，这个逻辑可以一直向前延伸，没完没了。在真正的宇宙文明中，不同种族之间的生物学差异可能达到门甚至界一级，文化上的差异更是不可想象，且相隔着无比遥远的距离，它们之间猜疑链几乎是坚不可摧的。(1)在生物学上，生物分头分为界、门、纲、目、科、属、种，阶层越是往下，彼些之间特征就越相似。地球人类的种族之间在生物学上的差异也就局限于种这一层级，如果考虑到非碳基生命的存在，外星种族的差异可能超越了界一级。 这就要引人第二个重要概念：技术爆炸。这个概念她也没来得及说明，但推测起来比猜疑链要容易得多。人类文明有五千年历史，地球生命史长达几十亿年，而现代技术是在三百年时间内发展起来的，从宇宙的时间尺度上看，这根本不是什么发展，是爆炸！技术飞跃的可能性是埋藏在每个文明内部的炸药，如果有内部或外部因素点燃了它，轰一下就炸开了！地球是三百年，但没有理由认为宇宙文明中人类是发展最快的，可能其他文明的技术爆炸更为迅猛。我比你弱小，在收到你的交流信息后得知了你的存在，我们之间的猜疑链就也建立了，这期间我随时都可能发生技术爆炸，一下子远远走在你的前面，变得比你强大。要知道在宇宙尺度上，几百年只是弹指一挥间，而我得知你的存在和从交流中得到的信息，根可能是技术爆炸最好的导火线。所以，即使我仅仅是婴儿文明或萌芽文明，对你来说也是充满危险的。史强说：“也不行，如果你比我强大，既然我能发现你，那你总有一天能搜寻到我，这样我们之间就又出现了猜疑链；如果你比我弱小，但随时可能发生技术爆炸，那就变成第一种情况了。总结起来，一、让你知道我的存在；二、让你存在下去，对我来说都是危险的，都违反第一条公理。”“宇宙就是一座黑暗森林，每个文明都是带枪的猎人，像幽灵般潜行于林间，轻轻拨开挡路的树枝，竭力不让脚步发出一点儿声音，连呼吸都小心翼翼…他必须小心，因为林中到处都有与他一样潜行的猎人。如果他发现了别的生命，不管是不是猎人，不管是天使还是魔鬼，不管是娇嫩的婴儿还是步履蹒跚的老人，也不管是天仙般的少女还是天神般的男神，能做的只有一件事：开枪消灭之？在这片森林中，他人就是地狱，就是永恒的威胁，任何暴露自己存在的生命都将很快被消灭。这就是宇宙文明的图景，这就是对费米悖论的解释。一个黑暗森林中的猎手，在凝神屏息的潜行中，突然看到前面一棵树被削下一块树皮，露出醒目的白木，在上面用所有猎手都能认出的字标示出森林中的一个位置。这猎手对这个位置会怎么想，肯定不会认为那里有别人为他准备的给养。在所有的其他可能性中，非常大的一种可能就是告诉大家那里有活着的、需要消灭的猎物。标示者的目的并不重要，重要的是黑暗森林的神经已经在生存死局中绷紧到极限，而最容易触动的就是那根最敏感的神经。假设林中有一百万个猎手(在银河系上千亿颗恒星中存在的文明数量可能千百倍于此)，可能有九十万个对这个标示不予理会；在剩下的十万个猎手中，可能有九万个对那个位置进行探测，证实其没有生物后也不予理会；那么在最后剩下的一万个猎手中，肯定有人会做出这样的选择：向那个位置开一枪试试，因为对技术发展到某种程度的文明来说，攻击可能比探测省力，也比探测安全，如果那个位置真的什么都没有，自己也没什么损失。现在，这个猎手出现了。黄道面.地球围绕太阳运行的平面。罗辑抬起左手，露出了戴在手腕上的手表大小的东西说：“这是一个生命体征监测仪，它通过一个发射器与一套摇篮系统联结。你们一定记得两个世纪前面壁者雷迪亚兹的事，那就一定知道摇篮系统是什么。这个监测仪所发出的信号通过摇篮系统的链路，到达雪地工程部署在太阳轨道上的三千六百一十四枚核弹。信号每秒钟发射一次，维持着这些核弹的非触发状态。如果我死去，摇篮系统的维持信号将消失，所有的核弹将被引爆，包裹核弹的油膜物质将在爆炸中形成围绕太阳的三千六百一十四团星际尘埃，从远方观察，在这些尘埃云团的遮挡下，太阳将在可见光和其他高频渡段发生闪烁。太阳轨道上所有核弹的位置都是经过精心布置的，使得太阳闪烁形成的信号发送出三张简单的图形，就像我两个世纪前发出的那三张图一样，每张上面有三十个点的排列，并标注其中一个点，它们可以组合成一个三维坐标图。但与那次不同的是，这次发送的，是三体世界与周围三十颗恒星的相对位置。太阳将变成银河系中的一座灯塔，把这咒语发送出去，当然，太阳系和地球的位置也会同时暴露。从银河系中的一点看，图形发射完成需要一年多的时间，但应该有很多技术发展到这样程度的文明，可以从多个方向同时观测太阳，那样的话，只需几天甚至几个小时，他们就能得到全部信息。”罗辑曾怀疑在尘埃云团形成后，智子可以在云团的间隙进行二维展开，也对太阳进行遮挡，进而干扰信息的发送，但他随后得知，智子在维展开后没有任何空间机动和定位能力，只能以行星的引力为骨架保持形状，如果在太空中展开，将很快在太阳风等因素的作用下失去平面形状折叠起来，这就是二级展开后的智子只能在包裹三体行星的情况下才能保持形状进行电路蚀刻的原因。“我有一个梦，也许有一天，灿烂的阳光能照进黑暗森林。”这时，这里的太阳却在落下去，现在只在远山上露出顶端的一点，像山顶上镶嵌着的一块光灿灿的宝石。孩子已经跑远，同草地一起沐浴在金色的晚霞之中。太阳快落下去了，你们的孩子居然不害怕？“当然不害怕，她知道明天太阳还会升起来的。”【END】 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-三体-地球往事","date":"2017-05-18T06:31:32.000Z","path":"2017/05/18/20170518-读书笔记-三体-地球往事/","text":"作者：刘慈欣书名：三体-地球往事 读后感书中的很多术语似懂非懂，沿着故事线一路看下去，感觉对三体文明的一次次迭代的描写挺不错，从一次文明到另一次文明的进步的描写挺受启发。感觉文笔一般吧，故事性不太强。某些故事线推进的有点生涩。 摘要科幻作家：王晋康、刘慈欣、何宏伟、韩松汪淼、史强、科学边界、常伟思、杨冬、丁仪、申玉菲、魏成、潘寒、乱纪元、恒纪元、周文王、伏羲、叶文洁、沙瑞山、红色联合、四二八兵团、红岸基地、叶哲泰、绍琳、白沐霖、叶文雪、红岸基地政委雷志成、红岸基地总工程师杨卫宁、天体物理学、ID：哥白尼、格里高利教皇、亚里士多德、伽利略，一个工匠式的思想家、统帅、伊萨克-牛顿、莱布尼茨、冯·诺伊曼（注：现代计算机技术的莫基者、维纳（注：控制论创始人）、凯撒、开普勒、赫谢尔、降临派、拯救派、伊文斯“她像一颗星星，总是那么遥远，照到我身上的光也总是冷的。”丁仪走到窗前看着夜空，像在寻找那颗已逝去的星辰。在刚过去的那一夜，那两颗台球一直占据着他长长的梦境，它在黑色的空间中无规则地乱飞，在黑色的背景一卜．黑球看不见，它只有在偶尔遮挡白球时才显示一下自己的存在。难道物质的本原真的是无规律吗?难道世界的稳定和秩序，只是宇宙某个角落短暂的动态平衡?只是混乱的湍流中一个短命的旋涡?“射手”假说：有一名神枪手，在一个靶子上每隔十厘米打一个洞。设想这个靶子的平面上生活着一种二维智能生物，它们中的科学家在对自己的宇宙进行观察后，发现了一个伟大的定律： “宇宙每隔十厘米，必然会有一个洞。”它们把这个神枪手一时兴起的随意行为，看成了自己宇宙中的铁律。“农场主假说”则有一层令人不安的恐怖色彩：一个农场里有一一群火鸡，农场主每天中午十一点来给它们喂食。火鸡中的一名科学家观察这个现象，一直观察了近一年都没有例外，于是它也发现了自己宇宙中的伟大定律：“每天上午十一点，就有食物降临。”它在感恩节早晨向火鸡们公布了这个定律，但这天上午十一点食物没有降临，农场主进来把它们都捉去杀了。“太阳不是大神，太阳是阳，黑夜是阴，世界是在阴阳平衡中运转的，这不在我们的控制之中，但可以预测。”周文王说着，抽出青铜剑，在火炬照到的地板上画出了一对大大的阴阳鱼，然后以令人目眩的速度在周围画出了六十四卦，看上去如同火光中时隐时现的大年轮。先出来的一队士兵高呼着：“浸泡！浸泡！”都奔向湖边一处形似谷仓的高大石砌建筑。在来的路上。汪淼不时在远处看到过这种建筑，周文王告诉他那是“干仓”，是存贮脱水人的大型仓库。士兵们打开干仓的石门，从中搬出一卷卷落满灰尘的皮卷，他们每人都抱着、夹着好几个皮卷，走向湖边，将那些皮卷扔进湖中。那些皮卷一遇到水，立刻舒展开来，一时间，湖面上漂浮着一片似乎是剪出来的薄薄的人影。每一张“人片”都在迅速吸水膨胀，渐渐地，湖面上的“人片”都变成了圆润的肉体，这肉体很快具有了生命的迹象，一个个挣扎着从齐腰深的湖水中站立起来他们睁大如梦初醒的眼睛看着这风和日丽的世界。“浸泡！”一个人高呼起来，立刻引来了一片欢呼声：“浸泡！浸泡！!”……这些人从湖中跑上岸，赤身裸体地奔向干仓，将更多的皮卷投入湖中，浸泡复活的人一群群从湖中跑出来，这一幕也发生在更远处的湖泊和池溏中，整个世界在复活。记得在大三的一次信息课中，教授挂出了两幅大图片，一幅是画面庞杂精细的《清明上河图》，另一幅是一张空旷的天空照片，空荡荡的蓝天上只有一缕似有似无的白云。教授问这两幅面中哪一幅所包含的信息量更大，答案是后者要比前者大一至两个数量级！《三体》正是这样，它的海量信息是隐藏在深处的，汪淼能感觉到，但说不清。他突然悟出。《三体》的不寻常在于，与其他的游戏相比，它的设计者是反其道而行之——一般游戏的设计者都是尽可能地增加显示的信息量，以产生真实感：但《三体》的设计者却是在极力压缩信息量，以隐藏某种巨大的真实，就像那张看似空旷的天空照片。吴健雄,她在实验室中首次证明了李政道和杨振宁关于弱相互作用中宇称不守恒的理论推测，推翻了宇称守恒定律。目前的宇宙起源理论认为，宇宙诞生于距今约一百四十亿年前的一次大爆炸，在诞生早期，宇宙温度极高，随后开始冷却，形成被称为微波背景辐射的‘余烬’。这种弥漫全宇宙的残留背景辐射。在厘米波段上是可以观测到的。她挥舞着战旗，挥动着自己燃烧的青春，敌人将在这火焰中化为灰烬，理想世界明天就会在她那沸腾的热血中诞生……她陶醉在这鲜红灿烂的梦幻中，直到被一颗步枪子弹洞穿了胸膛，十五岁少女的胸膛是那么柔嫩，那颗子弹穿过后基本上没有减速，在她身后的空中发出一声啾鸣。年轻的红卫兵同她的旗帜一起从楼顶落下，她那轻盈的身体落得甚至比旗帜还慢，仿佛小鸟眷恋着天空。在中国、任何超脱飞扬的思想都会砰然坠地的，现实的引力太沉重了。一个推论令她不寒而栗，陷入恐惧的深渊：也许，人类和邪恶的关系，就是大洋与漂浮其上的冰山的关系，他们其实是同一种物质组成的巨大水体，冰山之所以被醒目地认出来，只是由于其形态不同而已，而它实质上只不过是这整个巨大水体中极小的一部分⋯⋯人类真正的道德自觉是不可能的，就像他们不可能拔着自己的头发离开大地。要做到这一点，只有借助人类之外的力量。 这个想法最终决定了叶文洁的一生。左是方法问题，右是路线问题搞理论研究，容易在思想上犯错误。邪乎到家必有鬼但伪科学最怕另一种人，他们很难被骗：魔术师。事实上，大量的伪科学骗局，都是被魔术师揭穿的。比起科学界的书呆子来，你多年的警务和社会经验显然更有能力觉察这种大规模犯罪。巨日已从地平线上升起了一半，占据了半个天空，大地似乎正顺着一堵光辉灿烂的大墙缓缓下沉。汪淼可以清晰地看到太阳表面的细节，火焰的海洋上布满涌浪和旋涡，黑子如幽灵般沿着无规则的路线漂浮，日冕像金色的长袖懒洋洋地舒展着。四、对外星文明发送的信件第一稿【全文】收到以上信息的世界请注意。你们收到的信息，是地球上代表革命正义的国家发出的！这之前，你们可能已经收到了来自同样方向的信息，那是地球上的一个帝国主义超级大国发出的，这个国家与地球上的另一个超级大国争夺世界霸权，企图把人类历史拉向倒退。希望你们不要听信他们的谎言，站在正义的一方，站在革命的一方！【批示】已阅，狗屁不通！大字报在地上贴就行了，不要发到天上去，文革领导组今后不要介入红岸。这样重要的信件应郑重起草，最好成立一个专门小组，并在政治局会议上讨论通过。 “有时下夜班，仰望夜空，觉得群星就像发光的沙漠，我自己就是一个被丢弃在沙漠上的可怜孩子……我有那种感觉：地球生命真的是宇宙中偶然里的偶然，宇宙是个空荡荡的大宫殿，人类是这宫殿中唯一的一只小蚂蚁。这想法让我的后半辈子有一种很矛盾的心态：有时觉得生命真珍贵，一切都重如泰山；有时又觉得人是那么渺小，什么都不值一提。反正日子就在这种奇怪的感觉中一天天过去，不知不觉人就老了……”在大量观测和实验的基础上，进行严密的推论．建立起宇宙的模型，再返回实验和观测去检验它。汪淼走到长桌的另一端，让自己镇定了一下，说：“其实很简单：太阳的运行之所以没有规律，是因为我们的世界中有三颗太阳，它们在相互引力的作用下，做着无法预测的三体运动、当我们的行星围绕着其中的一颗太阳做稳定运行时，就是恒纪元；当另外一颗或两颗太阳运行到一定距离内，其引力会将行星从它围绕的太阳边夺走，使其在三颗太阳的引力范围内游移不定时，就是乱纪元；一段不确定的时间后，我们的行星再次被某一颗太阳捕获，暂时建立稳定的轨道，恒纪元就又开始了。这是一场宇宙橄榄球赛，运动员是三颗大阳，我们的世界就是球！”“这是我最引以为自豪的发现：太阳是由深厚但稀薄的气态外层和致密灼热的内核构成的。”“很对，但你显然没有发现太阳的气态外层与我们行星大气层间奇特的光学作用。这是一种类似于偏振的现象，使得在太阳超出一定的距离时，从我们的大气层里观察，大阳的气态外层突然变得透明不可见，只能看到它的发光内核，这时，太阳在我们的视野中就突然缩到内核大小，变成了飞星。正是这个现象，迷惑了历史上各个文明的研究者。使他们没有意识到三个太阳的存在。现在你们明白了，为什么三颗飞星的出现预示着漫长的严寒，因为这时三颗太阳都在远方。”那位长老收留我住下，我对他说，想找个清静省心的方式混完这辈子算了。长老说，这里并不清静，是旅游区，进香的人也很多；大隐隐于市，要清静省心，自己就得空。长老摇摇头：空不是无，空是一种存在，你得用空这种存在填满自己。我第一次享受到了数学的乐趣，三体问题（注：三个质量相同或相近的物体在相互引力的作用下如何运动的问题，是古典物理学的经典问题，对天体运动研究有重要意义，自十六世纪以来一直受到关注。瑞士数学家欧拉、法国数学家拉格朗日，以及近年来一些借助于计算机研究的学者，都找出了三体问题的某些特解。）的物理原理很单纯，其实是一个数学问题。这时，我就像一个半生寻花问柳的放荡者突然感受到了爱情。你听说过‘蒙特卡洛法’吗？哦，那是一种计算不规则图形面积的计算机程序算法，具体做法是在软件中用大量的小球随机击打那块不规则图形，被击中的地方不再重复打击，这样，达到一定的数量后，图形的所有部分就会都被击中一次，这时统计图形区域内小球的数量，就得到了图形的面积，当然，球越小结果越精确。三体问题的真正解决，是建立这样一种数学模型，使得三体在任何一个时间断面的初始运动矢量已知时，能够精确预测三体系统以后的所有运动状态。复杂的宇宙万物其实是由最简单的单元构成的。“《三体》仅仅是个游戏吗？” 潘寒站起来，郑重地说：“三体世界是真实存在的。” 潘寒摇摇头：“不知道，真的不知道。每一轮文明中，三体人的外形都完全不同，另外，游戏中还反映了一个三体世界中的真实存在：人列计算机。” “哈，我觉得那是最不真实的！IT副总裁说，“我用公司的上百名员工进行过一个简单的测试，即使这想法真能实现，人列计算机的运算速度可能比一个人的手工计算都慢。” 潘寒露出神秘的笑容说：“不错，但假如构成计算机的三千万个士兵，每个人在一秒钟内可以挥动黑白小旗十万次，总线上的轻骑兵的奔跑速度是几倍音速甚至更快，结果就不一样了。你们刚才问过三体人的外形，据一些迹象推测，构成人列计算机的三体人，外表可能覆盖着一层全反射镜面，这种镜面可能是为了在恶劣的日照条件下生存而进化出来的，镜面可以变化出各种形状，他们之间就通过镜面聚焦的光线来交流，这种光线语言信息传输的速度是很快的，这就是人列计算机得以存在的基础。当然，这仍是一台效率很低的机器，但确实能够完成人类手工力不能及的运算。计算机在三体世界首先确实是以人列形式出现，然后才是机械式和电子式的。” 法国天文学家洛希证明，任何坚固的天体，在接近另一个比它大得多的天体的时候，都会受到强大的潮汐力作用而最终被扯成碎片。这个较小的天体会被拉碎的距离称为洛希极限．通常是大天体赤道半径的2.44倍。其实．与地球相比．太阳是一个更简单的物理系统．只是由氢和氦这两种很简单的元素构成．它的物理过程虽然剧烈，但十分单纯．只是氢至氦的聚变，所以．有可能建立一个数学模型来对太阳进行较为准确的描述。地球三体叛军并非铁板一块，它的内部有着复杂的派别和分支，主要分为两部分： ＊降临派：这是三体叛军最本原最纯粹的一脉，主要由伊文斯物种共产主义的信奉者组成。他们对人类本性都已彻底绝望，这种绝望最初来源于现代文明导致的地球物种大灭绝，伊文斯就是其典型代表。拯救派：这是在三体叛军出现相当长的时间后才产生的一个派别，它本质上是一个宗教团体，由三体教的教徒组成。降临派和拯救派一直处于尖锐的对立状态，降临派认为，拯救派是对地球三体运动重大的威胁。这种看法也不是没有道理，正是通过拯救派中一些有责任心的人士，各国政府才逐渐得知三体叛军令人震惊的背景。随着三体运动的发展，三体叛军中出现了第三个派别：幸存派。当人侵太阳系的外星舰队的存在被确切证实后，在那场终极战争中幸存下来是人们最自然的愿望。巴拿马尺型船（注：为通过巴拿马运河的三十二米宽船闸，相当一部分大型海轮被设计成三十一米宽，称为巴拿马尺型）巴拿马运河的主要人工开挖部分，河道狭窄。盖拉德 （注：设计建设巴拿马运河的工程师，盖拉德水造就是以他的名字命名）“元首，这种情绪主要是由最近来自地球的新信息引起的。您的预测实现了，地球上的异己力量果然在发展，他们建立了一个完全由自己控制的发射基地开始源源不断地向我们发送大量地球文明的信息。我得承认，地球文明在三体世界是很有杀伤力的，对我们的人民来说，那是来自天堂的圣乐。地铁人的人文思想会使很多三体人走上精神歧途，三体文明在地球已经成为一种宗教，而地球文明在三体世界也有这个可能。”汪淼和丁仪这才发现，田野被厚厚的一层蝗虫覆盖了，每根麦秆上都爬满了好几只，地面上，更多的蝗虫在蠕动着，看去像是一种粘稠的液体。“我只想请二位想一个问题：是地球人与三体人的技术水平差距大呢，还是蝗虫与咱们人的技术水平差距大？”这个问题像一瓶冷水泼在两名醉汉科学家头上，他们盯着面前成堆的蝗虫，表情渐渐凝重起来，两人很快就明白了大史的意思。 看看吧，这就是虫子，它们的技术与我们的差距，远大于我们与三体文明的差距。人类竭尽全力消灭它们，用尽各种毒剂，用飞机喷洒，引进和培养它们的天敌，搜寻并毁掉它们的卵，用基因改造使它们绝育；用火烧它们，用水淹它们，每个家庭都有对付它们的灭害灵，每个办公桌下都有像苍蝇拍这种击杀它们的武器……这场漫长的战争伴随着整个人类文明，现在仍然胜负未定，虫子并没有被灭绝，它们照样傲行于天地之间，它们的数量也并不比人类出现前少。把人类看作虫子的三体人似乎忘记了一个事实；虫子从来就没有被真正战胜过。太阳被一小片黑云遮住了，在大地上投下一团移动的阴影。这不是普遍的云，是刚刚到来的一大群蝗虫，它们很快开始在附近的田野上降落，三个人沐浴在生命的暴雨之中，感受着地球生命的尊严。丁仪和江森把手中拎着的两瓶酒徐徐洒到脚下的华北平原上，这是敬虫子的。 “你为什么这么做？”元首问站在他面前的1379号监听员。“为了不虚度一生。”监听员冷静地回答。 “你发出的警告信息，很可能使三体文明失去一次生存的机会。” “但给了地球文明这样的机会。元首，请允许我讲这么一件事：大约在一万个三体时前的乱纪元中，监听站的巡回供给车把我所在的1379号站漏掉了，这就意味着我在之后的一百个三体时中断粮了。我吃掉了站中所有可以吃的东西，甚至自己的衣服，即使这样，在供给车再度到来时，我还是快要饿死了。上级因此给了我一生中最长的一次休假，在我随着供给车回城市的途中，我一直被一个强烈的欲望控制着，那就是占有车上所有的食物。每看到车上的其他人吃东西，我的心中就充满了憎很，真想杀掉那人！我不停地偷车上的食品，把它们藏在衣服里和座位下，车上的工作人员觉得我这样很有意思，就把食品当礼物送给我。当我到城市下车时，背着远远超过我自身体重的食物…… “当然，后来我从这种精神变态中恢复了，但那种强烈的占有欲望给我留下极深的印象。三体文明也是一个处于生存危机中的群体，它对生存空间的占有欲与我当时对食物的欲望一样强烈而无止境。它根本不可能与地球人一起分享那个世界，只能毫不犹豫地毁灭地球文明，完全占有那个行星系的生存空间……我想得对吗？” “对，消灭地球文明还有另外一个理由：他们也是好战的种族，很危险。当我们与其共存于一个世界时，他们在技术上将学得很快，这样下去，两个文明都过不好。我们已经确定的政策是：三体舰队占领太阳系和地球后，不会对地球文明进行大多干涉，地球人完全可以像以前那样生活，就像三体占领者不存在一样，只有一件事是被永远禁止的：生育。现在我要问：你想当地球的救世主，对自己的文明却没有一点责任感？” 如果存在外星文明，那么宇宙中有共同的道德准则吗？我认为零道德的文明宇宙完全可能存在，有道德的人类文明如何在这样一个宇宙中生存？这就是我写《地球往事》的初衷。设想中《地球往事》的下一部暂名为《黑暗森林》，取自八十年代流行过的一句话：“城市就是森林，每一个男人都是猎手，每一个女人都是陷阱。”【END】","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-第一行代码-01-第一行Android代码","date":"2017-05-17T02:36:00.000Z","path":"2017/05/17/20170517-读书笔记-第一行代码-01-第一行Android代码/","text":"本书基于Android 7.0,Android studio 2.2本人的环境是Android studio 2.3.1 本书配套源码链接 第一章 开始启程-你的第一行Android代码Android系统架构Android 大致可以分为四层架构：linux内核层、系统运行库层、应用框架层和应用层。 Linux内核层Android系统是基于linux内核的，这一层为Android设备的各种硬件提供了底层的驱动，如显示驱动、音频驱动、照相机驱动、蓝牙驱动、wifi驱动、电源驱动等。 系统运行库层这一层通过一些c/c++库来为Android系统提供主要的特性支持，如SQLite库提供了数据库的支持，Opengl|es库提供了3D绘图的支持，webkit库提供了浏览器内核的支持等。还有运行时库，主要提供一些核心库，允许开发者使用java编写Android应用。运行时库还包含了Dalvik虚拟机（5.0系统后改为ART运行环境），太( ⊙ o ⊙ )使得每一个Android应用都能运行在独立的进程中，并且拥有一个自己的Dalvik虚拟机实例。Dalvik是专门为移动设备定制的，针对手机内存、CPU性能有限等情况做了优化处理。 应用框架层主要提供了构建应用程序时可能用到的各种API。 应用层所有安装在手机上的应用程序都属于这一层，比如系统自带的联系人、短信等程序，或从google play上下载的小游戏等。 Android系统架构 Android系统提供供开发应用程序的内容 四大组件：活动（activity）、服务（service）、广播接收器（broadcast receiver）、内容提供器（content provider）。活动：所有在应用中看得到的东西，都是放在活动中的。服务：后台运行，即使用户退出了应用，服务仍可继续运行。广播接收器：允许应用接收来自各处的广播消息，比如电话，短信等，应用也可以向外发出广播消息。内容提供器：为程序间共享数据，比如要读取系统电话薄中的联系人，就需要通过内容提供器来实现。 系统控件 SQLite数据库一种轻量级嵌入式关系型数据库，支持标准SQL语法。 多媒体如音乐、视频、录音、拍照、闹铃等，都可以通过代码来控制 地理位置定位 环境搭建参考之前的blog 创建第一个应用程序参考之前的blogApplication name表示应用名称，安装后在手机上显示的名称。Company Domain表示公司域名。Package name表示项目的包名，Android系统就是通过包名来区分不同应用程序，因此包名一定要具有唯一性。 Project目录结构 .grade和.idea这两个目录是Android studio 自动生成的一些文件，不需要关心。 app项目中的代码、资源等基本放置在这个目录下。 build主要包含一些编译时自动生成的文件，不需要关心。 gradle包含gradle wrapper的配置文件。Android studio默认没有启用gradle wrapper的方式，如果需要打开，点击file-&gt;setting-&gt;build-&gt;execution,deployment-&gt;gradle，进行配置更改。 .gitignore用来指定的目录或文件排除在版本控制之外。 build.gradle项目全局的gradle构建脚本，通常这个文件的内容不需要修改。 gradle.properties全局的gradle配置文件，里面的属性会影响到项目中所有的gradle编译脚本。 gradlew和gradlew.bat用来在命令行界面执行gradle命令，gradlew是linux或mac系统使用，gradlew.bat是windows系统使用。 MyApplication.imliml文件是所有IntelliJ IDEA项目都会自动生成的一个文件（Android studio是基于IntelliJ IDEA开发的），用于标识这是一个IntelliJ IDEA项目，不需要关心。 local.properties用于指定本机中的Android sdk路径，通常是自动生成的，一般不需要改动。 setting.gradle用于指定项目中所有引入的模块，通常情况下模块的引入都是自动完成的。默认创建的项目中只有一个app模块。 app目录 build包含一些在编译时自动生成的文件，不需要关心。 libs第三方jar包如果放在这个目录下都会被自动添加到构建路径里去。 src/androidTest用来编写AndroidTest测试用例的，可以对项目进行一些自动化测试。 src/main/java放置所有java代码的地方。比如之前创建的HelloWorldActivity.java文件。 src/main/res项目中所用到的图片、布局、字符串等资源都在这个目录下。比如图片在drawable目录下，布局放在layout目录下，字符串在values目录下。 AndroidManifest.xml整个Android项目的配置文件，程序中定义的所有四大组件都需要在这个文件里注册，还可以在这个文件中给应用程序添加权限声明。 src/test用来编写unit test测试用例的，是对项目进行自动化测试的另一种方式。 .gitignore用于将app模块内的指定的目录或文件排除在版本控制之外，作用和外层的.gitignore文件类似。 app.imlIntelliJ IDEA项目自动生成的文件，不需要关心。 build.gradleapp模块的gradle构建脚本，会指定很多项目构建相关的配置。 proguard-rules.pro用于指定项目代码的混淆规则，代码开发完成后打包安装文件，如果不希望代码被破解，通常会将代码进行混淆。 分析HelloWorld项目如何运行起来的AndroidManifest.xml中123456&lt;activity android:name=&quot;.HelloWorldActivity&quot;&gt; &lt;intent-filter&gt; &lt;action android:name=&quot;android.intent.action.MAIN&quot; /&gt; &lt;category android:name=&quot;android.intent.category.LAUNCHER&quot; /&gt; &lt;/intent-filter&gt;&lt;/activity&gt; 这段代码表示对HelloWorldActivity活动进行注册，没有在AndroidManifest.xml里注册的活动是不能使用的。12&lt;action android:name=&quot;android.intent.action.MAIN&quot; /&gt;&lt;category android:name=&quot;android.intent.category.LAUNCHER&quot; /&gt; 这两行表示HelloWorldActivity是这个项目的主活动，在手机上点应用图标，首先启动的就是这个活动。HelloWorldActivity中1234567public class HelloWorldActivity extends AppCompatActivity &#123; @Override protected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.hello_world_layout); &#125;&#125; HelloWorldActivity继承自AppCompatActivity，这是一种向下兼容的Activity。Activity是Android系统提供的一个活动基类，我们项目中所有的活动都必须继承它或者它的子类才能拥有活动的特性（AppCompatActivity是Activity的子类）。HelloWorldActivity中onCreate方法，是一个活动被创建时必定要执行的方法。Android程序的设计讲究逻辑和视图分离，不推荐在活动中直接写界面，更通用的做法是，在布局文件中编写界面，然后在活动中引入进来。setContentView方法就是给当前的活动引入一个hello_world_layout布局。res/layout/hello_world_layout.xml123456789101112131415161718&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;android.support.constraint.ConstraintLayout xmlns:android=&quot;http://schemas.android.com/apk/res/android&quot; xmlns:app=&quot;http://schemas.android.com/apk/res-auto&quot; xmlns:tools=&quot;http://schemas.android.com/tools&quot; android:layout_width=&quot;match_parent&quot; android:layout_height=&quot;match_parent&quot; tools:context=&quot;com.sniperkaka.helloworld.HelloWorldActivity&quot;&gt; &lt;TextView android:layout_width=&quot;wrap_content&quot; android:layout_height=&quot;wrap_content&quot; android:text=&quot;Hello World!&quot; app:layout_constraintBottom_toBottomOf=&quot;parent&quot; app:layout_constraintLeft_toLeftOf=&quot;parent&quot; app:layout_constraintRight_toRightOf=&quot;parent&quot; app:layout_constraintTop_toTopOf=&quot;parent&quot; /&gt;&lt;/android.support.constraint.ConstraintLayout&gt; TextView是Android系统提供的一个控件，用于在布局中显示文字的。Hello World！就是通过android:text=”Hello World!”这句定义的。 项目中的资源res目录下的结构 以drawable开头的文件夹都是用来放图片的，为了兼容各种设备，必要时可能需要自己创建drawable-hdpi/drawable-xhdpi/drawable-xxhdpi等文件夹。制作程序时最好给同一张图片提供几个不同分辨率的版本，分别放在这些文件夹下，程序运行时，会自动根据当前运行设备分辨率的高低选择加载哪个文件夹下的图片。 以mipmap开头的文件夹都是用来放应用图标的，以mipmap开头的文件夹比较多，是为了让程序兼容各种设备 以values开头的文件夹都是用来放字符串、样式、颜色等配置的 layout文件夹是用来放布局文件的 res/values/strings.xml123&lt;resources&gt; &lt;string name=&quot;app_name&quot;&gt;HelloWorld&lt;/string&gt;&lt;/resources&gt; 定义的字符串有两种方式来引用它： 在代码中通过R.string.hello_world可以获得该字符串的引用。 在xml中通过@string/hello_world可以获得该字符串的引用。 AndroidManifest.xml中12345678&lt;application android:allowBackup=&quot;true&quot; android:icon=&quot;@mipmap/ic_launcher&quot; android:label=&quot;@string/app_name&quot; android:roundIcon=&quot;@mipmap/ic_launcher_round&quot; android:supportsRtl=&quot;true&quot; android:theme=&quot;@style/AppTheme&quot;&gt;&lt;/application&gt; HelloWorld项目的应用图标就是通过android:icon属性来指定的，应用的名称则是通过android:label属性指定的。 build.gradle文件Android Studio是采用Gradle来构建项目的。Gradle使用了一种基于Groovy的领域特定语言（DSL）来声明项目设置，摒弃了传统基于XML（如Ant和Maven）的各种繁琐配置。HelloWorld项目中有两个build.gradle文件，一个在最外层目录下，一个在app目录下。 最外层的build.gradle文件123456789101112131415161718192021buildscript &#123; repositories &#123; jcenter() &#125; dependencies &#123; classpath 'com.android.tools.build:gradle:2.3.1' // NOTE: Do not place your application dependencies here; they belong // in the individual module build.gradle files &#125;&#125;allprojects &#123; repositories &#123; jcenter() &#125;&#125;task clean(type: Delete) &#123; delete rootProject.buildDir&#125; 以上代码是自动生成的。两处repositories的闭包中都声明了jcenter()这行配置，它是一个代码托管仓库，现在很多Android开源项目都会选择将代码托管到jcenter上，声明这行配置后，就可以在项目中轻松引用任何jcenter上的开源项目。dependencies闭包中使用classpath声明了一个Gradle插件，因为Gradle并不是专门为构建Android项目而开发的，Java、c++等很多种项目都可以使用Gradle来构建，因此如果我们想使用它来构建Android项目，则需要声明com.android.tools.build:gradle:2.3.1这个插件，其中最后部分是插件的版本号。除非想添加一些全局的项目构建配置，通常情况不需要修改这个文件的内容。 app目录下build.gradle文件123456789101112131415161718192021222324252627282930apply plugin: &apos;com.android.application&apos;android &#123; compileSdkVersion 25 buildToolsVersion &quot;25.0.2&quot; defaultConfig &#123; applicationId &quot;com.sniperkaka.helloworld&quot; minSdkVersion 15 targetSdkVersion 25 versionCode 1 versionName &quot;1.0&quot; testInstrumentationRunner &quot;android.support.test.runner.AndroidJUnitRunner&quot; &#125; buildTypes &#123; release &#123; minifyEnabled false proguardFiles getDefaultProguardFile(&apos;proguard-android.txt&apos;), &apos;proguard-rules.pro&apos; &#125; &#125;&#125;dependencies &#123; compile fileTree(dir: &apos;libs&apos;, include: [&apos;*.jar&apos;]) androidTestCompile(&apos;com.android.support.test.espresso:espresso-core:2.2.2&apos;, &#123; exclude group: &apos;com.android.support&apos;, module: &apos;support-annotations&apos; &#125;) compile &apos;com.android.support:appcompat-v7:25.3.1&apos; compile &apos;com.android.support.constraint:constraint-layout:1.0.2&apos; testCompile &apos;junit:junit:4.12&apos;&#125; 第一行应用了一个插件，一般有两种值可选：com.android.application表示这是一个应用程序模块com.android.library表示这是一个库模块应用程序模块和库模块的最大区别在于，一个是可以直接运行的，一个只能作为代码库依附于别的应用程序模块来运行。android闭包 这个闭包中可以配置项目构建的各种属性。 compileSdkVersion用于指定项目的编译版本。buildToolsVersion用于指定项目构建工具的版本。 android闭包中又嵌套了一个defaultConfig闭包，defaultConfig闭包中对项目更多细节进行配置。 applicationID 用于指定项目的包名。创建工程时指定过一次包名，如果想在后面对其修改，可以在这里修改。minSdkVersion 用于指定项目最低兼容的Android系统版本，15表示最低兼容到Android 4.0系统。targetSdkVersion 指定的值表示在该目标版本已经作了充分的测试，系统会为应用程序启动一些最新的功能和特性。比如Android 6.0系统中引入了运行时权限这个功能，如果将targetSdkVersion指定成22，说明程序最高只在Android 5.1上做过充分测试，Android 6.0系统中引入的新功能自然就不会启用。versionCode 项目版本号versionName 项目的版本名buildTypes闭包 用于指定生成安装文件的相关配置，通常只会有两个子闭包，一个是debug，一个是release。debug闭包用于指定生成测试版安装文件的配置。release闭包用于指定生成正式版安装文件的配置。debug闭包可以忽略不写。release闭包中：minifyEnabled 用于指定是否对项目的代码进行混淆。proguardFiles 用于指定混淆时使用的规则文件，这里指定了两个文件，proguard-android.txt是在Android sdk目录下的，里面是所有项目通用的混淆规则，proguard-rules.pro是在当前项目根目录下，可以编写当前项目特有的混淆规则。通过Android studio直接运行项目生成的都是测试版安装文件。 dependencies闭包。这个闭包功能强大，可以指定当前项目所有的依赖关系。 通常Android studio项目有三种依赖方式：本地依赖、库依赖、远程依赖。本地依赖可以对本地的jar包或目录添加依赖关系。库依赖可以对项目中的库模块添加依赖关系。远程依赖可以对jcenter库上的开源项目添加依赖关系。 compile fileTree 一个本地依赖声明，表示将libs目录下的所有.jar后缀的文件都添加到项目的构建路径中。compile是远程依赖声明，com.android.support:appcompat-v7:25.3.1就是一个标准的远程依赖库格式，其中com.android.support是域名部分，用于和其他公司的库做区分；appcompat-v7是组名称，用于和同一公司中不同的库做区分；25.3.1是版本号，用于和同一个库不同的版本区分。加上这句声明后，Gradle在构建项目时会首先检查一下本地是否已经有这个库的缓存，如果没有就会自动联网下载，然后再添加到项目的构建路径当中。testCompile用于声明测试用例库，暂时用不到。 Android日志工具Log日志工具类是LOG （android.util.Log），提供五个方法：Log.v()用于打印最为琐碎、意义最小的日志信息，对应最低级别verbose。Log.d()用于打印调试信息。对应级别debugLog.i()用于打印一些比较重要的数据，可以帮你分析用户行为数据。对应级别infoLog.w()用于打印一些警告信息。对应级别warnLog.e()用于打印程序中的错误信息，比如程序进入到了catch语句中。对应级别error 实践在HelloWorldActivity中，onCreate内添加一条打印语句：1234567891011121314package com.sniperkaka.helloworld;import android.support.v7.app.AppCompatActivity;import android.os.Bundle;import android.util.Log;public class HelloWorldActivity extends AppCompatActivity &#123; @Override protected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.hello_world_layout); Log.d(&quot;HelloWorldActivity&quot;, &quot;onCreate execute&quot;); &#125;&#125; 第一个参数是tag，一般传入当前类名就可以，第二个参数是msg，想要打印的具体内容。日志内容、tag名、程序包名、打印时间、应用程序进程号都可以看到。 不用System.out.println()方法的原因是日志打印不可控制、打印时间无法确定、不能添加过滤器、日志没有级别区分… 快捷输入log语句方法：输入logd，然后按tab或enter键就可以补全语句。输入logw，然后按tab或enter键就可以补全warn级别的日志。 【END】 近来经济拮据，如本文对阁下有帮助，可慷慨解囊赞助笔者以输出更多好文章。感谢！","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"学习笔记-谷歌android培训指南-04-支持不同的设备","date":"2017-05-16T08:40:23.000Z","path":"2017/05/16/20170516-学习笔记-谷歌android培训指南-04-支持不同的设备/","text":"学习笔记-谷歌android培训指南-04-支持不同的设备在任何情况下，从应用代码中提取 UI 字符串并将其存放在外部文件中都是个好办法。Android 在每个 Android 项目中都提供一个资源目录，从而简化了这一过程。 res/ 目录中包含用于存放各类资源的子目录。此外，还包含几个默认文件（如 res/values/strings.xml），用于存放字符串值。 创建语言区域目录和字符串文件如需添加对更多语言的支持，需要在res下额外创建values res目录，并在目录名称末尾加上连字符和 ISO 语言代码。例如，values-es/ 目录包含的简单资源用于语言代码为“es”的语言区域。Android 根据运行时设备的语言区域设置加载相应的资源。更详细的信息参考这儿 一旦决定了为哪些语言提供支持，便可创建资源子目录和字符串资源文件。 例如：将各个语言区域的字符串值添加到相应文件中。 具体操作是：切换到project模式，app-&gt;src-&gt;main-&gt;res路径下，增加两个目录values-es/values-fr（这两个目录与values同级）然后在这两个目录下分别添加strings.xml文件。如下图 在运行时，Android 系统会根据当前为用户设备设置的语言区域使用相应的字符串资源集。例如，以下是一些面向不同语言的不同字符串资源文件。英语（默认语言区域），/values/strings.xml：12345&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;resources&gt; &lt;string name=&quot;title&quot;&gt;My Application&lt;/string&gt; &lt;string name=&quot;hello_world&quot;&gt;Hello World!&lt;/string&gt;&lt;/resources&gt; 西班牙语，/values-es/strings.xml：12345&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;resources&gt; &lt;string name=&quot;title&quot;&gt;Mi Aplicación&lt;/string&gt; &lt;string name=&quot;hello_world&quot;&gt;Hola Mundo!&lt;/string&gt;&lt;/resources&gt; 法语，/values-fr/strings.xml：12345&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;resources&gt; &lt;string name=&quot;title&quot;&gt;Mon Application&lt;/string&gt; &lt;string name=&quot;hello_world&quot;&gt;Bonjour le monde !&lt;/string&gt;&lt;/resources&gt; 注：可以在任何资源类型上使用语言区域限定符（或任何配置限定符），例如，可以提供本地化版本的可绘制位图。 more details 使用字符串资源可以使用由string元素的 name 属性定义的资源名称在源代码和其他 XML 文件中引用字符串资源。源代码中，可以使用语法R.string.string_name 引用字符串资源。有许多方法都接受以这种方式引用的字符串资源。例如：123456// Get a string resource from your app&apos;s ResourcesString hello = getResources().getString(R.string.hello_world);// Or supply a string resource to a method that requires a stringTextView textView = new TextView(this);textView.setText(R.string.hello_world); 在其他 XML 文件中，只要 XML 属性接受字符串值，您就可以使用语法 @string/string_name 引用字符串资源。例如：1234&lt;TextView android:layout_width=&quot;wrap_content&quot; android:layout_height=&quot;wrap_content&quot; android:text=&quot;@string/hello_world&quot; /&gt;","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"学习笔记-谷歌android培训指南-03-启动另一个 Activity","date":"2017-05-15T05:48:40.000Z","path":"2017/05/15/20170515-学习笔记-谷歌android培训指南-03-启动另一个-Activity/","text":"学习笔记-谷歌android培训指南-03-启动另一个 Activity本节将为 MainActivity 添加一些代码，这些代码可在点击“Send”按钮时启动一个新的 Activity。 响应 Send 按钮 在文件 res &gt; layout &gt; activity_main.xml 中，将 android:onClick 属性添加到 Button 元素，如下所示：12345&lt;Button android:layout_width=&quot;wrap_content&quot; android:layout_height=&quot;wrap_content&quot; android:text=&quot;@string/button_send&quot; android:onClick=&quot;sendMessage&quot; /&gt; 每次点击按钮时，此属性均会提示系统调用 Activity 中的 sendMessage() 方法。 在文件 java &gt; com.example.myfirstapp &gt; MainActivity.java 中，添加 sendMessage() 方法存根，如下所示：123456789101112public class MainActivity extends AppCompatActivity &#123; @Override protected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.activity_main); &#125; /** Called when the user clicks the Send button */ public void sendMessage(View view) &#123; // Do something in response to button &#125;&#125; 要让系统将此方法与为 android:onClick 指定的方法名称匹配，签名必须与所示内容完全相同。具体而言，该方法必须： 是公共方法具有空返回值以 View 作为唯一参数（这将是之前点击的 View） 接下来，需要填写此方法以读取文本字段的内容，并将该文本传递给另一个 Activity。 构建一个 IntentIntent 是指在相互独立的组件（如两个 Activity）之间提供运行时绑定功能的对象。Intent 表示一个应用“执行某项操作的 Intent”。 可以将 Intent 用于各种任务，但在本文中，Intent 用于启动另一个 Activity。 在 MainActivity.java 中，将如下所示代码添加到 sendMessage()：1234567891011121314151617public class MainActivity extends AppCompatActivity &#123; public final static String EXTRA_MESSAGE = &quot;com.example.myfirstapp.MESSAGE&quot;; @Override protected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.activity_main); &#125; /** Called when the user clicks the Send button */ public void sendMessage(View view) &#123; Intent intent = new Intent(this, DisplayMessageActivity.class); EditText editText = (EditText) findViewById(R.id.edit_message); String message = editText.getText().toString(); intent.putExtra(EXTRA_MESSAGE, message); startActivity(intent); &#125;&#125; Android Studio 将显示无法解析符号错误，这是因为此代码引用了未导入的类。 通过按 Alt + Enter,可使用 Android Studio 的“导入类”功能来解决其中一些问题。如下：12345import android.content.Intent;import android.support.v7.app.AppCompatActivity;import android.os.Bundle;import android.view.View;import android.widget.EditText; 仍出现 DisplayMessageActivity 错误，稍后会解决。 sendMessage() 中会执行许多操作：Intent 构造函数采用两个参数： Context 是第一个参数（之所以使用 this ，是因为 Activity 类是 Context 的子类） 应用组件的 Class，系统应将 Intent（在本例中，为应启动的 Activity）传递至该类。 注：引用 DisplayMessageActivity 会在 Android Studio 中引发错误，因为该类尚不存在。可以暂时忽略该错误，稍后会创建该类。 putExtra() 方法将 EditText 的值添加到 Intent。Intent 能够以名为 extra 的键值对形式携带数据类型。键是一个公共常量 EXTRA_MESSAGE，因为下一个 Activity 将使用该键来检索文本值。为 Intent extra 定义键时最好使用应用的软件包名称作为前缀。这可以确保在应用与其他应用交互过程中这些键始终保持唯一。 startActivity() 方法将启动 Intent 指定的 DisplayMessageActivity 实例。接下来需要创建类。 创建第二个 Activity 在 Project 窗口中，右键点击 app 文件夹并选择 New &gt; Activity &gt; Empty Activity。 在 Configure Activity 窗口中，为 Activity Name 输入 “DisplayMessageActivity”，然后点击 FinishAndroid Studio 自动执行三项操作： 使用必需的 onCreate() 方法的实现创建类 DisplayMessageActivity.java。创建对应的布局文件 activity_display_message.xml在 AndroidManifest.xml 中添加必需的 元素。 如果运行应用并在第一个 Activity 上点击“Send”按钮，则将启动第二个 Activity，但它为空。这是因为第二个 Activity 使用模板提供的默认空布局。 显示消息修改第二个 Activity，以显示第一个 Activity 传递的消息。 在 DisplayMessageActivity.java 中，向 onCreate() 方法添加下列代码： 1234567891011121314@Overrideprotected void onCreate(Bundle savedInstanceState) &#123; super.onCreate(savedInstanceState); setContentView(R.layout.activity_display_message); Intent intent = getIntent(); String message = intent.getStringExtra(MainActivity.EXTRA_MESSAGE); TextView textView = new TextView(this); textView.setTextSize(40); textView.setText(message); ViewGroup layout = (ViewGroup) findViewById(R.id.activity_display_message); layout.addView(textView);&#125; 按 Alt + Enter导入缺少的类。 12345import android.content.Intent;import android.support.v7.app.AppCompatActivity;import android.os.Bundle;import android.view.ViewGroup;import android.widget.TextView; 解释操作： 调用 getIntent() 采集启动 Activity 的 intent。无论用户如何导航到目的地，每个 Activity 都由一个 Intent 调用。 调用 getStringExtra() 将检索第一个 Activity 中的数据。 编程方式创建 TextView 并设置其大小和消息。 将 TextView 添加到 R.id.activity_display_message 标识的布局。可将布局投射到 ViewGroup，因为它是所有布局的超类且包含 addView() 方法。 注：早期版本的 Android Studio 生成的 XML 布局可能不包括 android:id 属性。如果布局没有 android:id 属性，则调用 findViewById() 将失败。如果出现这种情况，打开 activity_display_message.xml 并将属性 android:id=”@+id/activity_display_message” 添加到布局元素。 上面注中所说的一定要确认下自己的xml中有没有android:id属性，因为本人使用的android studio 2.3.1中没有自动生成android:id属性，自己添加的。 现在便可运行该应用。当应用打开后，请在文本字段键入消息，然后点击 Send。第二个 Activity 将替换屏幕中的第一个 Activity，并显示在第一个 Activity 中输入的消息。 运行效果图： [END]","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"学习笔记-谷歌android培训指南-02.构建简单的用户界面","date":"2017-05-14T05:57:36.000Z","path":"2017/05/14/20170514-学习笔记-谷歌android培训指南-02-构建简单的用户界面/","text":"谷歌android培训指南-02-构建简单的用户界面本篇介绍如何创建一个 XML 格式的布局，其中包含一个文本字段和一个按钮。Android 应用的图形界面使用 View 对象和 ViewGroup 对象层次结构而构建。View 对象通常为按钮或文本字段之类的 UI 小部件。而 ViewGroup 对象则为不可见的视图容器，它们定义子视图的布局，比如是网格布局还是垂直列表布局。Android 提供对应于 View 和 ViewGroup 子类的 XML 词汇，以便使用 UI 元素层次结构以 XML 格式定义 UI。布局是 ViewGroup 的子类。 下面将学习创建 LinearLayout.图 1. ViewGroup 对象如何在布局中形成分支并容纳其他 View 对象的图解 Note:以 XML 格式（而不是运行时代码的方式）声明 UI 布局有若干用处，但其中最重要的用处便是，您可以创建不同的布局来适应不同的屏幕尺寸。 例如，您可以创建两个版本的布局，并指示系统在“小”屏幕上使用哪个版本，在“大”屏幕上使用哪个版本。请参阅支持不同设备课程。 创建线性布局1.在 Android Studio 的 Project 窗口中，打开 app &gt; res &gt; layout &gt; activity_main.xml。此 XML 文件定义 Activity 的布局。它包含默认的“Hello World”文本视图。2.在布局编辑器中，当您打开一个布局文件时，首先显示的是设计编辑器。本文将直接使用 XML，因此点击窗口底部的 Text 标签以切换到文本编辑器。3.删除所有内容并插入以下 XML：12345678&lt;?xml version=\"1.0\" encoding=\"utf-8\"?&gt;&lt;LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\" xmlns:tools=\"http://schemas.android.com/tools\" android:layout_width=\"match_parent\" android:layout_height=\"match_parent\" android:orientation=\"horizontal\"&gt;&lt;/LinearLayout&gt; LinearLayout 是一个视图组（ViewGroup 的子类），它会按照 android:orientation 属性的指定，将子视图设置为垂直或水平方向布局。LinearLayout的每个子视图都会按照它们各自在 XML 中的出现顺序显示在屏幕上。其他两个属性 android:layout_width 和 android:layout_height 则是所有视图的必备属性，用于指定它们的尺寸。LinearLayout 是布局中的根视图，因此应将宽度和高度设置为 “match_parent”，从而填满可供应用使用的整个屏幕区域。 该值表示视图应扩大其宽度或高度，以匹配父视图的宽度或高度。参阅布局指南。 添加文本字段activity_main.xml 文件的LinearLayout元素内，添加以下EditText元素: 123456789101112&lt;?xml version=\"1.0\" encoding=\"utf-8\"?&gt;&lt;LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\" xmlns:tools=\"http://schemas.android.com/tools\" android:layout_width=\"match_parent\" android:layout_height=\"match_parent\" android:orientation=\"horizontal\"&gt; &lt;EditText android:id=\"@+id/edit_message\" android:layout_width=\"wrap_content\" android:layout_height=\"wrap_content\" android:hint=\"@string/edit_message\" /&gt;&lt;/LinearLayout&gt; 无需担心出现 @string/edit_message 错误；很快就会修复该错误。 下面说明了添加的EditText中的属性： android:id这会为视图赋予唯一的标识符，可以使用该标识符从应用代码中引用对象，例如读取和操作对象。从 XML 引用任何资源对象时，都需要使用 @ 符号。 在该符号后依次输入资源类型（本例中为 id）、斜杠和资源名称 (edit_message)。只有在第一次定义资源 ID 时，才需要在资源类型之前加一个加号 (+)。 当您编译应用时，SDK 工具会使用 ID 名称在项目的 R.java 文件中新建一个引用 EditText 元素的资源 ID。一旦以此方式声明资源 ID，其他对该 ID 的引用皆无需使用加号。 只有在指定新资源 ID 时才必须使用加号，对于字符串或布局等具体资源则不必如此。 资源对象资源对象是一个唯一的整型名称，它与应用资源（如位图、布局文件或字符串）相关联。每个资源在项目的 R.java 文件中都定义有相应的资源对象。可以使用 R类中的对象名称来引用资源，例如当需要为 android:hint 属性指定字符串值时，就可以这样做。也可以使用 android:id 属性创建任意与视图相关联的资源 ID，从而可以从其他代码中引用该视图。SDK 工具会在每次编译应用时生成R.java 文件。切勿手动修改该文件。更详细的信息，请参考这儿。 android:layout_width 和 android:layout_height“wrap_content” 值并不规定宽度和高度的具体大小，而是指定根据需要缩放视图，使其适合视图的内容。 如果要改用 “match_parent”，则 EditText 元素将填满屏幕，因为它会匹配父LinearLayout 的大小。更详细的信息，请参考这儿。 android:hint这是文本字段为空时显示的默认字符串。”@string/edit_message” 并非使用硬编码字符串作为其值，而是引用另一个文件中定义的一个字符串资源。 由于它引用的是一个具体资源（而不仅仅是标识符），因此不需要加号。 不过，由于尚未定义字符串资源，所以最初会出现编译错误。可以通过定义字符串来修正该错误。 注：此字符串资源与元素 ID edit_message 同名。不过，对资源的引用始终都按资源类型（如 id 或 string）确定其作用域，因此使用相同的名称不会引起冲突。 添加字符串资源默认情况下， Android 项目在 res &gt; values &gt; strings.xml 位置包含一个字符串资源文件。需要在此处添加两个新字符串。1.从 Project 窗口中，打开 res &gt; values &gt; strings.xml。2.添加两个字符串，使文件如下所示:123456&lt;?xml version=\"1.0\" encoding=\"utf-8\"?&gt;&lt;resources&gt; &lt;string name=\"app_name\"&gt;My First App&lt;/string&gt; &lt;string name=\"edit_message\"&gt;Enter a message&lt;/string&gt; &lt;string name=\"button_send\"&gt;Send&lt;/string&gt;&lt;/resources&gt; 对于用户界面中的文本，务必将每个字符串都指定为资源。 字符串资源允许在单一位置管理所有 UI 文本，从而简化文本的查找和更新。 此外，将字符串外部化还可为每个字符串资源提供替代定义，从而将应用本地化为不同的语言。有关使用字符串资源将应用本地化为其他语言的详细信息，请参阅支持不同设备课程 添加按钮返回到 activity_main.xml 文件并在 EditText 后添加一个按钮。文件应如下所示：12345678910111213141516&lt;?xml version=\"1.0\" encoding=\"utf-8\"?&gt;&lt;LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\" xmlns:tools=\"http://schemas.android.com/tools\" android:orientation=\"horizontal\" android:layout_width=\"match_parent\" android:layout_height=\"match_parent\"&gt; &lt;EditText android:id=\"@+id/edit_message\" android:layout_width=\"wrap_content\" android:layout_height=\"wrap_content\" android:hint=\"@string/edit_message\" /&gt; &lt;Button android:layout_width=\"wrap_content\" android:layout_height=\"wrap_content\" android:text=\"@string/button_send\" /&gt;&lt;/LinearLayout&gt; 注：此按钮不需要 android:id 属性，因为不需要从 Activity 代码中引用它。如图 2 所示，该布局当前设计为根据内容大小调整 EditText 和 Button 小部件的尺寸。图 2. EditText 小组件和 Button 小部件的宽度均设置为 “wrap_content” 这对按钮很适合，但不太适合文本字段，因为用户键入的内容可能更长。 最好让文本字段填满未使用的屏幕宽度。 可以在 LinearLayout 内通过weight 属性来实现此目的，该属性可使用 android:layout_weight 属性来指定。Weight 值是一个数字，用于指定每个视图与其他同级视图在剩余空间中的占比。 这有点像饮料配方中各种成分的比例： “2 份苏打、1 份糖浆”是指饮料中三分之二是苏打。例如，如果将一个视图的 weight 值指定为 2，将另一个视图的 weight 值指定为 1，总和是 3，那么第一个视图将填满剩余空间的 2/3，而第二个视图则填满其余部分。 如果添加了第三个视图，将其 weight 值指定为 1，那么现在第一个视图（weight 值为 2）将获得 1/2 的剩余空间，其余两个视图则各占 1/4。所有视图的默认 weight 值都为 0，所以如果仅将一个视图的 weight 值指定为大于 0，那么等到其他所有视图都获得所需空间后，该视图便会填满所有剩余空间。 使输入框填满屏幕宽度在 activity_main.xml 中，修改 EditText ，使这些属性如下所示：12345&lt;EditText android:id=\"@+id/edit_message\" android:layout_weight=\"1\" android:layout_width=\"0dp\" android:layout_height=\"wrap_content\" android:hint=\"@string/edit_message\" /&gt; 将宽度设置为零 (0dp) 可提高布局性能，这是因为如果将宽度设置为 “wrap_content”，则会要求系统计算宽度，而该计算最终毫无意义，因为 weight 值还需要计算另一个宽度，才能填满剩余空间。图 3. EditText 小部件获得了布局的所有 weight，因此它填满了 LinearLayout 中的剩余空间 完整的 activity_main.xml 布局文件现在看上去应该像下面这样：12345678910111213141516&lt;?xml version=\"1.0\" encoding=\"utf-8\"?&gt;&lt;LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\" xmlns:tools=\"http://schemas.android.com/tools\" android:orientation=\"horizontal\" android:layout_width=\"match_parent\" android:layout_height=\"match_parent\"&gt; &lt;EditText android:id=\"@+id/edit_message\" android:layout_weight=\"1\" android:layout_width=\"0dp\" android:layout_height=\"wrap_content\" android:hint=\"@string/edit_message\" /&gt; &lt;Button android:layout_width=\"wrap_content\" android:layout_height=\"wrap_content\" android:text=\"@string/button_send\" /&gt;&lt;/LinearLayout&gt; 运行应用&amp;效果图 [END]","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"学习笔记-谷歌android培训指南-01.创建第一个应用","date":"2017-05-13T07:44:58.000Z","path":"2017/05/13/20170513-学习笔记-谷歌android培训指南-01-创建第一个应用/","text":"创建第一个应用01.在 Android Studio 中，创建新项目如果未打开项目，请在 Welcome to Android Studio 窗口中，点击 Start a new Android Studio project。如果已打开项目，请选择 File &gt; New Project。 02.在 New Project 屏幕中，输入以下值：Application Name：“My First App”Company Domain：“example.com” 03.点击 Next04.在 Target Android Devices 屏幕中，保留默认值并点击 Next。Minimum Required SDK 是指您的应用所能支持的最低 Android 版本， 由 API 级别表示。为支持尽可能多的设备，您应将其设置成可让您的应用提供核心功能集的最低可用版本。 如果应用的任何功能只能在更新版本的 Android上运行，并且不属于核心功能集的关键功能，则可仅当在支持该功能的版本上运行时启用该功能（请参阅支持不同平台版本）。 05.在 Add an Activity to Mobile 屏幕中，选择 Empty Activity，然后点击 Next。06.在 Customize the Activity 屏幕中，保留默认值并点击 Finish。 一直卡在Building ‘MyFirstApp’Gradle project info界面。 关于问题：一直卡在Building ‘MyFirstApp’Gradle project info界面百度到的解决办法主要有两种，一是直接下载gradle离线包，二是修改项目的gradle-wrapper.properties里的gradle版本为自己电脑已有的版本。第一种方法：查看所需gradle版本：打开C:\\Users\\用户名.gradle\\wrapper\\dists\\gradle-x.xx-all\\xxxxxxxxxxxx，如果里面的gradle-xx-all.zip不完整（如0KB），则说明下载不成功，需要下载离线包放置到该目录下。解压，重新打开android studio。第二种方法：修改gradle-wrapper.properties方式1、随便找一个之前能够运行的android studio项目2、打开项目的/gradle/wrapper/gradle-wrapper.properties文件3、复制最后一行distributionUrl这一整行的内容，例如：distributionUrl=https\\://services.gradle.org/distributions/gradle-3.3-all.zip，替换到你要导入的项目里的gradle-wrapper.properties文件中。4、重启Android Studio，重新导入项目就可以了~~ 07.Then，等了好长时间进去了… 报错：Error:CreateProcess error=216, 该版本的 %1 与您运行的 Windows 版本不兼容。请查看计算机的系统信息，了解是否需要 x86 (32 位)或 x64 (64 位)版本的程序，然后联系软件发布者。解决方法：使AndroidStudio 的jdk版本与环境变量中设置的版本一致。在File-》Project Struct里面设置下。 继续报错：Error:NDK not configured.Install NDK and sync project 直接点了上图中的蓝色连接，下载了ndk r14b 08.下载完成后进行漫长的解压等待… 果然…..宿命的错误继续…报错：Error:Failed to find CMake.Install CMake and sync project 在setting中没有找到相应的安装包，在stackoverflow上找到了如下解释：CMake is only available for 64 bit machine: 64We won’t be able to support CMake (or ndk-build) on 32 bit OS because it is not supported in CLion which is the tech we use for the C++ editor. The root cause is memory\\address-space limits.Here’s a helper page where I describe Android Studio C++ support including the 64 bit requirement:https://sites.google.com/a/android.com/tools/tech-docs/external-c-builds(以后再搞这个support c++找不到cmaker的问题，重建一个新工程，不勾选support c++选项) 报错：Error：Failed to find Build Tools revision 25.0.2点蓝色连接下载安装。 09.经过一些处理后，Android Studio 将打开并显示包含默认文件的“Hello World”应用。下面看一下最重要的文件：首先，请确保已打开 Project 窗口（选择 View &gt; Tool Windows &gt; Project），并从顶部的下拉列表中选择Android 视图。随后，可以看到下列文件： app &gt; java &gt; com.example.myfirstapp &gt; MainActivity.java完成新项目向导后，该文件将显示在 Android Studio 中。 它包含您之前创建的 Activity 的类定义。当您构建并运行应用时，Activity 会启动，并加载显示“Hello world!”的布局文件。 app &gt; res &gt; layout &gt; activity_main.xml此 XML 文件定义您的 Activity 的布局。它包含带有文本“Hello world!”的 TextView 元素。 app &gt; manifests &gt; AndroidManifest.xml清单文件描述应用的基本特性并定义其每个组件。 Gradle Scripts &gt; build.gradleAndroid Studio 使用 Gradle 来编译和构建您的应用。项目的每个模块都有相应的 build.gradle 文件，整个项目也有相应的 build.gradle 文件。 通常你只关心模块（在本例中，为 app 或称应用模块）的 build.gradle 文件。如需了解有关此文件的详细信息，请参阅使用 Gradle 构建您的项目）。 10.运行app可以在实体设备或模拟器上运行应用。 （笔者使用实体手机运行的） 在实体设备上运行应用设置你的设备，如下所示： 使用一根 USB 电缆将你的设备连接到你的开发机器。 如果是在 Windows 上开发，可能需要为你的设备安装相应的 USB 驱动程序。 如需帮助安装驱动程序，请参阅原始设备制造商 (OEM) USB 驱动程序文档。 （官网上的这步没有找到，本人直接跳到了步骤3）转到 Settings &gt; Developer options，在你的设备上启用 USB debugging。注：在 Android 4.2 及更新版本的设备上，Developer options 默认处于隐藏状态。如需将其显示出来，请转到 Settings &gt; About phone并点按Build number 七次。返回上一屏幕即可找到 Developer options。从 Android Studio 中运行应用，如下所示： 在 Android Studio 中，选择您的项目，然后点击工具栏中的 Run 。 在 Select Deployment Target 窗口中，选择您的设备，然后点击 OK。Android Studio 会在您连接的设备上安装并启动应用。 在模拟器上运行应用 在模拟器上运行应用之前，需要创建一个 Android Virtual Device (AVD) 定义。AVD 定义可用于定义想要在 Android Emulator 中模拟的 Android 电话、平板电脑、Android Wear 或 Android TV 设备的特征。创建 AVD 定义，如下所示： 通过选择 Tools &gt; Android &gt; AVD Manager，或点击工具栏中 AVD Manager 图标，启动 Android Virtual Device Manager 。 在 Your Virtual Devices 屏幕中，点击 Create Virtual Device。 在 Select Hardware 屏幕中，选择电话设备（如 Nexus 6），然后点击 Next。 在 System Image 屏幕中，选择 AVD 所需的系统映像，然后点击 Next。如果未安装特定的系统映像，则可通过点击 Download 链接获取它。 验证配置设置（对于您的第一个 AVD，请将所有设置保持原样），然后点击 Finish。如需了解有关使用 AVD 的详细信息，请参阅创建和管理虚拟设备。从 Android Studio 中运行应用，如下所示： 在 Android Studio 中，选择您的项目，然后点击工具栏中的 Run 。 在 Select Deployment Target 窗口中，选择您的模拟器，然后点击 OK。模拟器可能需要几分钟时间完成启动。您可能需要将屏幕解锁。解锁后，模拟器屏幕上会出现 My First App。 11.运行效果 [END]","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"学习笔记-谷歌android培训指南-00.环境准备","date":"2017-05-13T07:01:54.000Z","path":"2017/05/13/20170513-学习笔记-谷歌android培训指南-00/","text":"软件：OS:Windows7 32bitAndroid studio 2.3.1.0JDK1.8.0_131JRE1.8.0_131 参考:谷歌官方android培训指南 地址 01.下载Android Studio(Android官方 IDE)上图页面链接Android Studio下载地址(version 2.3.1.0 for windows)Android Studio用户指南链接 02.安装 Android Studio1.双击android-studio-bundle-162.3871768-windows.exe2.自行配置下安装路径,也可以直接用默认安装路径 03.启动android-studio启动android-studio的时候提示错误:的确,之前在系统环境变量里设置了JAVA_HOME变量,但对应的路径下的jdk已经被我删掉了,所以需要重新下载jdk并更改环境变量. 04.安装JDK下载jdk地址(版本jdk-8u131-windows-i586)重新设置JDK安装路径,不一定跟上图路径一样.重新设置JRE安装路径,不一定跟上图路径一样.安装成功。 05.配置JDK系统变量 计算机-》右键-》属性-》高级系统设置-》环境变量-》新建一个系统变量JAVA_HOME，设置刚刚安装时候的路径（根据各人安装时候的路径配置） 06.启动android studio 解决方案：在 Android Studio 安装目录 bin/idea.properties 文件最后追加一句disable.android.first.run=true 重新启动Android Studio 安装Android Studio完毕。","tags":[{"name":"android","slug":"android","permalink":"http://sniperkaka.com/tags/android/"}]},{"title":"读书笔记-3D游戏编程大师技巧-01","date":"2017-05-09T09:08:53.000Z","path":"2017/05/09/20170509-读书笔记-3D游戏编程大师技巧-01/","text":"书名：3D游戏编程大师技巧作者：[美]Andre LaMothe 姚晓光 (NPC6) 腾讯游戏琳琅天下工作室总经理史晓明（polyrandom） BigWorld高级软件工程师沙鹰 Windows游戏编程大师技巧（第二版）译者等推荐 注意：【1】必须安装了DirectX 8.1 SDK或更高版本才能使用本书源代码。【2】书中用到的IDE: Microsoft Visual C++ 6.0【3】书中DirectX程序可能用到的库：DDRAW.LIB : DirectDraw导入库DINPUT.LIB : DirectInput导入库DINPUT8.LIB : DirectInput8导入库DSOUND.LIB : DirectSound导入库WINMMLIB : Windows多媒体扩展库还需要将DirectX.h放到头文件搜索路径中。【4】DirectX8.0 DirectDraw已被集成到Direct3D中，本书继续使用Directx 7/8接口，但在DirectX 9.0 SDK下进行编译。对于linux，可以考虑将code移植到sdl。【5】该引擎是以标准的线性寻址方式建立一个双缓存图形系统。 第1章 3D游戏编程入门","tags":[{"name":"游戏编程","slug":"游戏编程","permalink":"http://sniperkaka.com/tags/游戏编程/"}]},{"title":"读书笔记-人民的名义-周梅森-01","date":"2017-04-10T05:34:48.000Z","path":"2017/04/10/20170410-读书笔记-人民的名义-周梅森-01/","text":"书名：人民的名义作者：周梅森 出版社：北京十月文艺出版社 ISBN：978-7-5302-1619-4 出版时间：2017.1.1 为充分展现中央“坚持以零容忍态度惩治腐败”的反腐精神和国家当前轰轰烈烈、气势如虹的反腐斗争局面，周梅森先生潜心八年，于2017年再次推出大型现实主义题材长篇力作——《人民的名义》，一部反腐高压下中国政治和官场生态的长幅画卷。 在H省政坛，以H省委副书记、政法委书记高育良为代表的“政法系”，以H省委常委、京州市委书记李达康为代表的“秘书帮”相争多年，不分轩轾。新任省委书记沙瑞金的到来，注定将打破这种政治的平衡局面，为H省的改革大业带来新的气息…… 作者简介 周梅森，1956年出生，江苏徐州人。出版有《周梅森文集》（十二卷）、《周梅森政治小说读本》（三卷）、《周梅森读本》（七卷）、《周梅森反腐经典小说》（六卷）、及《梦想与疯狂》《黑坟》《天下大势》《大捷》《军歌》《沉沦的土地》等长、中篇小说多种。根据其小说改编的电视连续剧有《人间正道》《中国制造》《至高利益》《绝对权力》《国家公诉》《我主沉浮》《我本英雄》《人民的名义》等多部。 摘要 H省检察院检察长季昌明。反贪局局长陈海。分管政法工作的省委副书记高育良。最高人民检察院反贪总局的侦查处处长侯亮平。 侯亮平忽然发现，外面无风无雨，太平寂静，。雷暴在哪里？哪来的啥雷暴区？…这位上了把年纪的老同志意味深长地瞅了他一眼，颇具哲理地说，看事物不能只看表面，云层上面的世界你能看见吗？平静后面往往就藏着雷暴。 肉眼看不见云层上面的世界，同样看不见阳光下隐藏的黑暗。 这是一套常见的机关房改房，七十平方米左右，老旧不堪。家具像是赵德汉结婚时置办的，土得掉渣，沙发的边角都磨破了。门口丢着几双破拖鞋，扔到街上都没人拾。卫生间的马桶在漏水，隔上三两秒钟“滴答”一声。厨房里的水龙头也在滴水，但这似乎不是漏水，而是刻意偷水。证据很明显，水龙头下的脸盆里积了半盆不要钱的清水。 侦查处长陆亦可 赵德汉把梦幻般的目光投向铁柜：好看，太好看了。小时候在乡下，我最喜欢看丰收的庄稼地，经常蹲在地头一看一晌午。我爱吃炸酱面，更爱看地里的小麦。麦出苗了，麦拔节了，金灿灿的麦穗成熟了……看着看着，肚子就饱了。赵德汉声称自己是农民的儿子，几辈子的农民啊，穷怕了！看钞票，就像看小麦一样，看着心里踏实，看着精神满足。看久了，钞票上会泛起一片金光灿烂的麦浪呢……这人真他妈的奇葩一朵，竟然能把贪婪升华为田园诗意。 失败的人生就在于失去到手的一切，而为这一切他付出了道德、良心、人格的代价，到头来却是竹篮打水一场空，怎一个伤心了得！ 省委常委、京州市委书记李达康.省公安厅厅长祁同伟。 陈海很清楚，每位领导肚子里都有一本难念的经，但表面上千篇一律，永远都是没有表情的表情。 李达康是H省有名的改革闯将，胆子大，脾气硬，当年提出过一个响亮口号：法无禁止即自由！啥事都敢干，啥人都敢用。 季昌明的性格外柔内刚，表面上谨慎，关键时刻还是敢于表达意见的。他看了看众人，语气坚定地说：高书记、李书记，现在是讨论问题，那我这检察长也实话实说，不论丁义珍一案会给我省造成多大的影响，我们都不宜和最高检争夺办案权，以免造成将来的被动！ 他希望自己变得更完善，更成熟——或者说是更圆滑，但一味瞻前顾后，他总是做不到。做人要有担当，哪怕付出些代价！这一点，陈海从内心佩服侯亮平同学，这猴子同学有股孙悟空天不怕地不怕的劲儿。 我也提醒你一下，像今晚丁义珍这种事，你也少出头，免得惹上嫌疑！这种时候你过于活跃，人家就会怀疑你有私心。 李达康身上文人气比较重，当年是省委大院一支笔，秘书们的天然领袖，给好几位大领导当过大秘。这批秘书起来后，形成H省政界的一支重要力量，被人称为“秘书帮”。而高育良手下弟子呢，大都在政法口工作，被视作“政法系”。当然，秘书帮、政法系都是干部群众私底下的戏称，但人脉关系自然形成，两股势力存在也就成了不争的事实。 当年在H大学，他和侯亮平、祁同伟被称为“政法系三杰”。虽然都是好朋友，陈海心底与侯亮平走得更近一些，猴子同学尽管毛病不少，但心眼正，为人实在。祁同伟有些虚荣，衣着举止时常透出一点花花公子的浮华，其实他出生于贫困农村。在学校时，祁同伟和侯亮平都争强好胜，陈海时常为他们调解矛盾。大三那年，为竞争政法系学生会主席，祁同伟和侯亮平明争暗斗搞得难分高下，最后双方妥协，共推老好人陈海当主席。他们三人都是高育良的得意门生，前进的道路上都受到老师的指点和栽培。如今一起为共同的事业奋斗，这段缘分格外值得珍惜。 离开老师高育良的家，雨已停歇，东方的天际霞光尽染。 夕阳西下，大地洒下一片金色。透过挡风玻璃可以看见明净的天空，瓦蓝瓦蓝水洗过一般。几朵白云悠悠飘荡，如羊如棉如雪山。一架架飞机腾空而起，钢铁巨鸟打破了宁静画面，气势磅礴地呼啸远去。 李达康是一个善处逆境的人，就像一只皮球，越是用力拍打，弹得就越高，身上一股拼命三郎的劲，在全省干部队伍中是出了名的。 工人们既气愤，又紧张，一时间，日娘捣奶奶的，咒骂声四起。现场情绪看似高昂，实则大家都怕得要死，一个个脸色青白。副厂长老马戴着一顶安全帽，一手擎着三角铁，一手往嘴里填速效救心丸。尤会计慌乱中有些不知所措，拿着个智能手机横过来竖过去，一会儿站到板凳上，一会儿蹲在地下，准备照相。蔡成功说了，让他照相留证据，将来发到网上让人们看看腐败分子的强拆暴行……","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"读书笔记-边城-沈从文","date":"2017-03-28T08:53:10.000Z","path":"2017/03/28/20170328-读书笔记-边城-沈从文/","text":"作品：边城作者：沈从文读后感：1.含混不清的暧昧害死了人，不痛快的人有了不痛快的结局。2.每一只船总要有个码头，每一只雀儿得有个巢。 边城-题记我这本书只预备给一些“本身已离开了学校，或始终就无从接近学校，还认识些中国文字，置身于文学理论、文学批评以及说谎造谣消息所达不到的那种职务上，在那个社会里生活，而且极关心全个民族在空间与时间下所有的好处与坏处”的人去看。他们真知道当前农村是什么，想知道过去农村是什么，他们必也愿意从这本书上同时还知道点世界一小角隅的农村与军人。翠翠在风日里长养着，把皮肤变得黑黑的，触目为青山绿水，一对眸子清明如水晶。自然既长养她且教育她，为人天真活泼，处处俨然如一只小兽物。人又那么乖，如山头黄麂一样，从不想到残忍事情，从不发愁，从不动气。平时在渡船上遇陌生人对她有所注意时，便把光光的眼睛瞅着那陌生人，作成随时皆可举步逃入深山的神气，但明白了人无机心后，就又从从容容的在水边玩耍了。茶峒地方凭水依山筑城，近山的一面，城墙如一条长蛇，缘山爬去。临水一面则在城外河边留出余地设码头，湾泊小小篷船。船下行时运桐油青盐，染色的五-子。这些诚实勇敢的人，也爱利，也仗义，同一般当地人相似。不拘救人救物，却同样在一种愉快冒险行为中，做得十分敏捷勇敢，使人见及不能不为之喝彩。某年秋天，那原来执事人死去了，顺顺作了这样一个代替者。那时他还只五十岁，为人既明事明理，正直和平又不爱财，故无人对他年龄怀疑。年幼的则气质近于那个白脸黑发的母亲，不爱说话，眼眉却秀拔出群，一望即知其为人聪明而又富于感情。一分教育的结果，弄得两个人皆结实如老虎，却又和气亲人，不骄惰，不浮华，不倚势凌人，故父子三人在茶峒边境上为人所提及时，人人对这个名姓无不加以一种尊敬。他把长子取名天保，次子取名傩送。端午日，当地妇女小孩子，莫不穿了新衣，额角上用雄黄蘸酒画了个王字。任何人家到了这天必可以吃鱼吃肉。大约上午十一点钟左右，全茶峒人就吃了午饭，把饭吃过后，在城里住家的，莫不倒锁了门，全家出城到河边看划船。翻过了小山-，望得见对溪家中火光时，那一方面也看见了翠翠方面的火把，老船夫即刻把船拉过来，一面拉船一面哑声儿喊问：“翠翠，翠翠，是不是你？”翠翠不理会祖父，口中却轻轻的说：“不是翠翠，不是翠翠，翠翠早被大河里鲤鱼吃去了。”翠翠上了船，二老派来的人，打着火把走了，祖父牵着船问：“翠翠，你怎么不答应我，生我的气了吗？” …黄狗就伴同翠翠守船。翠翠头上戴了一个崭新的斗篷，把过渡人一趟一趟的送来送去。黄狗坐在船头，每当船拢岸时必先跳上岸边去衔绳头，引起每个过渡人的兴味。有些过渡乡下人也携了狗上城，照例如俗话说的，“狗离不得屋”，一离了自己的家，即或傍着主人，也变得非常老实了。到过渡时，翠翠的狗必走过去嗅嗅，从翠翠方面讨取了一个眼色，似乎明白翠翠的意思，就不敢有什么举动。直到上岸后，把拉绳子的事情作完，眼见到那只陌生的狗上小山去了，也必跟着追去。或者向狗主人轻轻吠着，或者逐着那陌生的狗，必得翠翠带点儿嗔恼的嚷着：“狗，狗，你狂什么？还有事情做，你就跑呀！”于是这黄狗赶快跑回船上来，且依然满船闻嗅不已。翠翠说：“这算什么轻狂举动！跟谁学得的！还不好好蹲到那边去！”狗俨然极其懂事，便即刻到它自己原来地方去，只间或又象想起什么似的，轻轻的吠几声。“你是不是说风水好应出有大名头的人？我以为这种人不生在我们这个小地方，也不碍事。我们有聪明，正直，勇敢，耐劳的年青人，就够了。象你们父子兄弟，为本地也增光彩已经很多很多！”“伯伯，你说得好，我也是那么想。地方不出坏人出好人，如伯伯那么样子，人虽老了，还硬朗得同棵楠木树一样，稳稳当当的活到这块地面，又正经，又大方，难得的咧。” 二老不能逼迫翠翠回去，到后便各自走开了。翠翠到河下时，小小心中充满了一种说不分明的东西。是烦恼吧，不是！是忧愁吧，不是！是快乐吧，不，有什么事情使这个女孩子快乐呢？是生气了吧，——是的，她当真仿佛觉得自己是在生一个人的气，又象是在生自己的气。祖父看看那种情景，明白翠翠的心事了，便把眼睛向远处望去，在空雾里望见了十五年前翠翠的母亲，老船夫心中异常柔和了。轻轻的自言自语说：“每一只船总要有个码头，每一只雀儿得有个巢。”见翠翠总不作声，祖父于是笑了，且说：“翠翠，想几天不碍事。洛阳桥并不是一个晚上造得好的，要日子咧。前次那人来的就向我说到这件事，我已经就告过他：车是车路，马是马路，各有规矩。想爸爸作主，请媒人正正经经来说是车路；要自己作主，站到对溪高崖竹林里为你唱三年六个月的歌是马路，——你若欢喜走马路，我相信人家会为你在日头下唱爇情的歌，在月光下唱温柔的歌，一直唱到吐血喉咙烂！”不过一切皆得在一份时间中变化。这一家安静平凡的生活，也因了一堆接连而来的日子，在人事上把那安静空气完全打破了。船总顺顺家中一方面，则天保大老的事已被二老知道了，傩送二老同时也让他哥哥知道了弟弟的心事。这一对难兄难弟原来同时爱上了那个撑渡船的外孙女。这事情在本地人说来并不希奇，边地俗话说：“火是各处可烧的，水是各处可流的，日月是各处可照的，爱情是各处可到的。” 一九三三年冬至一九三四年春完成","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"读书笔记-流血的仕途：李斯与秦帝国-上-01","date":"2017-01-28T15:45:23.000Z","path":"2017/01/28/20170128-读书笔记-流血的仕途：李斯与秦帝国-上-01/","text":"作品：流血的仕途：李斯与秦帝国-上作者：曹昇 1-46 警惕啊，一不小心，坐以待时就将变成坐以待毙。在这个年轻人身上，竟有着比相国吕不韦更强悍更霸道的气势。这种气势之于男人，就好比气质之于女人，先天可以生得，后天未必养得。李斯开口说话了：“汝等庸人，安敢轻吾！汝等恃以辱吾者，徒蛮力耳，今为看门之犬，固得其所也。岂不闻，一人之辩，胜于九鼎之宝；三寸之舌，强于百万雄师，此李斯所恃也。倘李斯用事，相国也不足为尔等免祸，尔等必死也。”言迄远去。比较体验过死亡者和未曾体验过死亡者，其活着的姿态有大差异。前者向死而生，后者为死而生。李斯答道：“夫子惠吾已多也，李斯愧无以报。今李斯功未成，名不就，不得光耀师门，心实耻之。为人弟子，倘只知假师尊之名以邀幸，不知挟师尊之术以自立，此小人之道，非君子之道，李斯不屑为也。郑国是战国时代有名的水利专家，那时候科学家的地位和今天没法比，比较受人歧视，说话也没人爱听，心里那个憋屈啊。李斯这一问，郑国甚至都有些感动了，也甭管李斯是不是自己的知音，便取出一幅地图，在上面指点着讲解开来：“且看，泾水洛水之间，为关中之地，幅员广袤，然苦于无水之故，田地贫瘠，民终岁垦作，而仍饥以殍也。郑国之策，首起雍州云阳县西南二十五里，凿泾水，自中山西邸瓠口为渠，傍北山，经泾阳、三原、高陵、临潼、富平、蒲城而东注洛水，三百余里以溉田，用注填阏之水，溉泽卤之地，不数年，则原田弥望，畎浍连属，由来榛棘之所，遍为粳稻之川，有丰岁，无凶年，关中为沃野，秦得以富强。”他当即决定，要对吕氏家族企业进行战略调整，并跑回家去做老爸的思想工作。他问他老爸：“种田的投资回报率是多少？”“1000％。”“做珠玉生意的投资回报率呢？”“10000％。”“把一个穷困潦倒的王孙扶植成秦国君主的投资回报率呢？”“∞％。”小贾贾于市，大贾贾于朝。吕不韦和他老爸统一了思想认识之后，要开始做大贾了。瞧咱们的吕不韦，面对∞％的投资回报率，依然面不改色心不跳。他以无比的冷静和耐心，向世人展现出他高明的智慧和超凡的策略。当时，秦国为昭王在位，异人的老爸安国君为太子。安国君有许多老婆，异人的母亲夏姬只是其中之一，而且不招安国君喜欢。安国君老婆虽多，却独独宠幸华阳夫人一个。偏偏华阳夫人无子，于是吕不韦往说之。所有的女人都有一个共同特点，那就是她们都是女人。吕不韦是出了名的花花公子，而且花得相当有技术含量。对付女人，他大有一雄可将十万雌之勇。他成日泡在脂粉堆里，对女人的生理渴望，他能得之于手而有数于心，堪比轮扁斫轮。对女人的心理需求，他能不以目视而以神遇，有如庖丁解牛。因此，尽管他长相薄陋拙恶，但凡和他好过的女子，却如同中了魔咒似的，心里再也容不下别的男人，成天什么事也不想做，就想着和吕不韦一好再好，好上加好。然而，吕不韦是那种万花丛中过、只叶不沾身的主，用粗俗的话讲，就是打一枪换一个地方。那些被他遗弃的女人，一辈子也忘却不了那一夜的风情，从此只能生活在痛苦和惆怅之中，所谓一遇吕郎误终生是也。吕不韦的名气在女人圈中越来越大，所以，虽然他远非什么羊车璧人，但出门转一圈，偶尔也能蒙个掷果盈车回来。以这样的吕不韦，对付一个久处深宫的华阳夫人，自然是绰绰有余。他对华阳夫人说道：“吾闻之，以色事人者，色衰而爱弛。今夫人事太子，甚爱而无子，不以此时早自结于诸子中贤孝者，举立以为嫡而子之，夫在则重尊，夫百岁之后，所子者为王，终不失势，此所谓一言而万世之利也。不以繁华时树本，即色衰爱弛后，虽欲开一语，尚可得乎？今异人贤智，结诸侯宾客遍天下，以夫人为天，日夜泣思太子及夫人，而自知中男也，次不得为嫡，其母又不得幸，自附夫人，夫人诚以此时拔以为嫡子，夫人则竟世有宠于秦矣。”庭院梅花盛开，遍地落红，吕不韦仰望长天，心内交战，莫能自决。他脸色忽青忽紫，反射出内心难以抵抗的疼痛。然而，我却不揣恶意地以为，这是幸福的苦恼，没有同情的必要。无论美女还是江山，得到任何一样都够一般人高呼“夫复何求”了。权力最终击败了美貌，权力欲压倒了爱欲。赵姬跪在吕不韦面前，攀附着他的双腿，满面珍珠泪，一片心酸词，红唇间的湿润，似仍期待着一次甜蜜的亲吻。然而，离别的时候到了，你可以软弱，而我必须坚强。且让欢爱如烟云散去，散成缥缈的回忆。当我疲倦地归来，有人举一壶酒，为我祈福，然而那人将不再是你，你在另外一个男人怀里。午夜时分，吕不韦敲开了异人的大门，将他心爱的女人拱手相让。他将赵姬送到了另外一个男人的家里，送到了另外一个男人的床上。当异人得意地将赵姬压在身下恣意狂荡时，吕不韦独自踌躇在邯郸昏暗的雨巷，如野兽般号啕大哭。权力是一种人们有意不提及的宗教，而且是排他性的一神教，除权力本身之外，不再有别的神。它并不要求信徒虔诚，却没有信徒不是百分之百的虔诚。它给予信徒随时离去的自由，却没有信徒愿意行使这种自由。君不见，漫漫的仕途，有如错综复杂的林中之路，在那高可蔽日的密林深处，埋葬了多少男人的青春，见证了多少女人的眼泪。对易牙来说，儿子是拿来烹的；对吴起来说，妻子是拿来杀的；对汉唐皇帝来说，女儿是拿来卖的；对刘粲来说，庶母是拿来睡的；对刘子业来说，姐妹是拿来奸的；对杨广来说，老爸是拿来弑的；对赵光义来说，兄弟是拿来砍的……权力喜欢这样的表演，它从不闭上自己的眼睛。红颜会化成骷髅，英雄将沦为白骨，官员的坟茔上长满荒草，皇帝的陵墓旁游人拍照，只有江山依旧，权力不死。有谁能夸口是他在驾驭权力，而不是被权力所驾驭？以速朽之人生，驾驭不死之权力，吾未之信也。且说异人得了赵姬，日宠夜幸，爱眷非常。赵姬不久便有了身孕，十月之后，产下一个男婴。异人大喜，为男婴取名嬴政，并将赵姬立为夫人。嬴政三岁那年，异人的爷爷，也就是秦昭王，派遣将军王齮大举进攻赵国。数十万秦军一路势如破竹，直杀到邯郸城下。国都邯郸一破，也就意味着赵国的灭亡。赵王惶恐之下，欲杀异人以报复秦国。幸好吕不韦交游广泛，提前得此情报，忙与异人商议出逃。…后来，魏国公子信陵君窃符救赵，大破秦师于邯郸城下，王齮败退，撤回秦国。随着秦赵两国的关系渐渐缓和，赵姬和嬴政的境况这才慢慢好转。赵国虽然不再有诛杀他们的念头，却依然将他们当作人质扣押看管着。当时，燕国的太子丹也在赵国做人质。太子丹和嬴政年纪相当，两个小孩时常在一起玩耍。然而，这一等就是六年。到嬴政长到九岁时，在位五十六年的秦昭王终于死了，太子安国君总算是熬出了头，坐上了秦王的宝座，是为孝文王，华阳夫人成了王后，异人也顺理成章地成为太子。鉴于异人已经成了秦国的接班人，为了和这个未来的秦王搞好关系，赵国也乐得做个顺水人情，将赵姬和嬴政送归秦国，使其一家团圆。安国君刚刚举办完即位大典，两天后就突然一命呜呼了。异人继位，是为庄襄王，尊华阳夫人为华阳太后，生母夏姬为夏太后，吕不韦也随之一步登天，成了一人之下、万人之上的秦国丞相，封为文信侯，食河南洛阳十万户。秦国朝政大权，皆掌在吕不韦一人之手。人，一生要走很多很多路，重要的却只有那么几步；人，一生要说很多很多话，重要的却只有那么几句；人，一生会认识很多很多人，重要的却只有那么几个。成功者和失败者的区别，也许就只在于他们多走对了一两步路，多说对了一两句话，多交对了一两个人而已。从李斯迈过寝宫门槛的那一步开始，他便在用狂放的肢体语言刺激着吕不韦的神经。他高昂着头，目不斜视，步伐宽阔而有力，浑身散发出利剑出鞘的夺人气势。在他英俊而棱角分明的脸上，看不到丝毫乞讨者的惶恐和悲伤，有的却是施舍者的自在和怜悯。他仿佛并非身处万民仰望的高高庙堂，在他看来，这里只是一处任他纵马游缰的无主草场。李斯向吕不韦行礼，仅长揖而已。李斯的狂妄，半是天性，半是蓄意。所谓大知似狂，不痴不狂，其名不彰。吕不韦半躺着，审视着李斯。尽管他不动声色，但无疑李斯已强加给他这样的印象：这是一个高傲而强悍的人，这是一个专注而坚毅的人，这是一个可以被毁灭但绝不会被打败的人，关键是，这样的人永远知道自己在做什么，并且总是心无旁骛、全力以赴。一个成功的仕途经营者，无疑也应该是一位出色的心理学家。早在当年一起就学于荀卿门下之时，李斯和韩非就游说的技巧作过无数次的探讨，并达成这样的共识：“说人之法，有如用兵之道，攻心为上。必先知所说之心，尔后方以吾说当之。”知所说之心，找出他心中最柔软的那一部分，只须轻轻一击，便足以辉煌大胜。荀卿老先生的得意高足，号称有动摇山河之志，经天纬地之才。李斯将吕不韦的举动尽收眼底，道：“普天之下，人所共知，相国为人仁而下士，士无贤不肖皆谦而礼交之，不敢以其富贵骄士。士以此方数千里争往咸阳，求归相国门下。相国敬贤爱士之名，近播大秦之境，远动六国之听。是以，诸侯以为，有秦诸相，相国最贤。”给吕不韦扣上这样一顶他非戴不可的高帽之后，李斯又道：“李斯背井离乡，抛妻弃子，远来咸阳，慕相国之名，以相国为重士也。李斯虽愚，投奔相国之心却不可谓不诚，然而方才登门，未及入室，便横遭护府武士之辱，辱之不足，又复殴之，此事为当日数十人所共见，非李斯所敢编造。此八武士不死，则天下之士必视相国之门为畏途，心寒而不敢至也。六国皆以相国之敬贤爱士为有名无实，心耻而传为笑也。以八武士之人头，回相国之美誉，换天下之归心。相国明见高远，何去何从，当不必再待李斯多言。”李斯调整了一下自己的呼吸，道：“相国以韩人仕秦，封文信侯，食十万户，金印紫绶，代理万机。秦王年少，以相国为仲父，计不下席，谋不出廊庙，大秦天下，尽托于相国一人之手。李斯道：“相国并无谋反之心，相国自知，李斯也知。然而秦王知乎？秦国知乎？以李斯之见，相国虽无谋反之心，所行却有谋反之嫌。相国大开门户，延揽天下士人，至三千之数，此乃慕虚名而处实祸也。”李斯激动地在吕不韦面前走来走去，晃得吕不韦很是眼晕。李斯边走边说：“养士如养虎。据李斯所闻，相国门下之士，只知有相国，不知有秦王，倚仗相国之权势与尊宠，儒以文乱法，侠以武犯禁，嚣张跋扈，欺凌柔弱，咸阳城内已是怨声载道，百姓皆因此迁罪于相国。相国门下蓄此猛虎三千，人虽畏之，也必疑之，谓相国有不臣之志，此则养虎又有如养祸也。信陵君以宗室之亲，养士纳贤，尚遭魏王嫌恨，无以自明，废而不用，乃沉溺酒色，郁郁而终。相国本为韩人，常言有云，非我族类，其心必异。相国虽忠于秦室，而秦人终不能信相国也。如今相国已是大权独揽，乾坤独断，秦国任君予取予求。语曰‘日中则移，月满则亏’，相国不思韬光养晦，乘盛而返，反而遍求天下之士，集于一门，非为谋反，何为此举？今日主少国疑，举国皆疑相国将仿田常代齐之故事，废秦王而自代。宗室重臣恨相国已久也，一旦以养士自重，图谋不轨为名，诬相国以谋反之罪，群起而攻之，则相国危急于累卵，而不寿于朝生也。为今之计，唯尽诛门下之士，门下之士既去，则相国无须自辩，天下已尽知相国必无谋反之心也。相国也可长为文信侯，世世称孤。当断不断，必受其乱，愿君孰计之！”李斯一笑，道：“李斯早知相国宅心仁厚，必不忍取士人之性命。夫人之立功，岂不期于成全邪？身与名俱全者，上也。名可法而身死者，其次也。名在僇辱而身全者，下也。李斯不才，却有一计，能保相国身名两全。”吕不韦原本傲慢的语气开始变得真诚而谦恭，道：“不韦鲁钝，愿得先生教之。”李斯悠悠说道：“所谓养士，重在一个养字。李斯以为，相国对门下士人娇纵太过，优其俸禄，肆其所为，不忍稍加约束之。相国以为如此厚待士人，士人必感相国之恩。殊不知，凡士人者，必自恃其才，而相国于门下士人无所任事，养之有日，用之无时，士人怀才而不得见用，长而久之，必心生怨恨，此士人之通病也。授士以金，不如授之以事，相国若能听李斯一言，则门下士人皆能各展所长，各任其用，人人皆自以为相国重己也。如是，则士人归心，相国坐收其利而不得其害。此方得养士之妙法也。”","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"历史","slug":"历史","permalink":"http://sniperkaka.com/tags/历史/"}]},{"title":"读书笔记-此间的少年-江南-03","date":"2017-01-21T15:16:09.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-03/","text":"作品：此间的少年作者：江南 61.赤条条来去无牵挂，洗净繁华，他独孤求败还就是个独孤求败，如此而已。62.独孤求败搞历史的，对这个有体会。先代的抗秦民主联盟领袖项羽冲进咸阳，立马把大秦博士们的藏书都给烧了，在那之前不久，秦始皇刚刚兴高采烈地烧了一把。而西戎诸国本来有个牛逼烘烘的亚历山大图书馆，好不容易建立起来，百年后就被另一个牛人恺撒给烧了。七百年后又有阿拉伯大将阿默尔将军操把大弯刀杀进亚历山大城，看见大堆的书，都是恺撒当年手下的漏网之鱼。阿默尔将军轻松的点根烟就要烧，士兵说将军您可别乱烧啊，也许还有些有用的书呢。阿默尔从口袋里抄出一本《古兰经》来，说这里的书我们可以用如下分类法分为两种，《古兰经》和《非古兰经》，对不对？士兵说您这二分法当然对，不过好像纯粹是废话啊。阿默尔说，《非古兰经》是邪书，要烧！士兵说有道理，那要是有《古兰经》呢？阿默尔说你没看见我手里已经有一本了么？剩下的多余，也烧，想看我这本借你看。真到了乱世，学府脆弱得如同独孤求败当年那点学术名声。63.黄蓉的横空出世彻底打乱了这个宿舍的江湖秩序，仿佛一剑西来天下俯首，合令狐冲和杨康两个人的力量，也只是刷新一下黄蓉获胜的回合数。令狐冲还好，他脸皮比较厚，输了就输了，直接当乌龟，缩头就跑。杨康就比较壮烈了，他在这个游戏上输了无数的鸡腿给黄蓉。他的习惯是先赌一条，输了先赊账，再赌两条，如果成功则可以翻本，如果失败他就继续赊账赌四条。当杨康把赌注加到512条的时候，他就彻底崩溃了，号称终身退出江湖，并且咬牙欠着黄蓉的鸡腿就是不还。堂堂两条江湖汉子，最后沦落到只能趁黄蓉拉郭靖出去蹦迪的间隙悄悄修炼武功，其中的凄惨简直让人侧目。不过趁妖女拉郭靖去蹦迪的机会能重温一下当年的光辉年代，令狐冲和杨康并没什么羞耻感。64.让我们还是沿着时间那根细线走回十年前，汴大校庆的夜晚，汴大某一栋灰色的老宿舍楼上，令狐冲百无聊赖地枕着他黑也不算很黑，黄也不算很黄的枕头，翻一本卷边的《天龙八部》。读到无名老僧说“皇图霸业不过如此”，令狐冲煞有介事地点点头，叹口气，嘟哝了一句：“这才是真正的牛人。”65.令狐冲在他对面低下头去看自己那封信，屋子里的沉默让他感觉怪怪的。他抬起头，忽然在风清扬的眼睛里捕捉到一种特殊的神情，不光是缅怀，也不光是感慨，很多微妙的情绪交织在风清扬那双已经很世故的眼睛里。66.在令狐冲的印象里，很多年以前，有个牛人路过江东，在旧日的树前也是说了什么关于树的话。他说：“树犹如此，人何以堪。”67.风像一根穿越过去和未来的线，从令狐冲背后吹来，令狐冲似乎在风的尽头看见了十年后的自己。物理学家们把时间当作世界的一个维度来处理，可是没有人见过时间这个维度如空间一样延展。大宋嘉佑二年，一个普通的汴大学生令狐冲在简陋的实验条件下——两瓶啤酒，用自己发昏的双眼验证到时间维度的存在。68.比如令狐冲以前说过：“老五你整天看女生，不烦啊？”段誉坐在学五门口的餐桌上，拿叉子挑了片牛肉，愣了一下：“不会吧？看女生你都能看烦？”令狐冲想想也是，这世界上比爱情追求更高的追求也实在不多。于是他只好说：“不过老看总有点……”段誉看了看令狐冲，很坦诚很无辜的眼神：“你想看就看了，你不喜欢好看的女生？”“喜欢……”令狐冲只能承认，他好歹也是个未婚大男人。“喜欢你为什么不看？”段誉收拾收拾去洗饭盆了，令狐冲手持一把不锈钢勺子呆在那里，刚刚被花痴精神洗礼了一次还没彻底苏醒过来。69.鸟鸣只是在乐曲的段落间传进了段誉的耳朵里，随着他深深吸了一口微凉的空气，随身听也啪嗒一声开始倒转，接下来是西域著名吟游诗人Paul Simon的作品，《The sound of silence》： Hello, darkness, my old friend, I have come to talk with you again, because a vision softly creeping left its seeds while I was sleeping, and the vision that was planted in my brain still remains within the sound of silence. 70.那个女孩就这么踏着满地黄花而来，鞋跟敲打着一首段誉无法忘记的歌谣。在人文精神浓郁的历史系混了一年，段誉当然不会不知道所谓“青青翠竹，尽是法身，郁郁黄花，无非般若”，可是那一季黄花凋谢的时候，段誉连“般若”到底是个什么玩意儿都忘记了。不是解脱，段誉把他读了十年的《金刚经》抛到了九霄云外，心里只有一种沉溺的大喜乐。71.田伯光比令狐冲他们高一届，和郭靖同系，外号叫“刀疤”。其实田伯光脸上一颗痣都没有，别说刀疤了。他真实的外号是“刀巴”——或者说就是个“色”字。72.段誉这才第一次听说那个女生的名字——王语嫣。“王语嫣你们都不知道？王黄木赵周听说过没有？”田伯光对两个晚辈的孤陋寡闻感到遗憾。“什么乱七八糟的？”令狐冲愣了一下。“校花列表，我去年更新的。王语嫣第一，接下来是黄蓉，木婉清不是你们班的么？这你身为班长都不知道？”“赵敏和周芷若差不多，不过学生会主席总应该加分，所以就把赵敏放在前面了。”73.吃完饭各自回宿舍的时候，乔峰忽然对令狐冲说：“不如打赌吧，赌一顿麦当劳，你要是能帮段誉追到王语嫣，我请你三顿，你输了请一顿就行。” 令狐冲犹豫了一下，说：“一赔三这个赔率还是小了一点，不如一赔五吧，你输了请五顿。” “你小子他妈的不是黄世仁，世界上还真就没有黄世仁了。”乔峰狠狠地啐了一口，“五顿就五顿，要赌就赌大的。” 令狐冲满怀对麦当劳的憧憬去了。74.那边更有赵志敬尹志平两个跑得飞快，足足超了段誉三次了。他们两个早上起来就赌看谁先拿到五张票，慢的早点请杭州小笼。结果这两个人都够狠，拼到第五圈上还追在一起，忍着腿脚的酸痛就是不肯放弃那小笼包子。一起从段誉身边超过去的时候尹志平还哼哼：“赵……志敬你他妈真……真狠，为……为笼包子你……你跑……跑得跟兔子一样。”75.慕容复并不在乎承认他是敏感的，他绝不是心思粗得像水泥管道的郭靖。他是慕容复，而不是任何其他人，如果他不想原谅别人对他这个外地人的轻慢，那么他绝不会逼自己装得宽容。于是在身后关上门的时候，慕容复告诉自己他不会再走进王语嫣的家门。事实证明，慕容复是一个说到做到的人。76.“我说吧。”花痴忽然胆大起来，有赌徒脱下裤子的孤注一掷之感，却丝毫不感到紧张。每个人的心都不是可以轻易看透的，令狐冲以为段誉兴高采烈地来赴这场约会的时候，段誉已经准备了一些话，用来结束这段没由来的爱情。“我暑假时候看到你的……”段誉说，“那天下雨，本来准备出去吃包子的……令狐冲，喔，是我们宿舍一个兄弟，还在睡觉……”“最近老想老想，”段誉轻声说，“脑子都有些乱了。所以……反正也好了。”王语嫣感到一瞬间的虚弱，她从来不曾听见有人慢慢地给她说一段倾慕，仿佛一本爱情小说的女主角是自己，自己却无力改变那个令人厌恶的结局。“我不知道……”王语嫣摘了一张卡片给段誉。段誉看了，那张比实际年龄还要年轻的脸上掠过一丝苦笑。写卡的人说：“不必担心失去的东西，因为你最终拥有的会遇见你，即使那不是你等待的”。段誉说：“可遇不可求，我早就知道的，可是……”“还是……算了吧……”王语嫣几乎要拼凑出一个灿烂的笑容去照亮段誉黯淡的眼神时，心里那个很野的眼神，还有另一种生活的诱惑却终于压下了她的软弱。“是么？”段誉站了起来，说，“我去一下厕所。”当段誉回到桌边，歌声寂寞地回荡，桌上空空如也，只有一张已经结账的单子，王语嫣喝了一半的珍珠奶茶还在桌上。段誉坐下来，他头上那些大红的纸片上依然写满了过去人的祝福，那未来的人真的会因为这些祝福而快乐么？段誉吸了一口冰凉的绿茶，他想王语嫣是如何走的呢？77.等待着你等待你慢慢地靠近我陪着我长长的夜到尽头别让我独自守候等待着你等待你默默凝望着我告诉我你的未来属于我除了我别无所求你知道这一生，我只为你执着，不管它喜还是悲，苦还是甜，对还是错，你知道这一生，我只为你守侯我对你情那么深，意那么浓，爱那么多。(作者按：歌词出自陈淑桦《一生守候》，大宋朝月光下的王语嫣和段誉也只有在这个故事中才会听过这首歌吧。) 78.王语嫣站在三教的楼外，又是下雨，雨下得疏狂。王语嫣就这么怔怔地看着远处的篮球场，慕容复已经不在那里。王语嫣看着他在三教的灯光下起跳投篮，远远的三分命中，也看着雨来的时候他抄起外衣和场边等待的那个女生携手离去。这个身不由己的游戏里总是很少胜利者。王语嫣捅破了段誉的肥皂泡，谁会捅破王语嫣自己的肥皂泡呢？忽然有人站在了她旁边，王语嫣吃惊的回头，才发现段誉站在她旁边。“雨太大了。”段誉说。看着段誉那张孩子气的脸，王语嫣苦笑，摇了摇头：“对不起，你别管我了好不好？”“你没有伞吧？”经过一阵子的手足无措，段誉低着头小心地说。“没关系。”段誉从后面的令狐冲手里拿了伞，走到了王语嫣身边。身边不少男生女生并着一把伞跑进了雨里，王语嫣忽然有一种彻头彻尾的无力感。“别再跟着我了！”似乎是一生中第一次，王语嫣如此失态的对别人大喊。“我只是碰巧……”段誉把伞塞到了王语嫣手里，然后一声不吭地自己走进了外面的大雨里，连串的雨水好像无数长鞭抽打下来，打得段誉身上都有些痛了。可是他什么也没有说，只是皱着眉毛看了看阴沉的天空，然后双手揣在裤子口袋里，就像一个做错了事而不敢回家的孩子那样，在雨里散步一样走远了。王语嫣忽然有一种感觉，段誉不会再走回她身边。“你也不至于连我一起虐待吧，”令狐冲伸出去阻拦段誉的手最终只好停在半空中。虽然他是去接段誉的，不过可怜他们两个人加起来也只有一把伞。79.这个时候赵敏拎着把雨伞出现在门口。令狐冲急忙凑上去，一脸特恳切的笑容：“哟，赵敏，你也跑来自习啊……”赵敏咬着舌尖，露出了她很经典的微笑：“下面你要说你没有带伞是不是啊？”“就是就是，”令狐冲急忙点头，“赵敏你那么急公好义的人，总不忍心看我淋成一只汤鸡嘛。”赵敏居然点了点头：“是喔是喔，我当然关心你喽，怎么忍心看你冒雨回家呢？”“啊？”令狐冲眉开眼笑，“那我来打伞吧？”一把黑色的雨伞忽然横在赵敏和令狐冲之间，张无忌刚从厕所里窜出来，急忙说：“我们正好多一把呢。”80.(作者按：因为篇幅和故事线索的限制，有关段誉的篇章并非结束而只是开始，但是对于这所有故事的观察者乔峰，这个故事已经到此告终。请留意《此间的少年·并未结束》，即本篇姊妹篇的进展。)81.她第一次看见杨康的时候，杨康穿了一身雪白的学生装，站在教学楼的最高层。那时候穆念慈站在操场上，蒙蒙细雨中，需要把头仰得很高才能看见那个一身雪白的男生捧着一只文件夹悠然走过，目光懒洋洋地扫过整个操场。82.一根香烟的尼古丁含量可以毒死七头骆驼。不过人体内有一种酶，可以分解尼古丁，所以它是毒不死人的。83.等杨康走到穆念慈身边，板砖已经失去了用途。杨康掂了掂砖，目送夕阳下彭连虎和梁子翁兔子般的背影。杨康把板砖放低，雪糕放到嘴边，对穆念慈笑了笑：“你叫穆念慈吧，送你根雪糕。”平生和穆念慈说的第一句话，杨康奇迹一般报出了穆念慈的名字。84.直到分岔路口，杨康家和穆念慈家就不在一条路上了。杨康觉得自己再不说就没有机会了，于是他猛地站住，用一种很小心的语气说：“穆念慈，我有件事情一直想和你说……”“什么事情……”穆念慈心里仿佛一窝兔子炸窝了，抬头看见杨康一双透亮的眼睛眨也不眨地盯着自己。穆念慈不曾想过杨康那样懒散的人也会有如此认真的时候。“能不能把笔记借我抄一下？”杨康长叹一声，“老丘的板书和鳖爬一样，我实在是看不清楚。”85.她可以是原先那个丑小鸭一样的穆念慈，她也可以把自己变成和杨康在一起的穆念慈。但是这两种穆念慈绝不可能并存，杨康是个眼高于顶的人，能看见头顶飞过的天鹅，看不见脚下经过的小鸭。那么这只小鸭鼓振单薄的双翼，是否真的能飞过杨康的视野呢？做这个选择的时候，穆念慈并不知道。看着杨康高兴地夹着笔记本跑了，那夕阳下猴子般一蹦一跳的背影，穆念慈又想起某个雨意空疏的早晨，高楼上白衣少年懒洋洋的目光。穆念慈的一生中，曾经有一次如此勇敢。86.穆念慈不知道自己是面对一张海报还是面对着镜子里的自己。长发拉得笔直，是一溪垂落的流水。穿堂的微风中，发梢婉约在她的肩上。黄蓉给配的玳瑁项链，岁月沉淀的色泽衬着她自己原本皎皎的肤色。丝绸的白色头花宛如一只大蝴蝶降落在自己头上。黄蓉说白色的衬衫很衬姐姐的脸色，于是穆念慈买了白色的衬衣。黄蓉说姐姐的腰细，腰线也高，最好穿长裙子，于是穆念慈买了亚麻色的束腰长裙。甚至连脚上镂出空花的白色袜子都是黄蓉推荐的，束着细细的脚踝，美丽得精致而优雅。87.杨康也是后来居上的少年英才。他老娘包惜弱在女性作家中是响当当的人物，杨康自幼在老娘的悲情文字熏陶下成长，颇是练了些本事。杨康的情书风格以排比铺陈为能事，一篇浩浩长文写下来，字字血泪。女生们无不以为送情书的兄弟已经暗恋自己多年，有一颗经历风雨霜雪濒临破碎的心。这时候就算对方是一头猪，她们也不忍心断然拒绝了——而必然寻求委婉的拒绝方式。88.眼见闯到自己面前的家伙非但高大而且目光寒冷，骂人的男生愣了一下，喉咙里的几句话就咽下去了。然后是几张钞票塞到他手里，对方瞟了他一眼：“赔你，行了吧？跟女生这个德性，老兄你这样的我在汴大还真没见过。”89.终于到了毕业卖旧书的时候，乔峰惊讶地发现在这方面虚竹的竞争力比他强多了。摆了一下午地摊，虚竹卖了两百多块，乔峰只卖出二十块。乔峰很不平衡，不过虚竹却晃着光头说：“我的课本比较干净嘛。” 虚竹的书是干净，他几乎从来不用自己的书，除了专业课，他都是复印乔峰的笔记混日子。而乔峰的书上除了画满黑线红线，还有乌龟兔子米老鼠……这个壮硕如土匪的人物听课听困了就喜欢在书上即兴创作，而虚竹虽然也喜欢创作，(奇书网.整理提*供)但是从来都把想到的诗句写在厕所内侧门板上。90.“你小子就是他妈的废话多，”乔峰看了看天色，“你看看什么有用都拿走。” “哎，郭靖郭靖！”令狐冲赶快起身对远处招手。一阵稀里哗啦的响动，郭靖排开人群，蹬着一辆破三轮过来了。 乔峰目瞪口呆地看着令狐冲捋起袖子往三轮上堆书，半天才反应过来：“打劫啊……有人打劫了……”91.接下来的一切如此平静，日子渐渐过去，考试越来越紧，令狐冲像一条懒了一个学期的老狗，被鞭子赶着要完成整整一个学期的任务。好在他不是孤独的，至少还有杨康老狗跟他坚强地站在同一战线上。 “嗯嗯，这个这个，”令狐冲清了清嗓子问，“大宋当前三十年经济建设的三个中心环节是什么？” “简单。”杨康答，“首先是提高丝绸制品的产量和金银的开采，保证我们可以履行对金朝纳币输绢的硬性指标；其次是大力发展畜牧养殖业，争取早日改进我们大宋的战马素质，以便在和金朝的冲突中能保证战略转移的速度；最后是拓展和蒙古的经济合作来促进我们和蒙古的军事合作让蒙古去打金朝。”92.乔峰给每人塞了一张名片，名片上写“苏州丐帮股份有限总公司：总经理助理”。93.犹豫了一下，令狐冲起身走了。走到七八米开外他回过头来：“你去的那公司我以前听说过，咱们系以前有个康敏就去的那儿吧？”","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-此间的少年-江南-02","date":"2017-01-21T15:11:13.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-02/","text":"作品：此间的少年作者：江南 31.计算机和国政的那场恶战当时是战报贴了全校的，黄纸黑字。由国政某才子拿一根墨笔足足挥洒了一百张广告，墨迹未干的时候就招贴在各个宣传栏。于是各色的家教广告和电影海报上猛然多出一条墨龙飞舞——“计算机vs国政，卷土重来！”那架势赫然是越王勾践卧薪尝胆十年后要去寻吴国报复，顿时草木萧萧杀机一片，不过其实只是上一个月国政刚输了一场。32.计算机和国政双方不过是半斤八两，不过那一天国政实在是出足了风头。康敏叫人从团委把国政那面红旗扛了出来，红旗下架着两箱矿泉水一箱可乐，还有国政系四十多名女生。康敏自己扣了顶棒球帽压住长发，一脚踩在可乐箱子上，率先挥舞着毛巾助威，乔峰的名字在一片莺声燕语中一直传到几百米外的电教停车场。康敏绝对盖过了慕容复崇拜团的所有成员，派头俨然将军临阵，看见的人无不相信评书中所谓杨门女将果真存在。33.在一众崇拜团面前，慕容复面子上终于挂不住了。比赛里心情本来就乱，那时候他根本管不住自己的手，狠狠推在康敏的肩膀上把她推倒在地上，大声吼了一句：“他妈的别靠我那么近，要不要脸啊？”马大元早就走了过来，这时候一肩膀把慕容复扛了出去：“你干什么？”“问谁呢？”慕容复根本不理睬旁边的包不同给他比眼色，“谁先挑的？你们国政会玩不会玩？谁手上不干净？都以为就自己干净？好像别人不知道你是谁一样，不要脸就在你们系里不要脸。别以为人人都让你，拉拉扯扯的，以为自己是谁啊？”慕容复的手直指康敏。34.乔峰转头看了看地上的康敏，几个女生正想扶她起来，一身的白色运动服已经沾满灰尘。康敏默默地爬起来，眼神有点呆。不是因为摔傻了，而是因为慕容复骂她。慕容复几句骂词里什么意思，所有人都听得出来，康敏当然也明白。乔峰点了点头，然后一拳砸在慕容复鼻子上，随后上去用胳膊肘捞住慕容复的脖子，用力把他掼在木板场地上。35.乔峰坐在对面，有点好奇地看着她。还是早春三月，康敏穿了裙子。将近脚踝的黑色呢绒长裙，黑色的丝袜，黑色的皮鞋，上身是贴身的黑色小毛衣，用一根黑皮带紧紧地束腰。惟有一头黑发还是按照老习惯用大幅的白手绢扎起来，随便地理在胸前。这套衣服更衬得康敏胸部丰隆腰肢纤细，颇有点体态妖娆的意思。乔峰多看了两眼，觉得有点别扭，康敏难得显得那么文静。36.“很多事情都必须经历一次，”后来，哲学家令狐冲说，“无论结果怎么着，就是得……经历一次。”37.“乔峰，”康敏抬起头看他，一只很纤细很柔软的手轻轻按了按乔峰的胸口，“自己多小心。”就这样，很简单的，康敏哭了，在夏夜的晚风里哭得像一个随时会破碎的纸人儿。有点什么噎在乔峰的喉咙里，让他很难受。“小康怎么了？”乔峰茫然地看着康敏扭头跑掉了，在花圃边没入了黑暗里。“不懂啊？”平时一向对乔峰和颜悦色的师姐忽然瞪了他一眼，“继续装傻去吧你。”38.旁边的学生都绕道走，觉得那时候的乔峰很有点黑社会老大出去砍人前的风范。那时候体育中心老是放港片，老大们出去玩命前都是风萧萧兮易水寒，大页的印刷白纸吹得窗前满地起落。这时候乔峰如果抽出一把乌兹把周围的人都摆平了，他就完美地诠释了这个场景。39.世界的某一个角落中有失落的倒霉蛋的时候，另一个角落中往往可能有兴高采烈的人。只是通常他们彼此都不知道彼此的快乐和悲伤。40.黄蓉从假寐的状态中伸了伸懒腰，表示自己醒来了。郭靖不太敢看她，拼命集中精神看物化课本，可怜他都快成斗鸡眼了。黄蓉心里有了底，这下子一扫刚才的小幽怨，笑眉笑眼地问郭靖说：“你买了芬达啊，我正好渴了。”郭靖丝毫没有意识到黄蓉只是和自己搭话，只是拼命摇头说：“乔峰……乔峰……”黄蓉斜飞了他一眼，肚里骂他笨的时候，却瞟见了郭靖的物化书。从进来图书馆开始，郭靖的物化书就再也没有翻过一页，黄蓉清清楚楚地记得书页的号码。“小样儿还跟我玩花呢……”黄蓉心里忽然有一种戏谑的快感，因为她很开心。她抬起头，郭靖额头上居然连冷汗也有了。“热啊？”黄蓉说。郭靖急忙点头：“空调太热，空调太热。”“笨！”黄蓉说，“现在是夏天，空调开冷风，有点文化好不好？”41.晚风幽幽地吹，在黄蓉用微笑鼓励并且慷慨付帐足足喂了郭靖一斤包子三碗辣糊汤之后，这个傻小子才终于有点开窍甚至可以说恍然大悟了。老破驴停在女生楼前的时候，郭靖的勇气终于攒够了，他说：“那黄蓉你明天还去图书馆么？”“去啊。”“那我来接你去吧……”42.这番讨论并没有落进校警队的耳朵里，倒是被夜里上来遛弯的楼长听了一言半语去，不过楼长只是晃晃悠悠地背着手又蹓跶下去了。他并没有傻到以为令狐冲真的有淫贼的雄心壮志，他前天上来的时候才听令狐冲说要炸掉枢密院练练身手，相比之下，拦路非礼女生这个构思在令狐冲只是小小的灵感爆发而已。况且真正的危险分子在楼道的另一侧，化学系高一年级的田伯光已经连续三个夜晚详细地探讨了聘请某位武林高手利用弹指神通谋杀大宋皇帝的可能性。43.当然，最让大家感到情何以堪的是没课的时候黄蓉整天在他们宿舍的计算机上切《侍魂II》，乃是高手中的高手。黄药师请人专门教过黄蓉输入，其结果是黄蓉用键盘发招比任何人都流畅和连贯，把原来称霸的杨康，兵器榜排列第二的令狐冲杀得狼狈逃窜，曾经创下二十人斩的记录，杨康从此再也不敢言武……(作者按：《侍魂II》是日本SNK公司的一个格斗游戏，曾被移植到PC机上，当年曾经是男生宿舍流行一时的游戏。作者曾有若干次被人十人斩的记录，由此深恨日本武士道。)44.且让郭靖和黄蓉继续培养他们的感情，我们知道这要很长的时间。千万不可以相信我们某位愤青说的话，把女孩整上床的难度完全不同于让女孩彻底爱上你，前者大概是七八年有期徒刑的难度——这个法律系的欧阳克很熟悉并且可以解释给大家听，而后者则是终生监禁。45.所以令狐冲抬起头的时候只看见夕阳下乔峰远远的影子，乔峰坐在车斗里懒洋洋地叼上根烟，握打火机的手扬起来对他随便挥了一下，嘴唇边是一种淡淡的笑容。乔峰的身影，那辆三轮，整个都要融化在夕阳的红色里。46.杨康稍微迟疑了一下，然后满面微笑地拍拍令狐冲：“令狐冲，吃完饭给你看一样东西。”“啊？什么什么？”令狐冲就是好奇心强，“拿出来看看。”“真的要看啊？”杨康笑。“废话，当然真的。”“看了我怕你把持不住哦……”“有那么夸张么？拿出来拿出来。”杨康把令狐冲刚才不小心拨拉到饭盆外面的一个米饭团翻开了给他看，里面是一只保存完好并且完全烧熟的苍蝇，正以一个很恬静的姿势缩在那团米饭中央。“知不知道我现在想干什么？”令狐冲一手掐自己的喉咙，一手掐杨康的喉咙，艰难地说着。杨康摇头，以一种很惋惜的语气说：“早叫你吃完再看吧？”47.郭靖那时候还没有撞到黄蓉，还是一条蒙古来的正宗光棍。别说国标舞怎么跳，就是连大秧歌郭靖也没怎么见识过，所以他此时张口结舌，实在无话可说。但是黄蓉变成他女朋友之后形势完全变化，在黄蓉精心培养下，郭靖成为他们宿舍蹦迪的第一爱好者。郭靖节奏感特别强，踩点也特准，黑灯照音乐起，立刻就可以把周围一片地板踩得乱颤，周围一圈女孩都觉得自己好像站在震动垫上，兴奋地拼命喊。而且郭靖体力充沛，连踩两个小时绝对没问题，最后成为汴大南门外一家迪厅的灵魂人物，把无数从别处赶来的高手都给震了。再后来他就踩碎了黄药师家小舞池的水晶地面。48.阿朱忽然有一种错觉，以为自己不是走进了舞蹈教室，而是站在某一个电影的画面中，比如《教父》。乔峰就像一个意大利的黑手党分子，站在圣堂的黑暗里，默默地欣赏遥远的歌声。那时候乔峰放在音响里的磁带是普契尼的《托斯卡》选段——Cavaradossi的“E Lucevan stelle”。此时乔峰似乎根本不属于汴大平凡的熙熙攘攘的校园，一种近乎宗教神秘的背景让一米九五的他更高得不可平视。49.当然，最打击令狐冲的还是杨康此时也嚼着口香糖从门边把脑袋探了进来，这个已经完全没有必要的援军是他实实在在花了三条鸡腿请来的。而且按照杨康的性格，他一定会不断和令狐冲一起去打饭，要把所有鸡腿都吃到肚里才会罢休。不过杨康看了一眼后的第一个念头是“不要鸡腿算了”。因为他竟然在结队来的女生中看见了穆念慈，原本不该出现的穆念慈。还没来得及拍拍屁股逃跑，郭靖在背后很惊喜地喊：“杨康，杨康，我们在这里。”就像去火车站接人那样热情而大声。既然是天意绝他，杨康也只好点点头，微笑着跟转过脸来的穆念慈打个招呼。50.欧阳克终于体会到了乔峰可怕的身高，这在他用女步来带乔峰的时候令他深感屈辱。欧阳克找到了黛依丝的感觉，或者说他就是脚不沾地被乔峰带来带去的。乔峰腿长估计要超过他十厘米以上，转圈的半径远远超过了欧阳克的能力，欧阳克要是完全凭借自己的力量跟上去，那么他就不得不做一些接近劈叉的动作。这也就罢了，关键是乔峰双手老有一个往上提然后往下压的动作，而且以一个很熟悉的频率不断的重复。当时欧阳克很不理解这种糟糕的舞蹈习惯是怎么来的，直到几个月后他看了一场乔峰的篮球赛——他忽然发现一个带球的篮球运动员只有在上篮的时候才不做这个动作。51.最无可奈何的莫过于阿朱，阿朱身材好，身高一米七，在整个班上是最高的女生。而她的舞伴陆大有，我们知道他的外号叫“猴子”。陆大有领悟力还算不错，所以阿朱迁就着他比较小的步子，舞步上是整个舞场里最和谐的一对。可是到最后阿朱忍不住放开陆大有，捂着嘴呵呵笑了起来。陆大有有点纳闷，说：“阿朱你不要笑得很狡诈的样子，我胆子可小。”阿朱说：“谁让你老是挠我的腰，我就是想笑嘛。”陆大有这才发现了问题所在，因为比阿朱矮了半个头，按照标准的姿势把右手按在阿朱的肩胛下会很吃力。所以虽然开始陆大有还记得纠正姿势，跳着跳着手就滑到了阿朱的腰间。阿朱对痒特别敏感，觉得陆大有的手像在挠她的腰，终于忍不住笑了起来。“唉，阿朱你太高了，我老有小时候爬树的感觉。”陆大有嘿嘿地笑。52.往事好像硬盘上一些唱旧的老歌，虽然已经陈旧了，甚至自己也厌倦了，但每一次翻听，好像总回到过去的日子。可惜自己已经不是过去的自己。这种反差有时候让人惶恐，有时候让人悲伤，甚至无所适从。可惜乔峰不喜欢惶恐和悲伤中的任何一种情绪，他只想抽根烟，赶快把乱七八糟的思绪都赶走，省得自己被困在一个记忆的城中。十月了，康敏已经走了四个月。乔峰不记得自己有多少次捏着一张IC电话卡从一教边的公用电话下走出来，耳边还回荡着各种声音的“不知道”。在郁郁葱葱的树边，乔峰有时候甚至有一种错觉，以为自己只要走进一教的大门，就可以看见那个黑色长裙的女孩娇媚地靠在报栏边看报。53.“要走趁早，别废话多。”乔峰的神色可以说是冷酷，“他妈的这话简单，谁都会骂，改天我教你骂点新花样出来。”随后，乔峰不理梁发带门出去，上去推了令狐冲一把：“叫剩下的人继续跳，你是班长，给点样子。”令狐冲勉强笑笑：“没事，大家继续跳，我去换磁带。”“磁带我去换。”乔峰对阿朱说，“阿朱你带带他。”乔峰的大哥风范震住了场子，其实大家对于跳舞都还是有兴趣的，随着音乐声起，很快一点点不愉快就被忘记了。陆大有甚至还很高兴，舞场显得宽多了。54.“同学借过一下。”一个很甜润的声音在乔峰背后的黑暗里。这句话对于乔峰的效果相当于有人在他背后说了一声“开水来了”，他差点吓得蹦了起来。也许是阿朱那双黑绒的舞鞋实在很软，也许是碰巧没弄出声音。她就像一只轻盈的小猫，在乔峰未曾防备的时候，已经悄悄来到了他背后。结果是乔峰虽然没有蹦，可是他猛地直起了身子，高个头让他狠狠地撞在了旁边的门框上，差点把嘴里那根烟整个给吞了。阿朱咯咯地笑个不停。55.乔峰说我知道你小子够狠，可是另外九十九个敢死队哪儿去找？凭什么大家和你一样不要命。令狐冲酒劲上来，这回真的有点激愤了。他狠狠一拍桌子：“靠！成天那么纳币输绢，你以为不死人啊？农村里每年交那么多粮食，地保都跟土皇帝一样，一年死多少人你知道不知道？这么死还不如跟我一起去炸翻黄龙府！”旁边桌子上一哥们马上举杯：“靠，炸翻丫的黄龙府！哪天去叫上我！”“别争了别争了，”阿朱赶快说，“等几年再炸不迟。”愣了一下，乔峰喷出一口酒气笑了起来，隔着桌子伸过手去拍拍令狐冲的肩膀：“你小子怕是迟早有一天让自己这脾气给害了。”“我怕啊？”令狐冲狠狠地喝了口啤酒。“你小子就是太有种，”乔峰说，“别扯黄龙府那么远，连打扫个卫生都没人跟你，谁真和你去炸黄龙府？班长干到你这个份上，算是我当初害了你。”“不是一回事吧？”“跟你老实说，还有你，”乔峰对旁边的阿朱晃了晃杯子，“班委这个东西就是个样子，能应付上面就得了，别吃力不讨好去搞什么活动。以为在高中啊？人心散得很，谁真把你们当回事儿？自己有时间把专业课拼上去，以后出国找工作都好混。”“老大你这话势利！”以乔峰的性格，别人这么说估计早瞪上眼了。可是这次乔峰出奇地安静，用令狐冲他们家乡话骂了一句：“后生仔！知道不知道岳飞怎么死的？”“怎么死的？”令狐冲对岳飞这个名字还是有点敬畏的。乔峰慢悠悠地喝了口啤酒：“给自己折腾死了。”郭靖也喝了点酒，这时候脸涨得有点红：“不是……”“先别说，”乔峰一挥手，“我只问你一个事情，你知道皇帝为什么杀他？”“后来不是给平反了么？”“那你知道那年有几个人真想跟他一起打黄龙府？”郭靖愣了一下，令狐冲也傻了。“没人，”乔峰笑笑，“就他自己拉起的事情。他就是死得他妈的太有理想了！”一片安静，乔峰自己喝了口酒。旁边那位又举杯：“为他妈死得太有理想干一杯……”“老板结账，”乔峰起身，“说真的，是为你们好。”那时候令狐冲和郭靖是被一种新思想给震傻了，只有阿朱的想法不同，她只是看见乔峰那时候说话真的很沧桑，更有点悲天悯人的无可奈何。56.一场舞会促成了一场爱情让令狐冲很开心。他开心之余就没有多余的心思去想乔峰在饭店里的话，很久以后他知道自己错过了乔峰留给他的经验，可惜他已经没有弥补的机会了。我想令狐冲那时候是个很天真的人，虽然他费力组织活动，却费力不讨好的被别人怨恨甚至责骂，可是仅仅因为促成了一段别人的感情，就让他从心底里感到快乐从而忘记了自己遭遇的不平。他没有想过乔峰的爱情到底与他有什么关系，他有什么理由为此而快乐呢？那个天真的、或者说愚蠢的孩子啊！如果研究一下令狐冲在大学一年级的执政历史，我们会发现世界上少有这种屡败屡战的悲剧英雄。他组织过春秋两次旅游，追随他的人都不超过三分之一。冬天级主任通知去系办公楼前扫雪，令狐冲千方百计抓了九个壮丁，等到办公楼前只剩下两个没来得及跑。惟一一次聚餐的出席率倒有三分之二。令狐冲足足花了两个月才收回全部聚餐费，而且怎么算总数都少了七十块。自己掏腰包填补了这个空白以后，令狐冲一直很希望下一次能发现收到的钱里多了七十多块。这样就完美地弥补了他的损失。事实上这个讨论一直持续到令狐冲他们班吃散伙饭前，也就是说，整整四年中全班名义下的聚餐不过两次，标志着一个开始和一个结束。后来的令狐冲承认也许真的如乔峰所说：“人心已散。”57.这个情况持续了两个月以后杨康彻底怒了。杨康一面勒令令狐冲每天出去自习，不到熄灯不准回来，一面拿红墨水挥洒了一张告示贴在他们屋门口：“第一，晚上十点以后领补助者杀！第二，领补助不带零钱者杀！第三，领补助不可以作为踢翻我们簸箕的理由，违者杀！第四，等待发补助只要五分钟，在此其间我们屋不提供计算机游戏帮助打发时间，所以有以等补助为名在我们屋上机者也杀！58.当年诸葛武侯缩在南阳当农民的时候，嘴里说躬耕好快乐，脚下还是忍不住要三山五岳地跑，去画军事地图。这和令狐冲当班长的道理是一样的。我们可以想象皇叔三顾的时候，卧龙其实悄悄躲在茅庐外的竹林里乐翻了天，心里说终于该我出场了么？而相对比较不幸的令狐冲没有勾引到大宋皇帝请他出山相助，所以只好龟缩在汴大里当个班长聊解寂寞。59.在令狐冲的眼里，校长只是一个符号，意味着很大的权力很高的位置。如果能当上校长，那么经常在肚子里琢磨的改革计划就可以拿出来实施了。独孤求败不是一个符号，他是一个真正的人，汴大校长。60.不是史学权威，也不是汴大校长，那么他独孤求败还是什么呢？有一次想到这个问题，独孤求败黯然苦笑，瞅瞅周围无人，在办公桌前拍案而起，亮出身架先来个叫板：“喝呀啊啊……”而后慨然唱道：“漫揾英雄泪，相离处士家。谢慈悲剃度在莲台下，没缘法转眼分离乍。赤条条来去无牵挂。哪里讨烟蓑雨笠卷单行，一任俺芒鞋破钵随缘化。”(作者按：读过《红楼梦》的朋友想必知道此一段唱深得蘅芜君赏识，大家闺秀如薛宝钗者这样欣赏鲁智深的狂禅之歌，实在是个异数。我曾经有同学说到此处，拍案说宝钗姐姐也如此狂野，在场的人都笑弯了腰。在此为记。)","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"读书笔记-此间的少年-江南-01","date":"2017-01-21T14:52:20.000Z","path":"2017/01/21/20170121-读书笔记-此间的少年-江南-01/","text":"作品：此间的少年作者：江南 读后感：1.人物性格还原的不错。郭靖与黄蓉，杨康与穆念慈，乔峰与康敏，段誉与王语嫣，一个个都那么性格鲜明，多少遗憾与无奈~~2.&lt;射雕英雄传&gt;中很不喜欢杨康，&lt;此间的少年&gt;中最喜欢的人物反而是杨康。。3.青衫磊落人海行.流年爱匆匆。不知道十年以前的江南，当他还是本科生的时候，是否会想到，当有一日回头来看这段飞扬的时光的时候，会是怎样的姿态。参考子不语书评 01 秋天是操琴的天气。很久以前，教莫大胡琴的师傅说：“春宜绘墨，秋宜操琴。”莫大那个时候还年轻，不理解，师傅也不多解释。后来经历的风霜多了，莫大才觉得领悟了。原来春水春树这种一时繁华的东西最该入画，否则就流逝了，一时好景色，过去就追不回来。而秋愁如此，最是消磨意气，惟有以胡琴的两根枯弦唱出来才略可慰藉。所以风雅苍凉如莫大者，一到秋来时，纵然是《凤求凰》这种曲子也不由得萧瑟悲凉起来。……师娘说：“你也学了那么多年了，怎么一点不长进？老鬼的意思是讲春天天气太湿磨墨方便，秋天琴弦比较干，拉起来高兴。”02 第一节 校园开学 一只脚有力地踩在了落叶上，飞驰的身影唰地刹住，虎虎有生气的少年仰面看向高悬在头顶上的四字金漆招牌，缓缓地摸出了一卷书信。 “终于到了……”少年如释重负地说。03 最后一次看了妻子苍白的脸后，黄药师以一种醉酒狂歌的豪气写成了辞职信。在第二天完颜洪烈到达办公室的第一个瞬间，黄药师踏进办公室把以前所有的论文堆在他的办公桌上，最后把辞职信狠狠地掼在完颜功烈的面前。 他一生中第一次那么像一个男人。04 郭靖低头凝视着比他矮一个头的黄蓉，黄蓉抬头凝视着他，一双来自北方的粗犷的眼睛和来自南方的慧黠的眼睛。 很多一见钟情都是从双方的凝视开始的，不过这一次的情况有点例外。05 第四节 汴京大学报到 欧阳克比较喜欢把自己称为一个色而不淫的人，不过实际上十八岁的欧阳克并不太明白色和淫的区别。这句经典的话只是他原样从叔叔欧阳锋那里搬来的。欧阳锋和黄药师互相很看得起，因为双方都觉得对方够生猛。06 黄蓉踮起了脚尖去看里面的郭靖帮她买到T-SHIRT没有，这时候那身很入时的衣服完美的勾勒出了她全身的曲线。从精致的足踝到额前的刘海，黄蓉身上所有曲线组合出了完美的青春少女。07.乔峰感觉到自己生命中的一个时代已经在娓娓落幕，可惜他是个很粗的人，所以表达不出来。他现在想起以前的一些事情，觉得很可笑，有时候，又觉得很可惜。这些事情他不愿意对什么人说，甚至他自己也快记不住了。可是看到阿朱头上的白手绢，这种感觉又悄然地浮了起来。 世界上或许没有什么人是真正粗糙的，有些人显得粗糙，只是因为他们不愿意面对一些细致的情绪。比如乔峰。 乔峰很少做梦，他甚至没有梦见过自己的老爹，可是昨天夜里他梦见了康敏。 他梦见自己拉着康敏的手走在汴大的校园中，路很长风很冷，只有康敏的手心是温暖的。银杏树的叶子在秋风中如千万黄绢小扇，盈盈坠落一个时代的梦幻，乔峰和康敏拉着手走在雨后落叶的路上，周围空无一人。面前是雾，背后也是雾，道路两边古老的房屋在雾气中朦胧，乔峰感觉到那些黑洞洞的窗口里也是空的，没有人。整个汴大的世界里都没有人，他和康敏拉着手往前走.前面没有尽头。08.郭靖和黄蓉依然跋涉在寻找化学系的道路上的时候，杨康已经不费吹灰之力的解决了报到的事情。他甚至在这个间隙和生物技术系的无崖子主任谈了谈对专业的想法，从《天工开物》的生物学意义到西域最新的克隆技术，这次谈话的直接结果是无崖子在新生名单中只记得杨康一个人。09.穆念慈确实很烦，她记性好而杨康的记性差，她就养成了帮杨康记事情的习惯。比如大家一起出去游泳，出来穆念慈很可能会问杨康你洗发水又忘在浴室里了吧。通常她问起来的时候，杨康立刻就拍拍脑袋回去拿了，而大家都惊疑于穆念慈好像与杨康用的是一间浴室……10.如果没有杨康这次“急公好义”的举动，那么郭靖应该会在一个完全不同的宿舍中度过他的大学四年，他的一生都会因为这不一样的四年而不同。所以杨康从报名处的后门窜进去的时候，命运很多扇门中的一扇也悄悄打开了，走进去的时候，所有人都茫然不觉。最后杨康帮着拿号的是四个人——穆念慈、郭靖、欧阳克、黄蓉。五个连续的号码决定了他们在汴京大学四年的生活被一根看不见的丝线连在了一起，有的时候这种联系让他们快乐，有的时候则让他们恼火。那个心情如云起云落的少年时代……11.“杨康，杨康，”郭靖在下铺敲上铺的床板，“起床起床，老丘的物化课。”杨康在生物学院下的生物技术系，可是修化学的课程。“郭靖帮我答到，”杨康说，“我请你一只学五的鸡腿。”“可是……”郭靖犹豫着，“没准今天小测验，老丘上次说的。”“你帮我写一份不就完了么？”杨康挥挥手，“而且老丘就喜欢吓唬人，别听他逗你。”“喂，”杨康在上铺喊，“告诉他们，你一个人帮我写条子就可以了，别他妈的四五个杨康，老丘不是傻子。”杨康人缘不错，丘处机以前的一次小测验里有六七个人冒充杨康帮他写了条子。丘处机一看六七个不同笔迹的杨康摆在自己面前，当天晚上就给完颜洪烈打了电话，杨康一个周末都被他老爹旁征博引地训斥。12.老大是郭靖，老二是令狐冲。老三是欧阳克，而老四是杨康。老五是段誉。老小则是林平之。13.“为什么要给金国赔款？打就打，怕什么，不灭金国几次他还以为我们大宋没种呢……不过看政府这样，确实他妈的没种！哼！”令狐冲自说自话，“起床！”14.郭靖正踩着他的二八老破驴赶往教室，这辆破驴是丘处机年轻时候骑的，他骑不动了，就转手送给了郭靖。在郭靖手上，这辆老破驴焕发了新的活力，比如前面带着段誉后面带着杨康和令狐冲这种高难度动作郭靖都做过。不过有一次杨康的跑车坏了，借郭靖的破驴回家的时候，骑到半路杨康硬是下车推着破驴回家了。“我骑它到家，还不如它骑我到家呢！”杨康后来恶狠狠地对郭靖说，“累散我了。”15.不过在活力四射的郭靖手上，老破驴还是跑得有声有色……颜色是黯淡了一点，上下都响是大家都曾听见的。那天秋雨绵绵，冰冷的雨丝敲打在汴大后面的树丛里，两边都是古老的建筑，雕檐画栋中有清澈的水滴一一打落。一路上落满了细碎的小黄花。一切的一切都在无边雨意中显得朦胧和不真实。而萧萧寒风中，郭靖猛蹬破驴，姿势英武矫健一如蒙古骑兵。16.郭靖的破驴带着一声嘶叫，艰难地想煞在黄蓉面前。这时候刚好是黄蓉翘了课从校外吃杭州小笼包子回来，她忽然看见了路边一朵不知名的花被雨水打得凌乱而狼狈。黄蓉怔怔地站在雨里看花零落，伤春悲秋的小资情绪忽然间一发不可收拾。十七岁的黄蓉觉得自己和周围的人格格不入，那个坏老爹还非常的像暴君，所以一连三个星期黄药师让司机拿车来接她她都不回家。最重要的是难道十七岁了还是一条女光棍么？何其的悲痛！黄蓉觉得自己的未来一片灰色，就像这朵正在风雨中独自凋谢的小花。这时候，郭靖如一个黑驴王子一样风驰电掣地正式闯入了黄蓉的生活。他那辆老破驴在雨水中终于没有煞住，当场把痴痴看花的黄蓉撞了个四脚朝天。设想，烟雨迷朦，白衣少女静静地在花圃前看花，清澈忧伤的眼神。而周围更是葱葱碧色，被秋天的寒雨染上了一层朦胧。雕檐画栋中的林荫小路，雨丝细细地响。忽然，黑色夹克的蒙古汉子纵驴而来。驴鸣！身影交错！17.事实上男生们更兴奋的不是郭靖的爱情问题，而是郭靖终于用亲身经历证明了流传已久的爱情战略——自行车撞人。这个战略表面上是可行的，只要撞了女同学并且积极承担责任送她去医院，向她道歉，给她买礼物，日久生情当然是很有可能的。不过其他男生似乎忽略了郭靖成功的另一些必要条件——他撞的时机好，黄蓉那时候正好心情忧郁；他撞的程度好，黄蓉刚好一个月不能随便行动而且没什么大碍；他撞的人也好，他很幸运地撞准了黄蓉而不是英语系著名的傻姑。总之，大家都觉得未来爱情有望而颇欣欣然。当然暗地里仰慕黄蓉而此时觉得失去先机的人也有，但惟有两个人是真正怒火冲天了。一个是欧阳克，理由应该很明显。一个是杨康，因为那天丘处机真的课堂小测验了……18.可惜时间不是总“嗖”地飞过去，而且时间过去了总留下一些影子。19.郭靖也实在是走投无路，丘处机在化学学院号称魔刀，盛名之下无虚士。老丘去年刀上稍添三分力道，全院三分之二的师兄师姐立刻落马，成绩单送到系主任洪七公手上，老爷子正在啃烧鸡，当时嘴大得可以把整鸡给吞了。当夜洪七公亲自到丘处机家为全院苦孩子请命，丘处机才卖了三分江湖面子，可是仍留下了十五个苦命的师兄姐。20.“你怎么来了？”很久，黄蓉才小声说。“我……”郭靖只好说实话，“我来的时候忘记我跟你说了我今天不来的。”这句缠头缠脑的话终于让黄蓉笑了笑。“傻子啊，”黄蓉心里想。不过最终是不是只有这个傻子还记得自己？肚子吃饱的感觉真好，即使自己真的很孤独，至少世界上还有这个叫郭靖的傻子……黄蓉继续低头去啃汉堡。21.郭靖并不孤愤，他总是这样笑着，笑容如此的简单而纯净。这个蒙古大草原来的家伙曾经站在夕阳下看着他母亲和马队羊群一起回来，也曾在暴风雨里面和旗里其他人一样保护那些满是膻味的蒙古包……那些时候，他一定也是这样傻呆呆地笑容吧？窗外寒雨依旧飘洒的时候，黄蓉感觉到一种久违的温暖。22.黄蓉很高兴，她特别乐意把那些从小收藏的宝贝给郭靖看，比如树袋熊的娃娃或者带史奴比的小背包，然后说她如何得到的故事。高兴起来她就把一些东西送给郭靖，结果后来郭靖在他二十块钱买的“三菱”背包上捆着黄蓉送给他的樱桃小丸子，并且很仔细的从有蓝精灵头像的小笔袋里拿他的橡皮，甚至床头多了全套的修指甲工具。令狐冲几乎要崇拜得晕过去，他说他做梦也没有想到郭靖那种极端的威猛能搭配小资情调。在令狐冲看来，欧阳克这么做是正常的，而郭靖这么做无异于一个蒙古骑兵骑着一只米老鼠。有一次令狐冲排在郭靖后面打饭的时候揪着他的樱桃小丸子说：“老大，这到底是什么？”郭靖很认真地重复了从黄蓉那里学到的新名词：“公仔。”“那请问您能不能解释一下您为什么要背着她呢？”令狐冲把勺子柄凑到了郭靖嘴边。“黄蓉说很流行的耶……”令狐冲当即把每顿固定的四两饭减到三两，一天后那句“很流行的耶”就成了所有人问候郭靖的话。而郭靖只是愣愣地眨眨眼睛，根本不记得自己曾经说过了。由此我们可以看见一个小资女孩是怎样毒害豪迈粗犷的有为青年……23.惟一一次例外，黄蓉看见郭靖竟然怔怔地看着自己裙子下，小脸顿时绯红。她一直觉得自己的身材很好，小腿的曲线也很好看，所以她立刻设想郭靖是发现她的好看了。谁知道郭靖笑着指着黄蓉的白袜子说：“上面那只黑猫好像小时候看的黑猫警长。”24.郭靖也只好说没事，悄悄闪过楼长的窗口，直窜四楼而去。就着报栏的灯光，尹志平正两眼通红地看黄易的《破碎虚空》，这时候只感觉嗖的一声风过，抬头愣愣地看了半天，半个人影也没有。“真他妈的见鬼了,”尹志平嘟哝了一声，拎了凳子回宿舍了。仅仅五分钟后，也是两眼红通通的赵志敬兴高采烈地拎着凳子窜了出来，占领报栏下的灯光宝地，继续攻读尹志平刚才那本《破碎虚空》。25.“人满了。”郭靖扭头看黄蓉。黄蓉扁了扁小嘴，扯了扯郭靖的胳膊说：“先别走，我去商量一下。”黄蓉松开郭靖，一跳一跳地到一个男生身边说：“对不起，同学，你身边可以坐人么？”大家可以想象当时如果不是爱惜他明天要交的作业，那个兄弟鼻血都快流了一桌子了。美女直接要求和他坐一起，他除了点头还能干什么？不过好在汴大的学生们修养都还不错，就是比较拽，那个男生不露声色地把自己的书本往旁边扫了扫，只是对黄蓉露齿微笑。于是黄蓉把自己的书包放在了那个男生旁边。她立刻跑到图书馆另一边，选了其中看起来最顺眼的男生，凑上去很淑女地问：“同学，我在那边有个位子，我们换个座位可不可以？那边空调太凉，我觉得冷……”那个男生抬起头来看着黄蓉上身薄薄的白色小背心，心里说：“哟，妹妹，你穿这样能不冷么？”在黄蓉灿烂的笑容下，他矜持地点点头，收拾起了自己的书包。于是黄蓉微笑着把他引到刚才的男生身边坐下，然后拉起郭靖的手，和他肩并肩的坐在了空出来的两个位置上。26.乔峰觉得男人应该比较生猛，而且他一直往这个方向努力着。最初进校的时候，乔峰经常大汗淋漓地转着个球跑回宿舍，气喘吁吁地歪歪嘴巴说：“靠，刚才打球，我们四对五，物理系的小子还犯规，真他妈没劲。”这时候乔峰的哥们就会问：“输啦？”“才赢了二十分，”这时候乔峰就会一边脱背心，一边用很不满的口气表示自己这次赢得太少了。那时他的哥们毫无疑问地会赞叹：“这么猛？”于是乔峰就很高兴。27.“女朋友漂亮嘛！”乔峰很赞赏郭靖的眼光，“什么时候请客？”郭靖刚要分辨，乔峰却已经隔着郭靖探过身子对黄蓉说：“我们郭靖人可好，找到他错不了，请客请客……师妹哪个系的？”黄蓉脸上一红，心里乱乱的，也忘记反驳乔峰，只是低声说：“物理系。”28.黄蓉嘟嘟嘴说：“笨！”黄蓉最终只是轻轻叹了口气，随便抽了一本书回到郭靖身边坐下。郭靖说：“你喜欢阿拉伯语么？”“不喜欢。”黄蓉有点赌气地看着他。“那你为什么拿阿拉伯语的教材？”黄蓉只好对郭靖笑了笑并且暗地里狠不得拿那本阿拉伯语狠狠地砸他脑门一下，然后继续看那本叫《众神之车》的伪科学。29.迟疑了很久，郭靖偷偷用手背碰了碰黄蓉的头发。黄蓉的眼睛偷偷睁开，她听见郭靖竟然破天荒地叹了口气。走廊外的乔峰也看见了郭靖很贼地碰了碰黄蓉的头发，这一次他没有喳喳呼呼的闯进去拍郭靖的肩膀，只是愣了一下，然后小步走进去。他手里拿着三杯苹果芬达，给郭靖和黄蓉各一杯后，乔峰摇摇手让郭靖不要说话打搅黄蓉睡觉。然后，乔峰悄悄拾起自己的书包，吸着最后一杯芬达走了出去。30.寒假乔峰第一次去团委办公室，刚刚推开门，就看见了一个女孩，一双黑布鞋，紧身的黑毛衣和黑长裤，只有一束乌黑的长发是用白手帕扎起来垂在胸口的。她一身黑，很俏地站在三只凳子的顶端给日光灯换灯泡，下面是三个男生在帮她递灯泡。乔峰看见那个女孩踮起脚尖的时候，全身弧线都是青春活力得没救了，心情忽然就很好。","tags":[{"name":"小说","slug":"小说","permalink":"http://sniperkaka.com/tags/小说/"}]},{"title":"Game Development Guide","date":"2017-01-18T05:54:51.000Z","path":"2017/01/18/GameDevelopmentGuide-wjingzhe-20170118/","text":"###Game Development Guide ####新手指引Just give out some experience or directions on game development to green hands.分享经验或路线给新手们 ###游戏类型：手游、端游、页游、家用游戏（电视） ###游戏相关职位： ####客户端： 游戏逻辑（常见功能和特色功能开发），将用户体验做到极致，未来方向应该是主程、游戏制作人和游戏玩法创新。C#或Lua、js。 游戏引擎（主线、物理、渲染、特效、AI、资源管理、调试工具、跨平台适配等），可以拓展为架构师、AI、图形学等高级方向。C++、设计模式、算法、AI、OpenGL、DX、STL、Boost等和数学. 游戏工具（UI编辑器、场景编辑器、剧情编辑器等），和普通软件开发有点类似，以上都会涉及到，但方向和架构师、AI交集不多 ####服务端：（本人不熟悉） ###DBA或运维： 和这个职位有很多相关，我列举不出来，在较多情况下 服务端逻辑：游戏服务端的主要实现，发展方向是服务端主程，和客户端主程、主策一起商讨游戏实现的模块划分 服务端架构：登陆服、游戏服、子功能系统（如充值）等架构的涉及与实现，略高端，只能说跟着好团队走，做一款多用户游戏就知道得比我多。 ####美术： 角色原画、骨骼、特效：美术特效要求会3Dmax或Maya，同时配合画工。在办公室中你总能看到某个同事拿着一根棍条或纸筒耍武功~ 场景等，要求画工、电子绘画、PhotoShop，还要看画风等。艺术家的世界我不懂~我只知道UI是个坑，除非你的定位是UI设计师 ####策划：Office，必学。偶尔学点photoShop、美学、flash相关。 主策：这一般混着混着就变成制作人啦，什么是制作人——设置游戏大主题、玩法、找钱、演示——大部分时间跟别人吹水。这个职位要求一专多能，同时也要有工程管理能力，也是个深度游戏玩家。好吧，大佬们多多少少在此职位待过，有些东西是天生的他们手下一般带着一个执行策划，未来接班人。 主数值：神一样的职位，花钱的主最该问候的人，也是游戏生命力的控制者。GM得听他的专业意见。主数值去构想各种公式或经济模型想想某些大世界的经济系统，想想不同角色职位技能的差别和种族天赋差异在战斗中被一条条公式放大，Balance the world。比如IF们经常干的事修正某个英雄的技能和数值，比如LOL的出兵时间控制，比如SC的兵种数值调整之类职位要求：数学——应用数学和玩游戏 剧情策划（文案）：别指望分开写小说的。要求文字功底、游戏底蕴，丰富的空间想象力和历史知识，配上点特质，可以考虑些剧本去拍电影——一般是传说 中玩弄着文字做贱自己的人 场景策划：庄周梦蝶，想象一个世界，让美术去堆砌呈现给玩家。在MMO中是个重要的职位，因为他负责大局，在场景上放置剧情点。从这个角度上看，剧情策划主要负责细节实现 系统策划：玩法设计，一般也是执行策划。骨灰级玩家，天生的控场者，只不过是他的场是游戏世界而不是party或大型活动。灵活的思维加上大智若愚的耐性，同时要有工程思维。这是个和设计师有点联系的职位——灵感建立在对生活和文化的深度理解之上 特效策划：绚烂的技能来自这个大脑。要求对运动学、人体筋肉系统、物理学有一定了解，这样子给的特效想法容易实现，美术容易配合——前提哪个游戏抄的？（深度玩家啊） 活动策划：应该属于运营。 可行性：策划绕不开的话题，在恢弘的设计也要建立团队的实现能力。要不然有两个结果，1程序放个大招：实现不了，2项目崩掉。别指望3，要用工程学去评估而不是赌小概率，除非你能确定你的团队中都是狠角色（也许他们不知道自己的潜力）如果什么都不会，哪怎么办？恭喜你，策划行业除了要求玩的游戏有深度和广度，没什么其他门槛，跟着坑，给个好态度给老大就行了。 ####运营：Office系列， 高级运营：制定游戏运营的主策略：长线短线，一般会有个跨期为游戏生命力的计划书，并不断调整。期间审核活动运营给点的活动确认和大方向无冲突。数值运营的数据报告则是确认前期的运营策略是否适合此游戏或市场，就跟我们的经济部老大一样。至于评估游戏世界健康的指数我还不知道。经济学相关专业 数值运营：给主数值打杂或者兼职。为主数值提供反馈或用数据去拟合来说明某件事。数学、SPSS类似软件、Excel，甚至可以考虑学MATLAB方向的数学编程 活动运营：保证游戏世界的新鲜感和趣味性。和活动策划是同个职位，但是放在这里是因为活动是建立在后台数值上。一般结论是数值运营给的或者自己做一份数据报表分析出下个活动的类型 ####推广：经验积累。你的朋友是腾讯、百度、阿里、新浪等媒体相关职位的，或者认识各种推广团队，随便挑公司吧。 ####商务：原谅我没追过商务妹子——陪老大出差，谈合同，准备材料，喝点酒。 ####法务：如果你是个蔡崇信，请让借我一条大腿。实际上没有多少法学的朋友选择游戏相关职位，因为没有多少公司有这个职位。 ####运维：很多时候由服务端的DBA负责。但是也有专门的运维部署职位。linux、shell、python分支的方向之一 ####音效：我曾经冲着某个游戏的音效投了某个公司，可是没接触不到相关东西我就离职了。 ####工程思维：一个被反复提及的名词，游戏是个工艺品艺术品的前提。只有良好的工程管理系统才能大量的生产产品。我的工程思维是来自一本被大学学子唾弃的教程《软件工程》，其实这在土木工程中是非常普遍的。一般这个是本科和专科培训院的区别标志 ——————————————————————————引用内容———————————————————————————————————————————————————————————————————————————————————————————————————————————————————如果要自学游戏程序开发的话，可以考虑选个方向。我主修改客户端的，因为下面的内容主体是另外的网友写的。 1、C/C++、数据结构、算法导论、设计模式（学校或培训吧） 2、游戏PDF书及其代码：3D游戏编程、3D游戏编程大师技巧、Direct3D游戏编程入门教程第2版、DirectX角色扮演游戏编程DirectX特效游戏程序设计、VC++深入详解、（MFC windows程序设计第2版、MFC深入浅出、Visual C++6.0技术内幕第5版、Visual C++视频技术方案宝典、）括号内的可以考虑放弃，MFC实用性没了，只剩下一个设计思想，在时间不是很宽裕的情况下挑个游戏开源引擎已经足矣，VS用最新版本，这是广工的老师说的，他跟我说了几句话，全被证实是对的，这是其中一句——蓝玉Win32多线程程序设计、Windows程序设计、WINDOWS核心编程————侯捷精通DirectX 3D图形与动画程序设计、设计模式解析第2版、游戏开发物理学、3D数学基础 图形与游戏开发 上述的书籍我也没全看，看了一小部分，因为我不是按照这个教程来的，我也存在较多的知识体系缺陷——蓝玉 3、C++PDF书及其代码：C++STL程序员开发指南、C++编程规范、C++标准程序库自修教程与参考手册、Essential c++ 中文版Exceptional C++中文版、Inside the C++ Object Model、高质量C++编程指南、经典C程序100例深度探索C++对象模型、深入探索C++物件模型、自己动手写操作系统、代码优化：有效使用内存Effective C++、Effective C++ 第二版中文版、More Effective C++(中文版) 4、数据库SQL PDF书： （服务端必备）SQL网络编程实例、精通Oracle9i、精通Oracle 10g Pl SQL编程 5、Ogre3D PDF书及其代码：Apress-Pro Ogre 3D Programming、OGRE中文帮助手册 v1.4.0、PRO OGRE 3D PROGRAMMING中文翻译版本0.2.0 6、人工智能PDF书及其代码：AI游戏引擎程序设计、人工智能游戏编程真言、游戏编程中的人工智能技术、游戏开发中的人工智能游戏人工智能编程案例精粹 7、游戏开发网络编程PDF书及源代码：C++网络编程卷1&amp;2、Network Programming For Microsoft Window、Visual C++实践与提高-网络编程篇Visual C++网络通信编程实用案例精选第2版、Visual C++网络游戏建模与实现(第2版)、Windows SocketsWindows网络与通信程序设计、韩国传奇正式最终版本源码、网络游戏服务器编程、游戏学院网络游戏服务器端编程最新传奇M2引擎程序源码、Internetworking with TCP_IP Vol 3 Client-Server Programming And ApplicationsPC游戏编程（网络篇）、Visual C++.NET网络编程、Winsock规范及应用、传奇3源程序、魔域服务端源码+客户端源码盛大传奇外挂源代码 当然你也可以进我们的Recca2 Studio大群195660307讨论技术实现。 Recca是金山的一个著名工作室，当年发生了一些事，后来大神们各奔东西。后来行业有不成文的约定，不再恶意挖角对手，因为挖来的人也不能用。 原作者总结的网络游戏程序开发学习流程，这是最少要看的书了： 本人蓝玉看了大部分，推荐1. C++primer中文版第4版2. C++标准程序库自修教程与参考手册3. Windows程序设计第5版4. MFC windows程序设计第2版中文版5. VC++深入详解6. MFC深入浅出7. Effictive STL8. Windows核心编程学好以上几本，也可以去游戏公司一试VC++软件工程师职位了。9、WINDOWS游戏编程大师技巧第2版10、3D游戏编程大师技巧11、DirectX角色扮演游戏编程12、DirectX特效游戏程序设计13、精通DirectX 3D图形与动画程序设计14、DirectX高级动画制作15、Ogre引擎研究16、游戏人工智能编程案例精粹17、Visual C++实践与提高–网络编程篇18、C++网络编程，卷119、C++网络编程，卷220、Visual C++网络游戏建模与实现第2版21、代码优化：有效使用内存22、编个Demo出来，好好复习一下C++和数据结构，然后去游戏公司应聘。另外，游戏编程精粹1-6，GPU精粹1-2，也是好书，很多游戏开发者看的。以后可以看看。 以上的书和教程有些老旧，还是以叶劲峰推荐的为主更加好，无聊的话看上面的书会好一点（基本是中文书） 还有千万别信那些什么所谓的游戏学院会把你培养起来，在他们那里想学好游戏是很难的，他们教的都是皮毛，公司用不上，还有他们提出分配工作几乎不可能实现，现在游戏公司宁愿要计算机大专毕业生也不敢要游戏学院的，啥也不懂，你真想好好学的话自己可要下点苦心 吾等如神般降生，必将如神般笼罩这片大地。 ###参考链接wjingzhe/GameDevelopmentGuide","tags":[{"name":"GameDev","slug":"GameDev","permalink":"http://sniperkaka.com/tags/GameDev/"}]},{"title":"微观尽头_刘慈欣","date":"2016-12-13T02:01:50.000Z","path":"2016/12/13/1987-微观尽头-刘慈欣-20161213/","text":"微观尽头作者：刘慈欣日期：1987 今天夜里，人类将试图击破夸克。 这个壮举将在位于罗布泊的东方核子中心完成。核子中心看上去只是沙漠中一群优雅的白色建筑，巨大的加速器建在沙漠地下深处的隧道中，加速器的周长有150 公里。在附近专门建了一座100 万千瓦的核电厂为加速器供电，但要完成今天的试验还远远不够，只能从西北电网临时调来电力。今天，加速器将把粒子加速到10^20 吉电子伏特，这是宇宙大爆炸开始时的能量，是万物创生时的能量。在这难以想像的能量下，目前已知的物质最小单位夸克将被撞碎，人类将窥见物质世界最深层的秘密。 核子中心的控制大厅中人不多，其中有目前世界上最杰出的两位理论物理学家，他们代表着目前对物质深层结构研究的两个不同的学派。其中之一是美国人赫尔曼。琼斯，他认为夸克是物质的最小单位，不可能被击破；另一位是中国人丁仪，他的理论认为物质无限可分。 控制大厅中还有负责加速器运行的总工程师以及为数不多的几名记者，其他众多的工作人员却在地下深处的十间分控室内，控制大厅只能看到综合后的数据。这里最让人惊奇的人物是一位叫迪夏提的哈萨克族牧羊老人，他的村庄就在核子中心加速器的圆周内。在昨天的野餐中，物理学家们吃了他的烤全羊，并坚持把他请来。他们认为这个物理学上的伟大时刻，也是全人类的伟大时刻，所以应该有一个最不懂物理学的人到场。加速器已经启动，大显示屏上的能量曲线像刚苏醒的蚯蚓一样懒洋洋地爬着，向标志着临界能量的红线升去，那就是击碎夸克所需的能量。“电视为什么不转播”丁仪指着大厅一角的一台电视机问，电视中正转播着一场人山人海的足球赛。这位物理学家从北京到这儿一直身着一件蓝工作服，很容易被误认为是勤杂工。“丁博士，我们并非世界中心，试验结果出来后，能出一条三十秒的小新闻就不错了。”总工程师说。“麻木，难以置信的麻木。”丁仪摇摇头说。“但这是生存之必须。”琼斯说，他一副颓废派打扮，头发老长，还不时从衣袋中掏出一个银制酒瓶喝一口，“我很不幸地不麻木，所以难以生存下去。” 他说着掏出了一张纸，在空中晃着，“先生们，这是我的遗书。” 语惊四座，记者们立刻围着了琼斯。 “这个试验结束后，物质世界将不再有什么可以探索的秘密，物理学将在一个小时内完结！我是来迎接自己世界的末日，我的物理学啊，你这个冷酷的情人，你已穷尽之后我如何活得下去！” 丁仪不以为然地说：“这话在牛顿时代和爱因斯坦时代都有人说过，比如上世纪的马克斯。玻恩和史蒂芬。霍金，但物理学并没有结束，将来也不会结束。您很快就会看到，夸克将被击破，我们在通向无的阶梯上又踏上一级，我是来迎接自己世界的早晨！” “您这是抄袭毛**的理论，丁博士，他在上世纪50年代就提出物质无限可分的思想了。”琼斯反唇相讥。“你们过分沉湎于自己的思想了。”总工程师插进来说，“通过阳光同一时刻在埃及和希腊的干井中不同的投影，可以推测出地球是圆的，甚至由此可以计算出它的直径，但只有麦哲伦的旅行才是真正激动人心的。你们的这些理论物理学家以前只是呆在井里，今天我们才要在微观世界做真正的环球航行！”大屏幕上，能量曲线接近了那条红线。外面的世界似乎觉察到了这沙漠深处涌动的巨大能量，一群鸟儿从红柳丛中惊飞，在夜空中久久盘旋，远方传来阵阵狼叫……终于，能量曲线越过了红线，加速器中的粒子已获得了撞击夸克所需的能量，这是人类有史以来所获得的最高能量的粒子。控制计算机立刻把这些超能粒子引出了加速器周长150 公里的环道，进入一条支线，以接近光速的速度向靶标飞去。在这极限能量的轰击下，靶标立刻迸发出一场粒子辐射的暴雨。无数个传感器睁大眼睛盯着这场暴雨，它们能一瞬间分辨出暴雨中几个颜色稍有不同的雨滴，正是从这几个雨滴的组合中，超级计算机将判断出是否发生了撞击夸克的事件，并进一步判断夸克是否被撞碎。超能粒子在源源不断地产生，加速器中的撞击在持续，人们在紧张地等待着。超能粒子击中夸克的几率是很小的，他们不知道要等多长时间。“哦，来自远方的朋友们，”迪夏提老人打破沉默，“十多年前，这些东西开始修建时我就在这里。那时工地上有上万人，钢铁和水泥堆得像山一样高，还有几百个像大楼一样高的线圈，他们告诉我那是电磁铁……我不明白，这样多的钱和物，这样多的人力，能灌溉多少沙漠，使那里长满葡萄和哈密瓜，可你们干的事情，谁都不明白。“迪夏提大爷，我们在寻求物质世界最深的秘密，这比什么都重要！”丁仪说。 “我没有读过多少书，但我知道，你们这些世界上最有学问的人，在找世界上最小的沙粒。” 哈萨克老牧人对粒子物理出色的定义使在场所有的人都兴奋起来。“妙极了！”琼斯在听到翻译后叫起来，“他认为，”他指指丁仪，“沙粒要多小就有多小；而我认为，存在最小的沙粒，这粒沙子不能再小了，用最强有力的锤都不可能砸碎它，尊敬的迪夏提大爷，您认为我们谁对呢”迪夏提在听完翻译后摇了摇头：“我不知道，你们也不可能知道，世界万物究竟是怎么回事，凡人哪能搞清呢”“这么说，您是一位不可知论者”丁仪问。老牧人饱经风霜的双眼沉浸在梦幻般的回忆中：“世界真让人想不透啊！从小，我就赶着羊群在无边的戈壁滩上寻找青草。多少个夜晚，我和羊群躺在野外，看着满天的星星，那些星星密密麻麻的啊，晶亮晶亮的啊，像姑娘黑发中的宝石。夜深时，身下的戈壁还是热的，轻风一阵阵的，像它的呼吸……这时世界是活的，就像一个熟睡的大娃娃。这时不用耳朵，而用心听，你就能听到一个声音，那声音充满天地之间，那是真主的声音，只有他才知道世界究竟是怎么回事。”这时，蜂鸣器刺耳地响了，这是发生夸克撞击事件的信号，人们都转向大屏幕，物理学的最后审判日到了，人类争论了三千年的问题马上就会有答案。超级计算机的分析数据如洪水般在屏幕上涌出，两位理论物理学家马上发现事情不对，他们困惑地摇摇头。结果并没有显示夸克被撞碎，但也没有显示它保持完整，试验数据完全不可理解。突然，有人惊叫了一声，那是迪夏提，这里只有他对大屏幕上撞击夸克的数据不感兴趣，仍站在窗边：“天啊，外面怎么啦，你们快过来看啊！”“迪夏提大爷，请别打扰我们！”总工程师不耐烦地说，但迪夏提的另一句话使所有人都转过身去。“天……天怎么啦！”一片白光透进窗来，大厅中的人们向外看去，他们不相信自己的眼睛：整个夜空变成了乳白色！人们冲出了大厅，外面，在广阔的戈壁之上，乳白色的苍穹发着柔和的白光，像一片牛奶海洋，地球仿佛处于一个巨大的白色蛋壳的中心！当人们的双眼适应了这些时，他们发现乳白色的天空中有一群群的小黑点，仔细观察了那些黑点的位置后，他们真要发疯了。“真主啊，那些黑点……是星星！”迪夏提喊出了每个人都看到但又不敢相信的结论。他们在看着宇宙的负片。震惊之中，有人从窗外注意到了大厅中的那台正在转播球赛的电视机，屏幕上的情形证明了他们不是在做梦：千里之外的体育场也笼罩在一片白光中，看台上的几万人都惊恐地仰望着天空……“这是什么时候发生的”首先镇静下来的总工程师问。“刚才里面那个声音响起来的时候。”迪夏提说。人们沉默了，他们把目光都集中到琼斯和丁仪身上，希望这两位自爱因斯坦以来最杰出的物理学家，能对眼前这噩梦般的现实做出哪怕一点点解释。这时，两位物理学家已不看天空了，他们都在低头沉思。顷刻，丁仪首先抬起头来仰望着乳白色的宇宙，长长地出了一口气。“我们早该想到的。”他说。琼斯也抬起头来，望着丁仪：“是的，这就是超统一理论方程中那个变量的含义！”“你们在说什么”总工程师喊道。“工程师，我们的环球航行成功了！”丁仪笑着说。“你是说，是我们的试验导致了这一切”“事实正是！”琼斯说，同时掏出了那个银酒瓶，“现在麦哲伦知道了，地球是圆的。”“圆……的”其他的人都困惑地看着两位物理学家。“地球是圆的，从其表面任一点一直向前走，就会回到原点。现在我们知道了宇宙的时空形状，很类似。 我们一直向微观的深层走，当走到微观尽头时，就回到了整个宏观。加速器刚才击穿了物质最小的结构，于是其力量作用到最大的结构上，把整个宇宙反转了。“琼斯解释说。丁仪说：“琼斯博士，您可以活下去了，物理学没有完结，才刚刚开始，就像人类知道地球形状后，地理学刚刚开始一样。我们都错了，要说最接近事实的论述，是迪夏提大爷刚才说的，我虽不相信真主，但宇宙之深奥之神奇远远超过了我们的想像。” “我想起来了，上世纪，英国人阿瑟。克拉克在科幻小说中提出过宇宙负片的概念，但谁会想到它竟成为现实呢”“可现在怎么办”总工程师问。“现在很好，我很乐意生活在负片宇宙中，它和反转前的同样美，不是吗”琼斯喝干了瓶中的酒，微醉着伸开双臂，像要拥抱整个新宇宙。“可你们看……”总工程师从窗口指了指大厅里的电视，体育场里惊恐的骚动在加剧，一种集体的歇斯底里在人海中蔓延开来。从这个画面上可以想像，整个人类世界正陷入混乱之中。“继续轰击靶标。”丁仪对总工程师说。在第一次夸克撞击事件发生后，为了分析结果，控制计算机已中止了超能粒子对靶标的轰击。“你疯了鬼知道第二次夸克撞击事件会产生什么效应，也许会造成宇宙坍缩或大爆炸！”“不会的！前面的现象已证明了超统一方程的正确，我们知道下一次撞击会发生什么。”琼斯说。加速器中的超能粒子再次被引向靶标，人们期待着粒子的暴雨中那几滴不同颜色雨点的出现。1 分钟，2 分钟…… 10 分钟……各种曲线和数据在大屏幕上懒洋洋地滚动着，什么都没发生。电视屏幕上，体育场中的人海已失去了控制。在乳白色的天空下，人们无目标地乱撞，互相践踏……图像抖动了一下，电视信号中断了，屏幕上只有一片荒漠一样的雪花。宇宙的突变超出了人类所有的知识和想像，超出了他们的精神承受力，世界已处于疯狂的边缘。蜂鸣器第二次响了，夸克第二次被击中。没有任何预兆，比眨眼的速度更快，宇宙再次被反转。漆黑的夜空，晶莹的星群，人类的宇宙又回来了。“天啊，你们在干真主的事！”迪夏提大爷说。核子中心的人们这时都聚集在外面的戈壁滩上，聚集在醉人的星空下。“是的，对物质本原的不懈探索使我们拥有了上帝的力量，这真是做梦都想不到的。”琼斯说。“但我们仍是人，谁知道以后还会发生什么呢”丁仪说。 人们全都静了下来，凝望着夜空中灿烂的群星，似在谛听那若有若无的流淌在整个宇宙间的曼妙乐曲。 “真主啊……”迪夏提大爷对着星空伏下身来。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"}]},{"title":"坍缩_刘慈欣","date":"2016-12-12T08:36:35.000Z","path":"2016/12/12/20161212-1985坍缩-刘慈欣/","text":"坍缩作者：刘慈欣日期：1985 坍缩将在凌晨1时24分17秒时发生。 对坍缩的观测将在国家天文台最大的观测厅进行，这个观测厅接收在同步轨道上运行的太空望远镜发回的图象，并把它投射到一面面积有一个蓝球场大小的巨型屏幕上。现在，屏幕上还是空白。到场的人并不多，但都是理论物理学、天体物理学和宇宙学的权威，对即将到来的这一时刻，他们是这个世界上少数真正能理解其含义的人。此时他们静静地坐着，等着那一时刻，就象刚刚用泥土做成的亚当夏娃等着上帝那一口生命之气一样。只有天文台的台长在焦燥地来回踱着步。巨型屏幕出了故障，而负责维修的工程师到现在还没来，如果她来不了的话，来自太空望远镜的图象只能在小屏幕上显示，那这一伟大时刻的气氛就差多了。 丁仪教授走进了大厅。 科学家们都提前变活了，他们一齐站了起来。除了半径二百光年的宇宙，能让他们感到敬畏的就是这个人了。 丁仪同往常一样的目空一切，没有同任何人打招呼，也没有坐到那把为他准备的大而舒适的椅子上去，而是信步走到大厅的一角，欣赏起那里放在玻璃柜中的一个大陶土盘来。这个陶土盘是天文台的镇台之宝，是价值连城的西周时代的文物，上面刻着几千年前已化为尘土的眼晴所看到的夏夜星图。这个陶土盘经历了沧海桑田的漫长岁月已到了崩散的边缘，上面的星图模糊不清，但大厅外面的星空却丝毫没变。 丁仪掏出一个大烟斗，向一个上衣口袋里挖了一下，就挖出了满满一斗烟丝，然后旁若无人地点上烟斗抽了起来。大家都很惊诧，因为他有严重的气管炎，以前是不抽烟的，别人也不敢在他面前抽烟。再说，观测大厅里严禁吸烟，而那个大烟斗产生的烟比十支香烟都多。 但，丁教授是有资格做任何事情的。他创立了统一场论，实现了爱因斯坦的梦。 他的理论对宇宙大尺度空间所作的一系列预言都得到了实际观测的精确证实。后来，使用统一场论的数学模型，上百台巨型计算机不间断地运行了三年，得出了令人难以置信的结论：已膨胀了二百亿年的宇宙将在两年后转为坍缩。 现在，这两年时间只剩不到一个小时了。 白色的烟雾在丁仪的头上聚集盘旋，形成梦幻般的图案，仿佛是他那不可思议的思想从大脑中飘出…… 台长小心翼翼地走到丁仪身边，说：“丁老，今天省长要来，请到他不容易，请您一定对省长施加一些影响，让他给我们多少拔一些钱。本来不该用这些事使您分心的，但台里的经费状况已到了山穷水尽的地步，国家今年不可能再给钱，只能向省里要了。 我们是国内主要的宇宙学观测基地，可您看我们到了什么地步，连射电望远镜的电费都拿不出，现在，我们已经开始打它的主意了，“台长指了指丁仪正欣赏的古老的星图盘，”要不是有文物法，我们早就卖掉它了！“ 这时，省长同两名随行人员一起走进了大厅，他们的脸上露着忙碌的疲惫，把一缕尘世的气息带进这超脱的地方。“对不起，哦，丁老您好，大家好，对不起来晚了。 今天是连续暴雨后的第一个晴天，洪水形势很紧张，长江已接近一九九八年的最高水位了。“ 台长激动地说了许多欢迎的话，然后把省长领到丁仪面前，“下面请丁老为您介绍一下宇宙坍缩的概念……”他同时向丁仪递了个眼色。 “这样好不好，我先说说自己对这个概念的理解，然后请丁老和各位科学家指正。 首先，哈勃发现了宇宙的红移现象，是哪一年我记不清了。我们所能观测到的所有星系的光谱都向红端移动，根据开普勒效应，这显示所有的星系都在离我们远去。由以上现象我们可以得出结论：宇宙在膨胀之中，由此又得出结论：宇宙是在二百亿年前的一次大爆炸中诞生的。如果宇宙的总质量小于某一数值，宇宙将永远膨胀下去;如果总质量大于某一数值，则万有引力逐渐使膨胀减速，最后使其停止，之后，宇宙将在引力作用下走向坍缩。以前宇宙中所能观测到的物质总量使人们倾向于第一个结论，但后来发现中微子具有质量，并且在宇宙中发现了大量的以前没有观测到的暗物质，这使宇宙的总质量大大增加，使人们又转向了后一个结论，认为宇宙的膨胀将逐渐减慢，最后转为坍缩，宇宙中的所有星系将向一个引力中心聚集，这时，同样由于开普勒效应，在我们眼中所有星系的光谱将向蓝端移动，即蓝移。现在，丁老的统一场论计算出了宇宙由膨胀转为坍缩的精确时间。“ “精彩！”台长恭维地拍了几下手，“象您这样对基础科学有如此了解的领导是不多的，我想，丁老也是这么认为的。”他又向丁仪使了个眼色。 “他说的基本正确。”丁仪慢慢地把烟灰磕到干净的地毯上。 “对，对，如果丁老都这么认为……”台长高兴得眉飞色舞。 “正确到足以显示他的肤浅。”丁仪又从上衣口袋挖出一斗烟丝。 台长的表情凝固了，科学家们那边传来了低低的几声笑。 省长很宽容地笑了笑，“我也是学的物理专业，但以后这三十年，我都差不多忘光了，同在场的各位相比，我的物理学和宇宙学知识，怕是连肤浅都达不到。唉，我现只记得牛顿三定律了。” “但离理解它还差得很远。”丁仪点上了新装的烟丝。 台长哭笑不得地摇摇头。 “丁老，我们生活在两个完全不同的世界里。”省长感慨地说， “我的世界是一个现实的、无诗意的、烦锁的世界，我们整天象蚂蚁一样忙碌，目光也象蚂蚁一样受到局限。有时深夜从办公室里出来，抬头看看星空，已是难得的奢侈了。您的世界充满着空灵与玄妙，您的思想跨越上百光年的空间和上百亿年的时间，地球对于您只是宇宙中的一粒灰尘，现世对于您只是永恒中短得无法测量的一瞬，整个宇宙似乎都是为了满足您的好奇心而存在的。说句真心话，丁老，我真有些嫉妒您。我年轻时做过那样的梦，但进入您的世界太难了。”** “但今天晚上并不难，您至少可以在丁老的世界中呆一会儿，一起目睹这个世界最伟大的一瞬间。”台长说。 “我没有这么幸运。各位，很对不起，长江大堤已出现多处险情，我得马上赶到防总去。在走之前，我还有个问题想请教丁老，这些问题在您看来可能幼稚可笑，但我苦想了很长时间也没有弄明白。第一个问题，坍缩的标志是宇宙由红移转为蓝移，我们将看到所有星系的光谱同时向蓝端移动。但目前能观测到的最远的星系距我们二百亿光年，按您的计算，宇宙将在同一时刻坍缩，那样的话，我们要过二百亿年才能看到这些星系的蓝移出现。即使最近的半人马座，也要在四年之后才能看到它的蓝移。** 丁仪缓缓地吐出一口烟雾，那烟雾在空中飘浮，象微缩的旋涡星系。“很好，能看到这一点，使您有点象一个物理系的学生了，尽管仍是一个肤浅的学生。&gt; 是的，我们将同时看到宇宙中所有星系光谱的蓝移，而不是在从四年到二百亿年的时间上仍次看到。这源于宇宙大尺度范围内的量子效应，它的数学模型很复杂，是物理学和宇宙学中最难表述的概念，没有希望使您理解。但由此您已得到第一个启示，它提醒您，宇宙坍缩产生的效应远比人们想象的复杂。您还有问题吗？哦，您没有必要马上走，您要去处理的事情并不象您想象的那样紧迫。” “同您的整个宇宙相比，长江的洪水当然微不足道了。但丁老，神秘的宇宙固然令人神往，现实生活也还是要过的。我真的该走了，谢谢丁老的教诲，祝各位今晚看到你们想看的。” “您不明白我的意思，”丁仪说，“现在长江大堤上一定有很多人在抗洪。” “但我有我的责任，丁老，我必须回去。” “您还是不明白我的意思，我是说大堤上的人们一定很累了，你可以让他们也离开。” 所有的人都惊呆了。 “什么……离开？！干什么，看宇宙坍缩吗？” “如果他们对此不感兴趣，可以回家睡觉。” “丁老，您真会开玩笑！” “我是认真的，他们干的事已没有意义。” “为什么？” “因为坍缩。” 沉默了好长时间，省长指了指大厅一角陈列的那个古老的星图盘说：“丁老，宇宙一直在膨胀，但从上古时代到今天，我们所看到的宇宙没有什么变化。坍缩也一样，人类的时空同宇宙时空相比，渺小到可以忽略不计，除了纯理论的意义外，我不认为坍缩会对人类生活产生任何影响。甚至，我们可能在一亿年之后都不会观测到坍缩使星系产生的微小位移，如果那时还有我们的话。” “十五亿年，”丁仪说，“如果用我们目前最精密的仪器，十五亿年后我们才能观测到这种位移，那时太阳早已熄灭，大概没有我们了。” “而宇宙完全坍缩要二百亿年，所以，人类是宇宙这棵大树上的一滴小露珠，在它短暂的寿命中，是绝对感觉不到大树的成长的。您总不至于同意互联网上那些可笑的谣言，说地球会被坍缩挤扁吧！” 这时，一位年轻姑娘走了进来，她脸色苍白，目光暗淡，她就是负责巨型显示屏的工程师。 “小张，你也太不象话了！你知道这是什么时候吗？！”台长气急败坏地冲她喊到。 “我父亲刚在医院去世。” 台长的怒气立刻消失了，“真对不起，我不知道，可你看……” 工程师没再说什么，只是默默地走到大屏幕的控制计算机前，开始埋头检查故障。 丁仪叮着烟斗慢慢走了过去。 “哦，姑娘，如果你真正了解宇宙坍缩的含义，父亲的死就不会让你这么悲伤了。” 丁仪的话激怒了在场的所有人，工程师猛地站起来，她苍白的脸由于愤怒而胀红，双眼充满泪水。 “您不是这个世界上的人！也许，同您的宇宙相比，父亲不算什么，但父亲对我重要，对我们这些普通人重要！而您的坍缩，那不过是夜空中那弱得不能再弱的光线频率的一点点变化而已，这变化，甚至那光线，如果不是由精密仪器放大上万倍，谁都看不到！坍缩是什么？对普通人来说什么都不是！宇宙膨胀或坍缩，对我们有什么区别？！但父亲对我们是重要的，您明白吗？！” 当工程师意识到自己是在向谁发火时，她克制了自己，转身继续她的工作。 丁仪叹息着摇摇头，对省长说：“是的，如您所说，两个世界。我们的世界，”他挥手把自己和那一群物理学家和宇宙学家划到一个圈里，然后指指物理学家们，“小的尺度是亿亿分之一毫米，”又指指宇宙学家们，“大的尺度是百亿光年。这是一个只能用想象来把握的世界；而你们的世界，有长江的洪水，有紧张的预算，有逝去的和还活着的父亲……一个实实在在的世界。但可悲的是，人们总要把这两个世界分开。 “可您看到它们是分开的。”省长说。 “不！基本粒子虽小，却组成了我们；宇宙虽大，我们身在其中。微观和宏观世界的每一个变化都牵动着我们的一切。” “可即将发生的宇宙坍缩牵动着我们的什么吗？” 丁仪突然大笑起来，这笑除了神经质外，还包含着一种神秘的东西，让人毛骨耸然。 “好吧，物理系的学生，请背诵您所记住的时间空间和物质的关系。” 省长象一个小学生那样顺从地背了起来：“由相对论和量子力学所构成的现代物理学已证明，时间和空间不能离开物质而独立存在，没有绝对时空，时间、空间和物质世界是融为一体的。” “很好，但有谁真正理解呢？您吗？”丁仪问省长，然后转向台长，“您吗？”，转向埋头工作的工程师，“您吗？”，又转向大厅中的其他的技术人员，“你们吗？”，最后转向科学家们，“甚至你们？！ 不，你们都不理解。你们仍按绝对时空来思考宇宙，就象脚踏大地一样自然，绝对时空就是你们思想的大地，离开它你们对一切都无从把握。谈到宇宙的膨胀和坍缩，你们认为那只是太空中的星系在绝对的时间空间中散开和会聚。” 他说着，踱到那个玻璃陈列柜前，伸手打开柜门，把那个珍贵的星图盘拿了出来，放在手上抚摸着，欣赏着。台长万分担心地抬起两只手在星图盘下护着，这件宝物放在那儿二十多年，还没有人敢动一下。台长焦急地等着丁仪把星图盘放回原位，但他没有，而是一抬手，把星图盘扔了出去！ 价值连城的古老珍宝，在地毯上碎成了无数陶土块。 空气凝固了，大家呆若木鸡。只有丁仪还在悠然地踱着步，是这僵住的世界中唯一活动的因素，他的话音仍不间断地响着。 “时空和物质是不可分的，宇宙的膨胀和坍缩包括整个时空，是的，朋友们，包括整个时间和空间！” 又响起了一声破裂声，这是一只玻璃水杯从一名物理学家手中掉下去。引起他们震惊的原因同其他人不一样，不是星图盘，而是丁仪话中的含义。 ※ ※ ※ “您是说……”一名宇宙学家死死地盯住丁仪，话卡在喉咙里说不出来。 “是的。”丁仪点点头，然后对省长说，“他们明白了。” “那么，这就是统一场数学模型的计算结果中那个负时间参量的含义？！”一名物理学家恍然大悟地说。丁仪点点头。 “为什么不早些把它公布于世？！您太不负责任了！”另一名物理学家愤怒地说。 “有什么用？只能引起全世界范围的混乱，对时空，我们能做些什么？” “你们都在说些什么？！”省长一头雾水地问。 “坍缩……”台长，同时是一名天体物理学家，做梦似地喃喃地说。 “宇宙坍缩会对人类产生影响，是吗？” “影响？不，它将改变一切。” “能改变什么呢？” 科学家们都在匆匆地整理着自己的思绪，没人回答他。 “你们就告诉我，坍缩时，或宇宙蓝移开始时，会发生什么？”省长着急地问。 “时间将反演。”丁仪回答。 “……反演？”省长迷惑地望望台长，又望望丁仪。 “时光倒流。”台长简短地解释。** 巨型屏幕这时修好了，壮丽的宇宙出现在大家面前。为了使坍缩的出现更为直观，太空望远镜发回的图象由计算机进行变频处理，并对频率变化所产生的色彩效应进行了视觉上的夸张。现在所有的恒星和星系发出的光在大屏幕上都呈红色，象征着目前膨胀中宇宙的红移。当坍缩开始时，它们将同时变为蓝色。屏幕的一角显示出蓝移出现的倒计时：一百五十秒。 “我们的时间随宇宙膨胀了二百亿年，但现在，这膨胀的时间只剩不到三分钟了，之后，时间将随宇宙坍缩，时光将倒流。”丁仪走到木然的台长面前，指指摔碎的星图盘，“不必为这件古物而痛心，蓝移出现后不久，碎片就会重新复原，它会回到陈列柜中去，多少年以后，回到土中深埋，再过几千年的时间，它将回到燃烧的窑中，然后做为一团潮泥回到那位上古天文学家的手中……”，他走到那位年轻的女工程师身边， “也不要为你的父亲悲伤，他将很快复活，你们很快就会见面。如果父亲对你很重要，你应该感到安慰，因为在坍缩的宇宙中，他比你长寿，他将看着你做为婴儿离开这个世界。是的，我们这些老人都是刚刚踏上人生旅途，而你们年轻人则已近暮年，或说幼年。”他又走到省长面前，“如果过去没有，那么长江的洪水未来永远不会在您的任期内越出江堤，因为现在宇宙中的未来只剩一百秒了。坍缩宇宙中的未来就是膨胀宇宙中的过去。最大的险情要到一九九八年才会出现，但那时您的生命已接近幼年，那不是您的责任了。还有一分钟，现在无论做什么，都不会对将来产生后果，大家可以做各自喜欢的事情而不必顾虑将来，在这个时间里已经没有将来了。至于我，我现在只是干我喜欢，但以前由于气管炎而不能干的一件小事。”丁仪又用大烟斗从口袋里挖了一锅烟丝，点上悠然地抽了起来。 蓝移倒计时五十秒。 “这不可能！”省长叫到，“从逻辑上这说不通，时间反演？一切都将反过来进行，难道我们倒着说话吗？这太难以想象了！” “您会适应的。” 蓝移倒计时四十秒。 “也就是说，以后的一切都是重复，那历史和人生变得多么乏味。” “不会的，你将在另一个时间里，现在的过去将是您的未来，我们现在就在那时的未来里。您不可能记住未来，蓝移开始时，您的未来一片空白，对它，您什么都不记得，什么都不知道。”** 蓝移倒计时二十秒。 ※ ※ ※ “这不可能！” “您将会发现，从老年走向幼年，从成熟走向幼稚是多么合理，多么理所当然，如果有人谈起时间还有另一个流向，您会认为他是痴人说梦。快了，还有十几秒，十几秒后，宇宙将通过一个时间奇点，在那一点时间不存在。然后，？我们将进入坍缩宇宙。 蓝移倒计时八秒。 “这不可能！真的不可能！！” “没关系，您很快就会知道的。” ※ ※ ※ 蓝移倒计时五秒，四，三，二，一，零。 宇宙中的星光由使人烦燥的红色变为空洞的白色…… ……时间奇点…… ……星光由白色变为宁静美丽的蓝色，蓝移开始了，坍缩开始了。 …… ……了始开缩坍，了始开移蓝，色蓝的丽美静宁为变色白由光星…… ……点奇间时…… ……色白的洞空为变色红的烦燥人使由光星的中宙宇 。零，一，二，三，四，秒五时计倒移蓝 “。的道知会快很您，系关没” “！！能可不的真！能可不这” 。秒八时计倒移蓝 “。宙宇缩坍入进将们我，后然。在存不间时点一那在，点奇间时个一过通将宙宇，后秒几十，秒几十有还，了快。梦说人痴是他为认会您，向流个一另有还间时起谈人有果如，然当所理么多……","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"},{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"}]},{"title":"刘慈欣作品-按创作时间排序","date":"2016-12-12T00:47:24.000Z","path":"2016/12/12/刘慈欣作品-按创作时间排序-20161212/","text":"刘慈欣作品（按创作时间排序） 01.坍缩 【短篇 1985】02.微观尽头 【短篇 1987】03.中国2185 【长篇 1989】04.超新星纪元 【长篇 1991】05.大艺术三部曲之 &lt;梦之海&gt; 【短篇 1997】06.大艺术三部曲之 &lt;诗云&gt;(又名&lt;李白&gt;) 【短篇 1997】07.大艺术三部曲之 &lt;欢乐颂&gt; 【短篇 1997】","tags":[{"name":"科幻","slug":"科幻","permalink":"http://sniperkaka.com/tags/科幻/"},{"name":"书单","slug":"书单","permalink":"http://sniperkaka.com/tags/书单/"}]},{"title":"Doom启示录-读书笔记-03","date":"2016-11-29T07:37:15.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129-03/","text":"第十三章 死亡竞赛 1997 年初，约翰·罗梅洛——王牌程序员、现实富翁、死亡竞赛手术师——永远地离开了。 卡马克的第一个尝试是正处在萌芽时期的三维图像加速卡。在过去，只有街机具备专门的三维图像加速及改善功能，随着 Doom 和Quake 等强大的三维引擎不断涌现，一些刚起步的公司看到了把三维加速带入普通家庭的商机，那些高速图像处理芯片可以被嵌入到显卡中，然后用户可以把这显卡插入他们的计算机。3Dfx 公司推出了名为 Voodoo 的首批三维图像加速卡，他们还说服卡马克，请他把 Quake引擎用 OpenGL 图像编程接口重写，以发挥出新硬件的优势。卡马克用一个周末完成了这项工作，并把 OpenGL 版本的 Quake 免费发布到了网上。 卡马克的成果让玩家们咋舌不已：游戏至少比原来流畅了 20%，而且图像更为逼真。由简入奢易，由奢入简难，一旦他们看过了硬件加速下的 Quake，他们就再也不想回到原来的软件渲染模式，他们毫不犹豫地把标价几百美元的 Voodoo 卡带回家升级爱机。其他程序员们也开始针对 3Dfx 加速卡编程，没错，跟随卡马克，这已经慢慢变成一种模式。其他显卡制造商也加入了三维加速市场的争夺，一个高科技的产业诞生了。伴随着 GLQuake 成功的，还有卡马克的另一个项目：Quakeworld，他写的这个免费程序把 Quake 的多人游戏带到了一个新的高度。随着 OpenGL 带来的图像改进，以及 Quakeworld 带来的网络改进，Quake 达到了前所未有的完美。 在那时，游戏开发者的名气起着举足轻重的作用，席德·梅尔——《文明》系列的传奇设计师，有他自己的公司：Firaxis；威尔·赖特（Will Wright）——畅销游戏《模拟城市》的创造者，有他自己的公司：Maxis；理查德·盖略特——《创世纪》之王，有他自己的公司：维真；甚至盖略特的前雇员，克里斯·罗伯茨（Chris Roberts），也开办了自己的 Digital Anvil 公司。在《德军总部 3D》、Doom、Quake 这些巨大成功背后的罗梅洛，已不止是声名显赫，他简直是个金矿。 狂热的 Doom 和 Quake 迷们蜂拥而至，他们的简历和他们制作的模式塞满了离子风暴公司的电子邮件服务器，罗梅洛在其中挑选了一些他满意的：那些能让他眼前一亮的作品。 1997 年初，这些终极玩家们从四面八方赶到离子风暴的临时办公室来上班，以及，和他们的精神领袖——罗梅洛，进行死亡竞赛。要知道，他们过去几年完全就是生活在罗梅洛创造的游戏世界里。布赖恩·爱瑟罗（Brian Eiserloh），那著名的天体创作营主办者，在寄来一篇中世纪风格的散文后获得录用；威尔·罗康托（Will Loconto）放弃他在工业金属乐队“信息社会”（Information Society）的演出，担任了离子风暴的音响师；斯维若·克维恩莫（Sverre Kvernmo），Doom 社群里的明星作家，离开了故土挪威，成为罗梅洛麾下的首席关卡设计师。这无疑是他们人生道路上的一次重大抉择，但他们几乎不经考虑就做出了决定，毕竟，“我们是罗梅洛时代的产物。” 斯维若如是说。 离子风暴把自己描绘成了自由与梦想的化身，而 id，只是个毫无生气和生机的老顽固。这不只是两家公司的对比，这是两种世界观的对比：设计和技术，艺术和科学，狄俄尼索斯和阿波罗。“id 是一家以技术为主导的公司，”麦克说：“而离子风暴则着重于艺术美感的自由发挥。在 id，当图像引擎完成时，设计师和美工们已经没有多少时间来制作游戏本身了，我们认为这不是一个很好的做法，它没有合理地平衡技术和设计所占的比重。” 卡马克一直保持着沉默，但办公室里的火药味越来越浓，这让他无法置身事外，最终，他决定体验一下放弃自控力的感觉，或者，用他的话说，做一次“情绪操控方面的试验”。他选择了一个大牌媒体来作为他首次参战的舞台：《时代》周刊。在那一期上，有篇两页多长的罗梅洛个人介绍，卡马克在接受访谈时，直言不讳地告诉公众，和罗梅洛的一贯说法相反：这位前任拍档的离去不是辞职，而是被解雇。“在变得有钱有名后，罗梅洛失去了工作的动力，然后公司把辞职书放到了他面前。”卡马克嘲弄了罗梅洛对于财富和名望的野心，“而我只想拥有几辆法拉利。”卡马克还补充道，罗梅洛“不可能”像他承诺的那样在圣诞节前拿出《大刀》。 Quake 引擎里的真三维技术是一次质的飞跃，而 Quake2，卡马克不觉得它在技术上有多大进步。尽管如此，新引擎仍然足以使人过目难忘，最显著的，就是 Quake2 能够以软件和硬件加速两种模式进行渲染，也就是说，拥有三维加速卡的玩家将看到前所未有的图像效果——彩色的光影、平滑的物体表面、等等，那是一种栩栩如生的、流畅的、影院般的游戏体验。 大展进行到尾声时，玩家们纷纷把注意力投向了另一项活动：id 公司赞助的“赤色全歼”（Red Annihilation）死亡锦标赛。房间正中放着比赛的奖品——卡马克那辆红色的法拉利 328 跑车。“在《德军总部 3D》获得成功后，我买了我的第一辆法拉利，”卡马克告诉媒体：“Doom 和 Quake 又为我带来了三辆，我一个人开不了那么多，但我不想把它们卖掉或是停在车库里，我要把它送给玩家，说到底，id的成功离不开玩家们的支持，这次死亡竞赛的王者就将获得这顶桂冠。” 这世界永远充满竞争，和意外。 第十四章 硅堡 主视角射击游戏。Doom、Quake、毁灭公爵 3D。 铺天盖地的射击游戏已使媒体猜测起谁能扮演“Quake 终结者”的角色，从而把 id 赶下神坛。《毁灭公爵 3D》早已被认为是很有潜质的一部作品，而现在，一家由几个前微软职员在西雅图开设的公司：Valve，使用 Quake 的引擎制作了《半条命》（Half-Life），它在 E3 大展上博得玩家和媒体的一致称赞。斯科特·米勒前些年在北加州发现的一家名叫 Epic 的公司也制作了一款主视角射击游戏：《虚幻》（Unreal），它的演示版同样好评如潮；当然，还有《罗梅洛的大刀》。所有这些游戏都即将上市，包括 id 自己的 Quake2。硅堡的决战必将是近几年最精彩纷呈的一出大戏。 他们时常举办这样的跑车大赛，前一次，卡马克甚至把电话打给了麦斯奎特的市长，请他把当地机场关闭一段时间以用于赛车，市长没有什么好考虑的——恭敬不如从命，因为，卡马克给当地警察局捐助过上万美元的装备和设施，其中包括绣着 Doom标志的防弹服，他的请求自然应该得到满足。 1997 年 12 月 9 日，id 发布 Quake2。 当他一个星期后回到麦斯奎特的办公室里更新计划文件时，他发现自己还想说说其他心情，这在卡马克而言是难得一见的： 姓名：约翰·卡马克职务：程序员项目：Quake2最近更新：1998 年 2 月 4 日 03:06:55 （美国中部标准时间） 嗯，我太长时间没有更新计划文件了。 封闭研究进行得很顺利，在一个礼拜里，我除了买可乐外就没有出过旅店的门，这简直太安逸了，因为办公室里的杂事已经让我有点无法忍受。以后，在项目不紧时，我很可能会经常做这样的封闭式研究，每季度一次听起来比较合适。 现在要具体谈论三次元引擎还为时过早，Quake 在架构完全成型之前走了不少弯路（光树、门洞、等等），所以我知道，现在研究的东西很可能会有变动，我不想说任何会被某些人当做是“承诺”的话。 我只能说，工作的进展很激动人心。 许多游戏开发者从事这一行是为了制作出最终的游戏，中间漫长的开发阶段只是不得不经历的过程，我尊重他们的工作态度，但我从事游戏开发的动机略有不同。当然，我也为游戏的完成而自豪，但这途中所克服的各种困难却更加让我铭记。我已记不清我们那些老游戏发布时的情景，但我清楚地记得那些技术上的突破，早至《基恩》时的 CRTC 回绕，以实现平滑的卷轴效果（准确地说，早至理解苹果 2 汇编语言中并联数组里的结构体……），知识是需要积累的，学习是需要循序渐进的。 我的人生就是以知识的积累和学习的不断深入来分为不同阶段。 我启蒙阶段用的是学校里的苹果 2 型机，但当时的条件局限了我的学习速度和深度。今天的状况已经好多了，只要有一台便宜的二手PC 机、一张 Linux 光盘和一个因特网的账号，你就拥有了足够的工具和资源，你就可以达到任何你期望的编程境界。 《软盘》的头六个月对我而言如同活在梦里，平生第一次，我身边有了比我更博识的程序员（罗梅洛和罗瑟），我手边有了大量的书籍和资料，而且我可以全身心投入到编程中，那真是一段好时光。 接下来的两年，直到 Doom 和几个家用机版本移植完成，我在稳步提高着我的知识面和技术水平，其中包括：更深入的图像编程、网络、Unix、编译原理、跨平台、RISC 架构、等等。 Quake 开发的第一年简直如同腾云驾雾，有迈克尔·亚伯拉什作为顾问，我尝试了大量新鲜课题。如果科班出身的图像程序员们知道我在写 Doom 时有多业余，他们肯定会大吃一惊，那时的我甚至不能正确地剪切墙体多边形（这就是为什么我用了那莫名其妙的极坐标系统），Quake 逼着我踏上正轨，同时探索出新思路。 Quake 开发的最后半年是在痛苦中度过的，那时我满脑子只想着把这该死的东西做完，当然，一切付出到后来都有了回报，但我绝不怀恋这段时光。 Quake2 开发的过程中，我的学习经历又得到了进一步扩充：GLQuake、quakeworld、radiosity、OpenGL 工具开发、Win32 编程、等等，与此同时，我也有了不少关于下一步如何做的想法。 我认为接下来三位元引擎的开发将和 Quake 一样硕果累累。我在一些课题上已经有了非常深入的理解，我还正在尝试一些图像编程以外的全新领域，它们将会和我所有其他方面的工作产生积极互动。 末了，自然也会有一个精彩的游戏。:） 麦基想道，自从罗梅洛离开后，公司迟早会走到今天的地步：一个缺乏制衡的 id。 麦基不是惟一怀念罗梅洛的人，从未和罗梅洛共事过的斯蒂德也开始认为解雇罗梅洛是一个惨痛的错误。“罗梅洛是随意散漫，而卡马克是严肃认真，他们的搭配就像是一动一静的太极两仪，但如果他们分开，那是什么？” 五月份举行的 1998 年度 E3 大展上，《大刀》的演示依然让人失望，其他射击游戏，譬如刚发布的《虚幻》和即将发布的《半条命》，以及 id 的 Quake3，夺走了所有风头。 第十五章 1999 年 4 月 20 日中午，埃里克·RebDoomer·哈里斯（Eric “RebDoomer” Harris）和他最要好的朋友迪伦·Vodka·克里波德（Dylan “Vodka” Klebold）浑身挂满弹药，冲进科罗拉多州利特尔顿城的科隆比纳中学，制造了死亡十五人——包括他们自己——的校园枪击案。这起通过电视直播的惨剧震惊了全美国，惶惶然的家长们、教师们、政客们，以及同学们怎么也想不通，为什么两名毫不起眼的中学生竟是冷血杀手？他们需要一个合理的解释，为此，他们要找件事物来加以责难。 1999 年 4 月 21 日下午 4 点 13 分，Blue’s News 网站的编辑史蒂夫·西斯里普（Steve Heaslip）发布消息：“据几名网友反映，他们透过电视上装有嫌疑犯物品的塑料袋看到了 Doom 标记……到目前为止，还没有人把这些物品和案件联系起来。”但随着杀手的 Doom 游戏、Doom 书籍、Doom 影带被一一发现，这联系很快就建立了起来。 由此，总统先生启动了一项联邦调查活动，以决定游戏或其他娱乐公司是否需要为向儿童推销暴力产品而承担法律责任。业界人士声称游戏都是由成人制作，并且也是面向成人的，但这无法令人信服，克林顿总统补充道：“谁能毫不心虚地说，暴力游戏的初衷就是面向成人？”三天后，列博曼议员和约翰·麦肯（John McCain）颁布了解决方案：《二十一世纪媒体职责法案》（Twenty-first Century Media Responsibility Act），它的强大之处在于，它试图建立起一个涵盖电影、音乐、游戏的评定标准，如果它得以通过，那么，卖暴力游戏给未成年人的零售商就要面临一万美元的罚款。游戏业界一贯赞成分级系统，他们已经成立了自己的 ESRB，只是政府的干预和建立所谓的标准让他们无法接受。但华盛顿方面的意思很强硬：你们再好好反省反省。 《雷神竞技场》（Quake III Arena） 现在看起来，罗梅洛心中所谓‘大公司’的梦想似乎走得太远了，他们太放纵、太浮躁、太自大，他那些卡马克曾斥责过的毛病——三心二意、盲目自信、人海战术——终于使他在残酷的现实面前撞得头破血流，但现在说什么都为时已晚。 在圣何塞市举办的年度游戏开发者大会上，id 的人们看到了《虚幻竞技场》（Unreal Tournament），它的制作者就是在 1998 年出品了《虚幻》的 Epic 公司，这家公司已成为了 id 最强有力的竞争对手，其主程序员提姆·斯威尼也赢得了广泛尊敬，他们甚至还雇到了两位前 id 职员来做市场商务：杰伊·威尔伯和马克·瑞恩——《德军总部 3D》时的“试用经理”。Epic 的《虚幻》，和 Valve 的《半条命》类似，给主视角射击流派带来了更多的内涵，此外，它的图像引擎是自行开发的，这已经颇让 id 为之侧目，而他们这次的《虚幻竞技场》则更让 id 惊诧莫名——它是个只支持多人对战的游戏，和 Quake3 一样。 第十六章 2000 年底，卡马克双喜临门，一是 id 发布了 Quake3，二是他迎来了自己的婚礼。加利福尼亚一位女商人兼 Quake迷凯瑟琳·安娜·康（Katherine Anna Kang） “女人并不是男人的附属，跨种族的联姻不是什么孽缘，就好比，资本主义不是毒草，社会主义也不一定就是万金油。”美籍俄裔女作家艾·兰德（Ayn Rand）是安娜的精神偶像，她希望自己能像兰德笔下《源泉》（The Fountainhead）里的盖尔·威纳德（Gail Wynand）一样强大。在 Quake 的世界里，她做到了。 在一次访谈中，卡马克被问起童年的经历，他讲述了一些关于火箭、炸弹、少年之家的故事，以及，他回想道，那时的他是一个多么“不识好歹的小子”。采访结束后，卡马克到网上浏览了一番业余火箭界的近况，展现在他眼前的是一片多姿多彩并充满竞争的景象，黒客们、工程师们、爱好者们，正在建造大型的高能载人火箭，他们要进入外太空。卡马克一下子就来了兴趣。 头几个礼拜，卡马克买了一些火箭模型回来，他看着它们呼啸爬升，他开始深入了解起业余火箭爱好者们的世界：这里的人们认为美国国家航天总署（NASA）只不过是一家载重货运公司，爱好者们的目标是一千万美元的“X 大奖”——把三名乘客送到外太空。当然，让卡马克感兴趣的是技术上的挑战。 卡马克支起发射台：一个红黑相间的架子，配有一根指向天空的细长固定杆。他拿出火箭，这时他还要估计一下风力和风向。他以前在这玩的时候曾经被强风把火箭吹得不见了踪影，后来他想了个办法：由便携式计算机和无线调制解调器组成接收端，再给火箭配备上信号发射器，他就有了一个很实用的定位系统。 卡马克厌恶那种貌似先哲圣贤般的夸夸其谈，但如果你一定坚持，他也会聊聊他的想法。“在信息时代，客观障碍已不复存在，”他说：“所谓障碍都是主观上的。如果你想动手开发什么全新的技术，你不需要几百万美元的资金，你只需要在冰箱里放满比萨和可乐，再有一台便宜的计算机，和为之献身的决心。我们在地板上睡过，我们从河水中趟过。” 他揿下按钮，一阵浓烟和爆炸声后，火箭高高飞扬在了秋日牧场的上空。 跋 id 的游戏及技术授权给他带来了足够的财富，他经常给慈善事业捐款，他不需要那么多钱。在技术上，长年浸淫于图像编程中的他几乎达到了禅宗般的境界，浴室墙壁上的光斑在他眼里只不过是水龙头上镜面反射光产生的漫反射效果，但这种理解方式并没有使他与现实世界脱节，相反，这使他更加对世界心存感激：“这些就是摄人魂魄的景象，我不需要走到大峡谷边才能感叹于造物的神奇，我可以就坐在屋里，看光线反射的样子。” 罗梅洛则乐意把心思都放到家里，他和斯狄薇愉快地享受着田园生活。他已决定重头来过，他说，回到自己的老本行：设计和制作游戏。尽管外界对《异次元》的评价都不错，但在看过几份传统的出版订单后，罗梅洛、斯狄薇、汤姆三人还是决定去探索未知的掌上电脑和手机等移动市场。作为第一个进军这新生产业的游戏名人，罗梅洛无疑又成了啦啦队长，只不过以前是为 PC，而现在是为手持设备。 作者后记及致谢 我尤其要感谢两位约翰。我不知道他们在回答我那些问题时会作何感想，在那许多个夜里，他们一直无比耐心和宽容。卡马克毫无保留地托出了他的想法和回忆——就像他与世界分享他的代码一样，他还带我一起去放飞火箭，甚至让我亲手驾驶了一会改装过的法拉利。罗梅洛总是乐于去发掘他那包罗万象的收藏库：游戏、艺术品、漫画、汉堡王的收据、等等、等等、等等，他和斯狄薇甚至还让我在他们的乡间农庄里自行翻找，对此我至今心存感激。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"Doom启示录-读书笔记-02","date":"2016-11-29T06:55:58.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129-02/","text":"第四章 买比萨的钱 罗梅洛和卡马克在性格上有一个很明显的不同，这个差异在他们合作的早期就已显现出来，那就是他们对待时光的态度。也正是类似这样的差异，使他们成为完美的搭档，也使他们无可挽回的决裂。 卡马克只活在他当前的时刻。专注，是他力量的源泉。他心中既没有对未来的憧憬，也没有怀旧的思绪，他的注意力全部集中于如何解决眼前错综复杂的问题：思考、编码。他不保留任何过去的东西：照片、记录、游戏、磁盘。他甚至连他的那些处女作——《鬼魂》和《造影》——都没有留一份拷贝。他没有学校的年鉴可唤起他学生时代的回忆，他也不保存刊登过他早期作品的杂志。他只有他在当下要用到的东西。他的卧室由一盏台灯、一个枕头、一条毯子和一堆书组成，甚至没有床垫。他什么都没从家里带出来，除了咪子（Mitzi），一只他继母送给他的猫。 罗梅洛则完全相反，他沉浸在所有的时光里：过去、现在、未来。他不光对这些时光都充满热情，而且还付诸行动：他收藏起曾经的事物、他陶醉于眼前的欢欣、他勾画着未来的蓝图。他记得每一个约会、每一个名字、每一个游戏，他保留着信件、杂志、磁盘、“汉堡王”的收据、照片、各种存根。他也抓住所有机会让每一天都开开心心，譬如开一个更逗的玩笑，或是讲一个更有趣的故事，或是做一个更夸张的鬼脸。但他这绝不是狂躁，他知道如何去专注，他只是过于情绪化而已，当他愉快的时候，他对所有的事物都充满热爱，而当他沮丧的时候，他又变得冷漠迟钝。汤姆管他这种情绪变动叫“像比特一样摇来摆去”，因为他就像计算机里存储数据的二进制比特一样，一会是开，一会是关。 1990 年 9 月 20 号的那个宿命的早晨，罗梅洛的状态跳到了开，他会把这个早晨深深地烙在记忆里，而卡马克则没过多久就会把它忘了，但不管怎样，这个早晨对他们而言都同样的重要。卡马克用他非凡的专注解决了一个迫在眉睫的挑战：在 PC 上实现卷轴效果。罗梅洛则预见了卡马克的成果可能带来的事物。卡马卡制作了调色板，然后罗梅洛用这个调色板绘出了一个未来，很明显，这个未来不会和《软盘》有任何关系。 他们已经有了一个梦幻般的团队：卡马克，天才小子和图像编程的领头羊，罗梅洛，游戏制作的多面手和公司的啦啦队长，艾德里安，沉迷于黑暗的艺术家，汤姆，游戏设计师和超现实主义漫画家，还有雷恩——尽管罗梅洛对他仍不是很满意，但还是想再给他一次机会。更重要的是，他们正好能互相取长补短：卡马克的沉静平衡了罗梅洛那四溢的热情，艾德里安那阴森的画风与汤姆那卡通般的喜剧风格正好相反。他们现在只缺一个人来处理商业事务——筹集经费、平衡账目以及日常管理。说到这里，每个人都看向了杰伊。 在做《超级马里奥》演示版的这个周末，他们就簇拥在这房子里。一张大桌子上架起了两台计算机，这桌子本是卡马克用来和他们通宵玩《龙与地下城》用的，罗梅洛和卡马克现在坐在这桌子边一起写程序，汤姆一人扛下了所有美工的活，雷恩负责做动画，譬如那些小海龟。他们已经事先把游戏的过程录制了下来，为了不错过任何一个细节，汤姆把录像带倒来倒去，不时按下暂停，好仔细地观察。 连续的七十二小时里，他们进入了压榨模式。没有人睡觉，他们喝掉了无数含咖啡因的苏打水，送比萨的小伙子每隔一段时间就来一次，杰伊烤了不少肉饼和热狗，但大部分都放在那里没人碰。他们分毫不差地复制出了这个游戏：马里奥蹲着走的时候的小碎步，他跳起来的动作，他踩到小海龟上以及把它们踢飞时的样子，那些掉下来的金币，那些云彩，以及——那平滑的卷动。当他们完成的时候，屏幕上的东西已经和那有史以来卖得最好的游戏毫无二致了，惟一有点不同的是开始画面，在任天堂的版权声明下方，多了一行制作公司的名称，那自然是罗梅洛和雷恩的“深思软件”。 于是他按照当时的做法，发布了两个完整的文本游戏，坐等着收钱，但汇款过来的玩家却少得可怜，几乎没有。他开始觉得：玩家，和那些真正购买工具软件的人是不尽相同的，他们大都只对可以直接得到的免费东西感兴趣。斯科特又观察了一段时间，发现像他这样快破产的游戏制作者还有很多，他们的共同之处是他们都把整个游戏一起作为共享软件发布。他意识到，玩家也许是诚实的，愿意购买他们喜欢的游戏，但同时他们也是怕麻烦的，既然已经玩到了整个游戏，他们也就懒得再去办付款的手续。要给他们一个付款的理由和动机。 于是他想出个点子：为什么要把整个游戏一起放出去呢？为什么不只发布其中的一小部分，然后让玩家们从他手里购买完整的游戏呢？没有人尝试过这种做法，但它看上去没有什么问题。斯科特在做的新游戏恰好很适合用这种方式来发行，因为这个游戏是由若干段情节，或者说是“关卡”组成的。他可以只发布其中的一部分，譬如十五个关卡，然后告诉玩家，如果他们想玩其余的三十个关卡，那么，请寄张支票过来。 斯科特向罗梅洛解释道，一个理想的共享软件游戏应该具备这么几个要素：尺寸小，动作类，可以分成若干个关卡。因为共享软件大都通过 BBS 分发，所以它必须足够小，才能通过调制解调器下载。图像丰富的大型游戏，譬如雪乐山娱乐公司出版的那些，根本无法通过 BBS 传播。而且，它还得是有趣的快节奏游戏，类似街机那样能让人们的肾上腺分泌加速，这样才能吸引着玩家们来购买。如果罗梅洛把他的《埃及金字塔》交给斯科特发行的话，斯科特答应先给罗梅洛一笔预付款，以及 35％的版税，这比任何大出版商给的版税都要高，而且，罗梅洛不需要为市场推广或者是订单处理而操心。 《指挥官基恩》 “不要乱吹你不懂的东西” 角色们各就各位：汤姆是主设计师——负责制定游戏的各种元素：情节、角色、武器。卡马克和罗梅洛这两个多年来一直独立制作游戏的老手很乐意把设计工作分给汤姆来做，因为他们现在完全被编程工作占据了。卡马克不断地完善着游戏的引擎，直到屏幕不光是可以平滑地左右卷动，而且还可以平滑地上下卷动。与此同时，罗梅洛制作好了关卡编辑器，其他制作者们可以通过这个编辑器把各种图像放到一起：主角、房间、敌人等，它就是设计师的工具箱。 汤姆还设计了一个名叫“唷扑”（Yorp）的角色，那是个肥肥的绿色小怪物，头上长着个像潜望镜一样的眼睛。 所有科学技术，以及文化、知识、理论，都是在前人的基础上发展起来的。去注册一项专利，就等于宣布说：“这个想法是我的想法，你不能使用或扩展它，因为，我‘拥有’这个想法。”在卡马克这样的黒客眼里，这听起来简直荒谬绝伦。专利制度威胁到了他生命的最重要的事情：编写代码去解决问题。如果这个世界上充斥着各种专利，以至于他连解决一个简单的问题都要侵犯到某项专利的话，那么这将不是一个他所乐意生活在其中的世界。 斯科特也给游戏提出了他自己的建议，他在一封信中写道：“马里奥兄弟之所以那么流行，其中一个很重要的因素是那些隐藏在游戏各个角落里的秘密和奖励，我很希望《基恩》里也有这些东西，这对游戏将是个非常有益的补充。” 所有这些蛋蛋都起源于 1980 年雅达利 2600 家用机上的一个名叫《冒险》（Adventure）的角色扮演游戏，当无畏的玩家们进入一个隐秘的房间时，他们会发现里面只有一行闪烁着的字：“沃伦·罗宾尼特”（Warren Robinett），一些玩家明知道不会有什么事发生，但也只能朝它放几枪，而剩下的玩家只是看着它，不得其解地挠头。其实罗宾尼特是一个制作者的名字，他不愿看到出自他手里的游戏只被标记上公司名称，于是他通过这种方式来获得认同。 雷神（Quake）！ 卡马克和罗梅洛也一天比一天更加默契。他们就像是两个网球选手，在独孤求败了那么多年后，终于找到个可以一较高下的对手。罗梅洛促使着卡马克成为一个更好的程序员，而卡马克也促使着罗梅洛成为一个更棒的设计师，而他们的共同之处，就是他们年轻的激情，对工作的热爱。 1991 年 2 月 1 日，id Software 成立了。 第五章 比现实更有趣的世界 PC 机的性能还不足以运行那样的游戏。卡马克翻遍了各种书籍和期刊，但没发现什么有价值的东西。他又像当初做卷轴效果时一样：先尝试最直接的办法，如果不行，再拓宽思路。三维游戏之所以很慢的一个原因是要画的物体表面太多，但卡马克又想到，是不是可以让计算机每次少画些表面，就像给马儿戴上个眼罩，譬如，在绘制走道时，省略掉地板和天花板，只画出两侧的墙壁，用透视法的话，它们就是两个简单的梯形。此外，卡马克又独辟蹊径地使用了所谓的“射线追踪”算法（raycasting），在剔除掉玩家视角外的物体后，游戏的速度得到了极大的提高。这时，就只剩下最后一个挑战：在三维的世界里加入人物，解决的办法是简单地绘制出表现这些人物的图像和动画，《银河飞将》就已经可以根据玩家和目标之间的距离远近来动态缩放图像的大小。在综合了削减多边形、射线追踪、动态缩放这些技术后，卡马克已经可以做出一个流畅的三维世界了。 整个研究工作花费了卡马克六个星期，以前他顶多都只需要四个星期。当罗梅洛看到这成果时，他再次叹服于卡马克的天才。他们接下来讨论了应该制作个什么样的游戏，才能发挥出这个引擎的优势。他们最终决定制作一个未来核战后的世界，玩家在里面开着坦克营救幸存者。《气垫坦克》（Hovertank）于 1991 年 4 月发布——id 创造了主视角射击类游戏。 汤姆撰写了《再见，银河》（Goodbye Galaxy）这个三部曲的故事大纲。这次，基恩发现了一个试图摧毁银河系的阴谋，他必须立即乘坐他的飞船去拯救这个世界，在此之前，他还要照料好父母，他们被他不小心用眩弹枪击晕了。汤姆在游戏里加入了眩弹枪这个新玩意，因为在前一个三部曲发布后，忧心忡忡的家长们给 id 寄来了一些不满的信件，他们不喜欢游戏中角色死亡的方式，他们不喜欢死了以后还留在屏幕上的唷扑：“为什么这些角色不能直接消失呢？就像其他游戏里一样？”汤姆仍想坚持他的做法，但他也不愿去惹不必要的麻烦，他只好加入了这种新式武器，角色们不会死去，他们被击中的时候只会晕倒在原地，头顶上盘旋着一串金星。 第六章 阴郁的日子 材质贴图指的是把一幅精细的纹理应用到屏幕里的某个物体表面，这样就可以画出一面有质地的砖墙，而不是一个棕色的方块。罗梅洛从保罗·纽拉斯（Paul Neurath）那里听说了这个词，纽拉斯的公司“蓝天制作”（Blue Sky Productions）正在开发一个叫做《地下创世纪》（Ultima Underworld）的游戏，这个游戏将由创世纪系列原作者盖略特的维真公司发行。纽拉斯告诉罗梅洛，他们正在把材质贴图应用于三维世界中的多边形上。 《基恩》的第二个三部曲行将完工，id 把注意力集中到了下一个给天极的游戏上。这个时候，他们各自的角色也更为清晰明确：卡马克是技术方面的头，负责制作出新的引擎用于接下来的游戏；汤姆是主设计师，负责构思游戏的情节和方方面面的内容；罗梅洛则恰好介于他们之间，既可以帮助卡马克编写工具，又可以和汤姆一起创造各种点子；艾德里安负责把他们的要求付诸于图画，并不时在里面添几道血污。 《德军总部》！这个词立刻让卡马克和汤姆为之一振，就像罗梅洛一样，他们这些苹果机玩家就是玩着这个经典的动作游戏长大的，它是希拉斯·华纳这个传奇人物在 20 世纪 80 年代早期的一款杰作。他们立刻领会了罗梅洛的意思。《德军总部》这个主题非常适合卡马克的新技术，因为它本质上就是一个迷宫射击游戏，玩家们在其中和纳粹搏斗，寻找各种财宝，最后面对希特勒本人。尽管原作的画面很粗糙，但它能让玩家感觉到自己是在一个很大的世界里，这在那时是非常独特的。当时的计算机或街机游戏，譬如《乒乓》，都只在一个屏幕上进行，但在《德军总部》里，屏幕上显现的只是那个巨大的城堡里的一个房间，每一个房间都是由墙壁组成的一个迷宫。当玩家穿过某个迷宫后，他就可以进入下一个房间，屏幕上的画面随之改变，尽管没有平滑卷动，但玩家的确能感受到自己是在一个巨大的世界里探索，而且他不知道下一个房间里等待着他的将是什么：当然，通常是一个操着德语尖叫的纳粹士兵。 卡马克和罗梅洛把他们各自的角色发挥到了极致，一个在精益求精地改进引擎，另一个则不断地发掘引擎的能力，在工具中加入新的元素。卡马克那做工考究的吉他只有到了罗梅洛手里，才被谱出动人的音色。但他们之间的友谊和普通人之间的友谊不太一样，他们不讨论他们的生活，也不讨论他们的梦想。在一些夜晚，他们会坐在一起玩 F-Zero 赛车游戏，他们的友谊在很大程度上来说，是工作上的友谊，是他们对游戏的共同热爱，是他们为此不羁的追求。 流畅、简洁、快速的引擎 第七章 命运之矛 希拉斯是《德军总部》的创作者。 完成了所有的关卡后，id 决定周末每人花五千美元到迪斯尼乐园庆祝一番。他们坐了一遍又一遍过山车，还观看了各种表演，晚上，他们下榻在主题公园旁的佛罗里达大酒店。围坐在巨大的温泉浴缸里时，他们觉得生活是如此美好，他们决定回去以后给他们自己加薪到每年四万五千美元——这在那时是一笔不小的数字。 卡马克的技术。他带着在《造影者》引擎里取得的成果回到了 id 的办公室，大家立刻注意到，这是个相当大的飞跃。引擎里一眼就能看出来的新特性有：亮度衰减，带材质贴图的地板和天花板。 亮度衰减的意思是，就像在现实世界中，当你打着手电筒行走时，越远的物体就越陷入黑暗。在《德军总部 3D》里，所有的房间，所有的角落，都是亮堂堂的，没有色调的变换，而画家们都知道，光的效果是使图画栩栩如生的关键一环。有了亮度衰减后，卡马克的虚拟世界更加鲜活了。 卡马克还学会了如何把材质贴图应用于地板和天花板，此外，他还摸索出了如何实现不等高的墙体。 末日（Doom） 第八章 召唤群魔 杰伊向卡马克保证，离开天极只会给 id 带来好处：“我们将真正地独立起来，我们不再依靠任何人，我们要给自己创造机会，我们不能坐在这里等着幸运女神来敲门，我们要打开门，揪着她的领子把她拽进来！”而且，卡马克可以继续心无旁骛地钻研技术。拗不过杰伊，卡马克最终同意了：斯科特出局。 在 Doom 启航之前，斯科特不是惟一要离开 id 的人——还有咪子。卡马克的这只猫一直是 id 的心病，在湖畔小屋的时候，她就从来不安分地呆在窝里，现在脾气还更加古怪，整天在办公室里四处蹦跶，闲游乱逛，当她把卡马克新买的皮沙发尿得惨不忍睹后，卡马克向id 的人们宣布了这个消息： “咪子给我带来的只有麻烦，我要把她送到动物收养所去。” “什么？”罗梅洛难以置信。咪子一直是卡马克密友，他们甚至已经把咪子作为卡马克的另一半列进了公司员工目录——现在，她就这么走了？“你知道你在做什么吗？”罗梅洛向卡马克问道：“没有人会要她,那些人会弄死她的！你这么做她就玩完了！” 卡马克不以为然地耸了耸肩，回到房间继续工作。 这样的规则适用于一只猫，或是一个程序，甚至，一个人：当它成为问题的时候，由它去，或者，必要的话，把它剔除掉。 编程这门学问是基于有限的资源而展开的，人们只能在当前的硬件和软件基础上进行开发。1992 年秋天，卡马克还在使用着 VGA 显卡，也就是说，屏幕上最多只能同时显示 256 种颜色，而他要使 Doom 的世界能够由近及远平滑地过渡到黑暗中。 解决的办法是巧妙地组合这 256 种颜色，也就是利用所谓的“调色板”。比如，可以在里面放入 16 种红色，从亮红到暗红。然后，卡马克根据玩家在房间里所处的位置，把不同的颜色应用到不同距离的墙壁上。如果玩家走进一个大厅或是露天空地，程序会做一次简要计算，把最暗的颜色应用到最远的地方，当玩家继续往前走时，程序还会动态地调整附近的亮度。就这样，Doom 的世界不但变得更加逼真，还更加阴森。 地图编辑器、关卡编辑器 第九章 最酷的游戏 法拉利的引擎只是卡马克试图使之变得更快的引擎之一，此外还有 Doom。尽管 Doom 已经很快了，但以他的标准来看还是不够，这个游戏在速度上还面临着很大挑战，譬如那些带贴图的地面和天花板，以及那些高低不一的墙壁。在移植《德军总部 3D》到超任的过程中，卡马克读到了一篇讲述二叉空间分割（BSP）算法的文章，贝尔实验室（Bell Labs）的一个程序员通过这种算法来更快地在屏幕上绘制出三维模型。用最简单的术语来说，这个算法就是把一个模型分割成大量的片断，每个片断的数据作为全局树状结构中的一个叶结点，然后程序就可以快速地筛选出需要绘制的多边形，避免无谓地重绘整个模型，从而提高了绘制的速度。当卡马克读到这里时，他忽然想到，如果用这个算法来绘制一个巨大的虚拟世界，而不是一个小模型的话，会是什么样？ 没有人做过——甚至可能都没有人想到过——这种尝试，毕竟，没有多少人在试图建造虚拟世界。通过把 Doom 关卡的几何数据分割成一棵巨大的 BSP 树，计算机就不必在玩家每次改变视角或位置的时候重新绘制所有叶结点，而只需绘制玩家面对着的那些物体。当这个改动完成后，卡马克那已经很快的 Doom，就可以起飞了。 id 的人们开始翻看应聘简历，寻找汤姆的继任者，凯文留意到一个看上去很不错的家伙，也是一个玩家：桑迪·彼得森（Sandy Petersen）。比起 id 的人而言，37 岁的桑迪就像是个老古董，但他在游戏领域有着令人敬佩的经验。他在 20 世纪 80 年代早期创作了一个名为《邪神召唤》（Call of Cthulhu）的纸上角色扮演游戏，里面有各种食人僵尸和毛腿异形，这个游戏曾风靡一时，总共卖出了十万多份。计算机游戏兴起后，桑迪进入了一家位于巴尔的摩的游戏公司：MicroProse，这家公司的创始人就是后来制作了历史策略类游戏《文明》的传奇人物：席德·梅尔（Sid Meier）。 1993 年 12 月 10 号，星期五，历史性的时刻到了。连续测试三十小时后，id 已经准备好把 Doom 上传到因特网上。一个名叫大卫·达特（David Datta）的好心人给 id 提供了文件服务器，他是威斯康星大学的系统管理员，这台服务器在他们校园网里。这事听起来很不错，因为大学总是带宽最充裕的地方，从而可以容纳更多的用户来下载。id 就是这么想的：先上传，让玩家们来下载它，然后他们会再把它不断地传播出去，这比起其他花大价钱的分发方式好太多了，玩家们相当于是帮了 id 一个大忙。而杰伊已经于头一天在聊天室里向他们宣布了这个消息：Doom 将在 10 号午夜钟声响起时放出。 第十章 Doom时代第十一章 雷神们 卡马克清楚地知道，他喜欢的事情就是——编程，他系统地安排着生活，以便把大部分时间都用于此。从制作 Doom 时起，他就决定开始调整生物钟，以达到一种更孤寂更专注的境界，以避开罗梅洛的尖叫，避开记者的电话，避开所有这些日常生活中使他分心的事物。他开始强迫自己每天睡觉前多熬一个小时夜，然后第二天再晚一个小时到办公室。到 1995 年初，他养成了他觉得最理想的作息规律：下午四点到公司，凌晨四点离开。为了 Quake，他得全神贯注才行。 计算机图形学的泰斗级人物：迈克尔·亚伯拉什（Michael Abrash），正是他的书，指引着卡马克和罗梅洛完成了他们早期的游戏， 第十二章 审判日 Doom 类游戏充斥了货架，并高据销售榜前列。卢卡斯工作室推出了基于《星球大战》主题的一款射击游戏：《黑暗原力》（Dark Forces）；Interplay 则发行了一款主视角飞行射击游戏：《天旋地转》（Descent）；一家名叫牛蛙（Bungie）的小公司制作了在苹果机上运行的《马拉松》（Marathon）；甚至汤姆·霍尔，这个在 id 时一心想让游戏富有内涵的人，也在为斯科特·米勒的天极公司开发一款名叫《龙霸三合会》（Rise of the Triad）的射击游戏。 [idsoftware.com]登录名：johnc真实姓名：约翰·卡马克主目录：/raid/nardo/johnc命令行解释器：/bin/csh从未登录计划： 这是我的日常工作…… 当我完成一件事情的时候，我就给它标上星号；当我发现一个错误或是某个尚未实现的功能时，我也会把它记在这里，一些问题在被解决之前可能会被多次提到。我会不时地整理这个列表，并在我已经修正好的问题前标上一个加号。 ——约翰·卡马克 二月十八日：―――――――――――――――― 调页错误 拉伸控制台 加快水中移动速度 杀伤力的方向性 盔甲颜色闪烁 杀伤力足够大时的碎尸效果 调整榴弹 加亮玩家昵称 钉枪造成的延迟 一场游戏结束时服务器端异常终止 记分牌 可选的全尺寸 平视键 视频模式 15 时的异常 状态栏上的弹药图标 程序出错时允许“重启” 重生时的血迹残影？ 火箭弹数量有时会出现负值 玩家携带宝物时的发光效果 作战室里依然硝烟弥漫，卡马克觉得应该让玩家们知道，id 真的是在 Quake 的道路上稳步前进着，于是他决定通过计划文件的方式来把他的工作日志发布到因特网上，计划文件原本只该用于开发者之间的互相沟通，而不是面向大众，但 id 迷们已经被罗梅洛早先的天花乱坠吊了太长时间的胃口，卡马克觉得，现在该给玩家们展示些过硬的数据了。 经过若干个礼拜的通宵苦战后，卡马克和他的良师益友迈克尔·亚伯拉什终于解决了那个恼人的蓝色虚空问题，屏幕上呈现出一个完整无暇的真三维虚拟世界。大功告成，卡马克会静静地盯着墙角，或是随意地在里面走动，他感受着这个世界的一致，这个世界的真实。1996 年 2 月 24 日，Quake 已经初具雏形，为了在玩家们各种不同的机器配置上进行测试，id 上传了附带一个死亡竞赛关卡的演示版。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"Doom启示录-读书笔记-01","date":"2016-11-29T05:37:14.000Z","path":"2016/11/29/Doom启示录-读书笔记-20161129/","text":"Doom启示录的读书摘要Masters of DOOM: How Two Guys Created an Empire and Transformed Pop Culture 读后感：卡马克和罗梅洛把他们各自的角色发挥到了极致，一个在精益求精地改进引擎，另一个则不断地发掘引擎的能力。一个专注于技术，另一个专注于设计。两个人只有在一起才是完美的，只可惜他们没能走到最后，我想如果他们彼此互让一步，站在对方的角度替对方多想一下，或许还会创造更大的辉煌。个人觉得，罗梅洛成功后的表现更贴近于常人，在未成功时努力拼搏，成功后享受硕果，但他的的确确做的过分了些；卡马克缺乏的却是沟通，与伙伴的沟通，以及缺少站在伙伴们的角度考虑，太自我，只专注于自己喜欢的领域和想法，不会向伙伴们妥协。 推荐序一Doom无疑是游戏行业划时代的天才级作品，是FPS品类乃至3D游戏的鼻祖。 推荐序二 约翰。卡马克（John Carmack）是入列“互动科学艺术协会名人堂”的天才极客，凭借《德军总部》《DOOM》被誉为“FPS之父”，他在计算机图像引擎以及游戏研发方面的贡献使其无愧殊荣。 约翰。罗梅洛（John Remore），与卡马克共同创立了id software，作为《德军总部》《DOOM》事实上的总设计师，罗梅洛总能第一个发觉卡马克历代引擎的潜能，并通过超然的设计理念将其呈现给所有玩家。两位约翰在《DOOM》开发过程中的分工合作，堪称这个行业最理想的典范和样板：前者代表游戏创意理念，后者代表游戏技术能力；前者让创意得以实现，后者让技术能够发挥最大效能。正式得益于两位约翰的卓越才华和默契配合，《DOOM》成为超越时代的殿堂级神作。相比而言，他们二人在产品研发合作和公司创业上的默契程度，绝不比上个世纪八十年代创立苹果电脑的乔布斯和沃斯尼亚克这两位史蒂夫逊色。然而，《DOOM》史无前例的成功，放大了两位伙伴性格上的差异，而这种差异最终导致了罗梅洛的离开。 《QUAKE》发布之后，卡马克认为罗梅洛没有做好他的本职工作，于是，发动所有股东辞退了他。而所有股东只能同意，他们认为引擎技术才是id的根本，换句话说，卡马克才是唯一不可缺之人。 启示并没有结束。新的启示，仍然不断发生在我们身边。 推荐序三 这本书出版在2004年。 书中写卡马克说，‘在信息时代，客观障碍已不复存在，所谓障碍都是主观上的。如果你想动手开发什么全新的技术，你不需要几百万美元的资金，你只需要在冰箱里放慢比萨和可乐，再有一台便宜的计算机和为之献身的决心。’这种浓郁的极客言论，虽然有点极端，但是我认为没有这样一种心无旁骛追求梦想的执着，在游戏行业也许是难以生存下去的。 两个启示：一是这两位游戏信徒卡马克和罗梅洛–用信徒来形容他们实不为过–在充满荆棘的游戏开发道路上如何做到颠覆，做到极致；二是时势造英雄。 推荐序四 从《Doom启示录》主人公之一–卡马克身上，你会发现一个真正游戏人的风骨：专注，热情，坚持，自律，黑客精神，以及更多。 不仅有与世界过招、与时间赛跑的理想、也有与朋友诀别、与商业和解的现实。 2013年，卡马克离开了一手创办的id，以CTO的身份加入Oculus VR，在虚拟现实领域大展拳脚。 推荐序五 从《德军总部3D》到《毁灭战士》（DOOM）到《雷神之锤》（Quake），每款游戏都呈现出革命性的，前所未有的畅快淋漓。 长年浸淫于图形编程中的他几乎达到了禅宗般的境界。2013年，卡马克离开了id software，至此id的创始人均离开了公司，回头望去，不禁让我想起苹果的广告词：向那些疯狂的家伙致敬他们特立独行他们桀骜不驯他们惹是生非他们格格不入他们用与众不同的眼光看待事物他们不喜欢墨守成规他们也不愿安于现状你可以赞美他们、引用他们、反对他们质疑他们、颂扬或是诋毁他们但唯独不能漠视他们因为他们改变了事物他们推动人类向前发展或许他们是别人眼里的疯子但他们确实我们眼中的天才因为只有那些疯狂到以为自己能够改变世界的人才能真正地改变世界 推荐序六 罗梅洛最后说，id是一间被技术所奴役的公司，他一直相信设计决定一切，他最终离开了id，开启他的“离子风暴”游戏设计公司之旅，主张设计决定一切，而他的自大与浮夸最终也将他的新公司带向失败的结局。 从Quake结束到现在，五年过去了，尽管罗梅洛和卡马克也经常在各种场合见面，但这是罗梅洛第一次找卡马克谈一件生意上的事情，一个创意，一款游戏。当罗梅洛走进房间时，卡马克一如往常坐在显示器前优化着下一代图像引擎。他的房间比以前大了不少，也更干净整洁，但仍然是那么简朴无华。 序 两位约翰 《毁灭战士》（Doom）和《雷神之锤》（Quake），是以第一人称视角的方式来模拟现实世界里彩弹射击游戏的计算机程序。它们开创了一种被称为“主视角射击”的计算机游戏类型.** 29 岁的卡马克是一个计算机程序员，一个清心寡欲并且乐善好施的人，一个在业余时间里建造高能火箭的人，比尔·盖茨（Bill Gates）心目中为数不多的天才之一。程序代码的优雅清晰是他的追求，也是他的游戏。32 岁的罗梅洛是个自大的游戏设计师，他那坏孩子般的形象使他成为了游戏界的明星，为了实现他心目中那些狂野的幻景，他愿意付出一切代价，甚至是他的名望。卡马克在他们分手时有过一句简短的描述：“罗梅洛想建立一个帝国，而我只想写出优秀的程序。” 第一章 摇滚明星 11岁罗梅洛最喜欢的《行星撞击》（Asteroid）他的全名阿方索·约翰·罗梅洛（Alfonso John Romero）的首字母缩写 AJR 占据着那里《行星撞击》游戏高分榜的榜首 D&amp;D，或者是全称《龙与地下城》，于 1972 年由两个二十几岁的年轻人加里·盖克斯（Gary Gygax）和戴夫·阿纳森（Dave Arneson）创造，然后很快发展成一种地下文化现象，尤其是在大学校园里，人们的相互转告使它得以迅速传播。一个名为詹姆士·达拉斯·艾戈珀特（James Dallas Egbert）的学生还于某天消失在密歇根湖底的下水道里，据传是为了进行现实中的 D&amp;D 冒险。汤姆·汉克斯（Tom Hanks）主演的一部名为《迷宫和妖怪》（Mazes and Monsters）的电影就取材于这个事件。这类游戏还带动了世界各地的家庭手工业，每年相关的小说、游戏、T 恤、规则手册的销售额达到了 2500 万美元。 第一个计算机游戏于 1958 年在一个听起来不太可能的地方出现——美国政府的核实验室。威利·海金博塞姆（Willy Higinbotham）是这个位于纽约长岛的美国能源部布鲁克海文（Brookhaven）国家实验室的头，为了打消周围农场主们对这个建在他们家门口的核实验室的担心，他得筹划一次巡回演说，所以他就琢磨着弄个什么东西来博得他们的好感。于是，他和同事一起用计算机在圆形的示波器上制作了一个非常简陋的网球模拟程序，他给这个游戏命名为《双人网球》（Tennis for 2），其实只不过是一个白色的圆点在一条白线两边跳来跳去。农场的人们对这个新鲜玩意惊讶不已，但威利他们回到实验室以后就把机器拆除了。 三年后的 1961 年，史蒂夫·斯拉格·拉塞尔（Steve “Slug” Russell）和其他麻省理工学院（MIT）的学生在第一台小型机 PDP-1 上创作了一个名为《空间战争》（Spacewar）的游戏，游戏里两个玩家在黑洞中漂移，同时用火箭弹互相射击。十年后的 1971 年，波士顿一个程序员，同时也是一个洞穴探险爱好者，威尔·克劳瑟（Will Crowther），创作了一个模拟洞穴探险的文本游戏。一个在斯坦福大学的名叫唐·伍兹（Don Woods）的黑客看到了这个游戏后，向他询问是否可以在上面做一些改动，加入更多的神话元素，然后就有了《洞穴深处的冒险》。这个游戏引发了文本冒险游戏的热潮，全国各地计算机实验室里的学生们和黑客们不光是玩它，还修改它，制作出了各种各样新的故事，有的甚至跳出了《龙与地下城》的背景，譬如在《星际迷航》（Star Trek）的世界里展开探险。 罗梅洛是成长于 20 世纪 80 年代的第四代游戏黑客。第一代是五六十年代那些在小型机上做开发的麻省理工的学生们，七十年代硅谷和斯坦福的接力者们是第二代，八十年代早期的一些刚起步的小游戏公司算是第三代。 苹果 II 型机（Apple II）。它的前身苹果机于 1976 年首次在一个加州的计算机俱乐部被介绍给世人它尤其适合于用来玩游戏和制作游戏，这一切都得感谢苹果公司的两位创始人，史蒂夫·乔布斯（Steve Jobs）和史蒂芬·沃兹涅克（Stephen Wozniak），或者叫，两个史蒂夫。 第一代苹果机是在 1976年给“家酿”（HomeBrew）计算机俱乐部会员们用的一个原型，价格高达 666.66 美元。接下来 1977 年出产的苹果 II 型机则是针对普通用户的，它带一个键盘，兼容 BASIC 语言，最重要的，它的图像是彩色的，尽管它没有硬盘驱动器，但它随机附送了两个在现在看起来很简陋的游戏手柄——它就是用来玩游戏的。 罗梅洛十六岁了，他渴望着通过他的游戏取得成功。在经过屡试无果的八个月投稿后，1984 年 3 月 5 日，一个《苹果汁》（InCider，“内行”）杂志的编辑说他们决定要出版罗梅洛的一个名为《搜寻侦察兵》（Scout Search）的游戏。这是个低分辨率的迷宫游戏，玩家——游戏中的一个点，需要赶在灰熊——另一个点——的前面，把侦察兵们——若干个点——集合到一起。它看上去很普通，但很好玩。 罗梅洛迫不及待地想和他居住在犹他州的生父分享这些成功，他草草地做了张信纸，抬头是只有他自己一个人的所谓公司的名称：顶级思想软件（Capitol Idea Software），在信里，罗梅洛讲述了他发表的东西，他赢得的竞赛. 第二章 火箭科学家 约翰·卡马克是个很晚才开口说话的孩子，他父母亲的担心一直持续到 1971 的一天，这个 15 个月大的男孩拿着一块海绵蹒跚着走进客厅，说出不光是一个单词而是一个完整的句子：“爸爸，你的洗澡巾。”就好像他一直不屑于说单个的词，而非要等到能用它们组合出完整的句子才肯开口。 小约翰·卡马克出生于 1970 年 8 月 20 日，小名约迪。 《黑客：计算机革命的英雄们》（Hackers: Heroes of the Computer Revolution）是卡马克的启示录。 BBS 大约诞生于 1978 年。沃德·克里斯滕森（Ward Christensen）和兰迪·瑟斯（Randy Seuss）这两名黑客编写了第一个能在两台计算机之间通过电话线传输数据的软件，从而一台计算机可以“呼叫”另外一台并进行信息交换。在 20 世纪 80 年代，BBS 迅速传播开来，并形成了有史以来真正意义上的虚拟社区，在这里，人们可以对换或是交易软件，并通过在论坛里发布信息进行“交谈”。 《造影》（Shadowforge）是他的第一个游戏，在很多方面都和《创世纪》很相像，但有几个很独特的创新，譬如角色可以朝任意方向攻击。主营电池的“夜鹰”（Nite Owl Productions）公司花一千美元购买了它，这是卡马克平生第一笔收入，他用这笔钱把他的苹果机升级到了苹果II GS。 卡马克的第二个游戏——《鬼魂》（Wraith）。 第三章 侵犯版权的戴夫 和罗梅洛一样，雷恩也只想做游戏，他自己的公司名叫蓝山科技（Blue Mountain Micro），和罗梅洛的“顶级思想”一样，雷恩是蓝山科技的光杆司令。在新罕布什尔的时候，他们合并为“深思软件”（Ideas from the Deep）。 罗梅洛告诉艾尔，他过去一年里都在关注各种 PC 游戏的事物，他觉得这里面有很大的发展空间，因为那个时候 PC 机还不如苹果机强劲，所以它上面的游戏毫无亮点——全都是些简陋的静态画面，跟苹果机上面那些丰富多彩的游戏根本没法比。现在正是出手的好时机。艾尔赞同罗梅洛的想法，他建议发行一份游戏特刊，每月一期。 雷恩将会成为这个名为《玩家之刃》（Gamer’s Edge）的 PC 游戏双月刊编辑 罗梅洛、雷恩和卡马克这三个程序员几乎是一见面就开始了关于游戏编程的热烈讨论，从苹果机上 16 位图像模式下的双倍分辨率，到 8086 汇编语言的技巧，他们一刻不停地谈论着，不光是计算机方面的东西，还有其他方面的共同爱好：《龙与地下城》、《行星撞击》、《魔戒》。卡马克讲到他小时候是多么渴望拥有一台计算机，罗梅洛听了后说：“伙计，我那时候要是能给你买一台就好了。” 卡马克完全没有预料到能遇上和他一样聪明的人，尤其是在编程方面。这两个家伙不光是能侃，他们的确知道比卡马克更多的东西。“他们不只是和我差不多，他们比我还要优秀。”卡马克想道。罗梅洛是个让人振奋的家伙，不光是他编程的水平，还有他其他方面的能力——他的艺术天分、他的设计创意。 《危险的戴夫》是罗梅洛在 1989 年给《新时代》做的，这是款简单的冒险类游戏，玩家在游戏里是一个穿着紫色紧身衣戴着绿帽的小人——屏幕上的几个像素，他需要连跑带跳地穿过各种迷宫，搜集珍宝，当然前提是保住性命。这和罗梅洛很欣赏的一个叫《大金刚》（Donkey Kong）的任天堂街机游戏很类似。 《墓窖》是卡马克继《造影》和《鬼魂》之后最新的一款角色扮演游戏，卡马克显然是受了街机游戏《金手套》（Gauntlet）的影响。在那个流行的游戏里，玩家要在迷宫里射击、施魔法，杀出一条血路，它就像是《龙与地下城》的动作版。这也是罗梅洛和卡马克的一个共同点：他们都喜欢动作类的街机游戏，他们渴望着自己也能做出那样的游戏，而且，他们对自己的能力充满自信。 但对罗梅洛，这自由生活的背后其实隐藏着难言的苦衷——他离婚了。未来富翁这个目标对二十二岁的罗梅洛来说已经是一个不小的挑战，更别提同时还要做一个合格的丈夫和父亲。但凯俐对罗梅洛所热爱的游戏毫无兴趣，她的情绪变得愈发消沉，她想要家庭晚餐、到教堂做礼拜、周末野餐，而罗梅洛又对这些事情打不起精神。他也曾尝试着使事业和爱情能双丰收，他甚至在其他同事还在干活的时候就提前离开办公室。但家庭生活是个无底洞，罗梅洛不知道他有没有那么多的时间和精力，尽管他也想拥有一个他儿时没有的美满家庭，但他有时又觉得自己天生不是那样的好老公和好爸爸。最后他和凯俐都认为只有分手是对大家都好的办法，但凯俐不止要分手，她还要回到加州的家里，罗梅洛听到她这个决定后几近崩溃，他同时还得知孩子们也不会和他生活在一起。但他安慰自己说距离远一点没什么关系，只要有心，就算隔着几个州，孩子们和他之间的距离肯定能比他儿时和父亲之间的距离要近。 卡马克和罗梅洛在移植游戏的过程中完成了磨合，他们找到了最能互相取长补短的合作方式。卡马克最感兴趣的是编写游戏的核心部分——引擎，这个模块负责指示计算机如何在屏幕上显示图像。罗梅洛乐于做各种辅助工具，由此他们才能制作出游戏的角色、环境、地图，此外，罗梅洛还喜欢做游戏设计，譬如游戏是如何操作、打斗是什么样子、怎么个玩法最有意思。他们两人就像阴和阳那样和谐互补：卡马克编程很有天分，而罗梅洛则擅长设计以及美工和音效。 小艾德里安的心灵还遭受着一些其他事情的冲击。他的父亲，本地一家餐饮公司的腊肠销售员，在艾德里安十三岁的时候因心脏病突发去世，这使得本就沉默敏感的艾德里安愈发的乖僻，尽管他那做信贷员的母亲和两个妹妹尝试过帮助他，但他还是逃避到绘画的世界里，他还养了一个蝎子作为宠物。对于这样的一个孩子，萦绕在他心头的自然都是一些黑暗的主题。 在艾德里安上大学的时候，他经历了更为真实的体验。为了挣钱念书，他在本地一家医院做起了助手，他的工作就是冲洗那些在急救室里拍下的病人照片，那全是疾病和惨祸——他看到严重的褥疮导致的皮肤脱落，他看到枪伤，他看到残肢断臂。有一次他甚至看到一根栅栏柱穿过一个农夫的腹股沟，照片质量很好，非常清晰，他拿了几张卖给朋友。 他的绘画变得更加阴暗，但也更具水准。他在大学的美术导师列莫恩斯·巴坦（Lemoins Batan）很赏识他的才能，尤其是他的准确和看似毫不费劲的精细。当列莫恩斯问他想做什么的时候，艾德里安说他以后就想从事美术行业，他正在积累这方面的经验，列莫恩斯告诉他，听说《软盘》正在招人。 罗梅洛和卡马克向艾尔建议下一期《玩家之刃》最好只做一个游戏，一个全新的大型商业游戏，艾尔同意了，放手让他们去追逐他们的梦想。尽管两个月的时间对于一个这样的游戏来说仍然很紧，但现在他们人员都已各就各位——卡马克负责引擎，罗梅洛负责游戏设计以及制作辅助工具，艾德里安做美工，雷恩负责协调管理的同时也做一些零碎的编程，看起来他们可以做到。 下一个游戏的点子是卡马克提出来的。他正在尝试一项编程上的突破：让游戏的世界不再局限于屏幕的边界——所谓的“卷轴效果”。街机是这项技术的样板，早期街机游戏的移动也是局限在一个静态的屏幕内，譬如《乒乓》，用于把球击来击去的球拍只能在屏幕的底部和顶部之间移动，再譬如《吃豆子》里的迷宫，也是局限于屏幕那么大，还有《太空入侵者》，玩家控制的飞船只能在屏幕下方左右移动，外星飞船们则是从屏幕顶部涌现。所有这些游戏都把玩家局限在那一小方天地里，缺乏一种宽广的可延伸的感觉，这种状况一直持续到1980 年，在那一年，威廉斯公司推出了一款名叫《防御者》（Defender）的街机游戏，这是第一个流行的卷轴游戏，在这个科幻射击游戏里，玩家不再受屏幕大小的限制，他操纵飞船在行星的表面水平移动，一路上击落敌机营救人质，屏幕上的一幅小地图显示着玩家在整个世界里的当前位置。如果把地图扩展为正常尺寸，这个世界大概有三个半屏幕那么大。与其他街机比起来，《防御者》显得宏大得多，玩家就像进入了一个更为广阔的虚拟空间。它很快变得和《太空入侵者》一样流行，还胜过《吃豆子》成为了业界的年度游戏。无数的卷轴游戏随之出现，到 1989 年的时候，卷轴技术已经是新游戏的一项必不可少的标准，这其中最成功的莫过于任天堂红白机上的《超级马里奥兄弟 3》（Super Mario Brothers 3）。 但在那时，1990 年 9 月，还没有人研究出如何在 PC 上实现卷轴效果，大家都用一些蹩脚的技巧来让玩家觉得游戏的世界比屏幕要大，譬如当玩家移动到屏幕最右边的时候，游戏会停顿一会，然后右边的场景出现在屏幕上。部分原因是 PC 的性能还很差，无论是街机还是苹果机，或是任天堂那样的家用机都比 PC 强不少。而卡马克下定决心要找出一种办法来在 PC 上实现像《防御者》或《超级马里奥》那样的平滑卷轴效果。 《玩家之刃》的下一个游戏就要朝着这个方向走。当大伙聚在一起讨论的时候，卡马克给他们演示了他最新的成果，他已经可以让屏幕上的内容平滑地往下方移动，和那些成熟的卷轴游戏比起来，这项技术还很粗糙，它就像是一条传送带，图像按照固定的速度和路线落下，玩家还不可能随心所欲地在里面畅游，那就像是拖动演员背后的舞台布景。 他们给游戏命名为《搜捕》（Slordax），一个简单的飞船射击游戏，就像《太空入侵者》或《小蜜蜂》（Galaga）一样。 他们有四个星期的时间。从一开始他们就配合得非常默契：卡马克紧张地修改图像引擎的代码，罗梅洛编写制作角色和关卡的工具，当卡马克差不多的时候，罗梅洛也开始了游戏性的设计。汤姆经常摸进他们的办公室来做一些角色和背景。艾德里安也在屏幕上画出了飞船和行星的草图，罗梅洛看到后立刻就觉得这个沉默的临时工是个才华横溢的家伙。 《搜捕》已经很圆满地结束了，卡马克正开始研究新的东西，他是个天生的夜猫子；他喜欢在办公室里呆到凌晨，他喜欢那种宁静，那种孤寂；他喜欢那种可以让他更加融入到工作中的感觉，他很开心，他做着他一直以来想做的事情：编写游戏。在这种时候，他根本不会去想以后会怎么样，如果他能就这么编写游戏并且有足够的钱买比萨和书，他就很满足了。他很早就说过，只要给他一台计算机，一些比萨和可乐，哪怕把他锁到柜子里，他也可以过得很好。 当汤姆在卡马克身边坐下时，卡马克给他看了他正在做的东西，一种可以把动画应用于游戏背景的技术。计算机屏幕是由许多像素组成的，一组像素则可以构成一个图素（tile），美工们首先用像素来画出图素，然后再用创作好的图素来搭建整个世界，这就像是给厨房铺瓷砖（tile）。而卡马克刚找到了一种可以让这块瓷砖上的图像动起来的办法，“而且，”他对汤姆说，“我还可以在你们接触到某块图素的时候激活一些事件”。 “这个东西做起来简单么？”汤姆问道。 “当然，嗯”卡马克回答说，他只需要加一些代码来处理这个事件就行了。汤姆清楚地知道这会是多么惊人，因为《超级马里奥》之类的游戏靠的就是动画背景，而且，当玩家跳起来顶到某块闪烁着的砖头时，会触发一些事件，譬如落下若干金币。想到这里，汤姆来了精神。而卡马克要给他看的还不止这些。 卡马克在键盘上敲了几下，向汤姆展示了他的另一项成就：平滑的卷轴效果。这种由《防御者》和《超级马里奥》带来的技术，能够在玩家走到屏幕边缘的时候通过背景卷动让玩家体验到一个连续的世界。经过几个夜晚的尝试，卡马克终于在 PC 上也实现了这种效果。和往常一样，他用了一种独特的手段。很多人会一上来就试图走捷径，卡马克觉得这不是解决问题的方法。他一开始先试了最直接的途径，在整个屏幕上重新绘制图像，但行不通，因为那时的 PC 实在太慢了。然后他尝试着优化——可以通过多使用一些内存来换取性能的提高吗？他试了几次，发现这也是死路一条。 最终卡马克冷静了下来，从头开始考虑，“我要的是什么？——我要在玩家穿过游戏的时候图像能够平滑地移动。”他回想起他以前做的《墓窖》，在那个游戏里，当玩家走到屏幕上地牢边缘时，他会让背景做一次很大的调整，这种基于图素的卷动在当时是很常见的技术，而他现在要的是基于像素的卷动，哪怕玩家只移动了一点点，背景也要随之调整。问题是如此频繁地重绘远远超出了当时 PC 机的能力，但卡马克很快找到了突破口。 如果，卡马克想道，不是每次重绘整个屏幕，而是只重绘那些真正改变了的部分，会怎么样呢？那样的话，卷轴效果执行起来会快很多。他盯着屏幕，假想着一个由蓝天白云组成的背景，玩家跑向屏幕右边，如果它跑得足够远，那些云朵将会被它逐渐抛在身后，直到从屏幕上消失，尽管改变的只是一片白云，大部分蓝色的区域没有变化，但计算机不知道这些细节，它不知道其实有更快捷的办法，它只会笨拙地重绘每一个组成蓝天的像素，从屏幕的左上方开始，一个像素一个像素地往右，再一行行往下，直到完成整个屏幕。接下来卡马克就干了一件漂亮的事情，使得效率得到极大的提高。他写了一段代码，用来哄骗计算机，让它觉得譬如左数第七块图素其实是屏幕上的第一块，这样的话，卡马克就可以让计算机在他指定的地方开始绘制图像，计算机就可以直接绘制白云，而不需要再一个像素一个像素地填充蓝色的天空。为了确保玩家移动时感觉到平滑的效果，卡马克还想出了一个小技巧：让计算机在屏幕右边以外的地方画一块额外的天空，这其实是画在计算机的显存里，但当它们真正进入屏幕的时候，它就不再需要重新绘制，而是直接从显存里反映到屏幕上。卡马克把这个过程叫做“图素自动刷新”。 汤姆立刻感觉到了这技术的潜能：这意味着他们可以在 PC 上做出《超级马里奥》！还没有任何地方的任何人做过这样的事情，而他们现在就可以做出来，就在这里，就在现在，在 PC 上实现他们最喜欢的游戏。这简直是颠覆性的革新。 罗梅洛按下方向键，戴夫开始沿着地面走动，就在背景开始平滑卷动的一刹，他整个人呆住了。罗梅洛几乎喘不过气来，他简直无法相信屏幕上发生的事情，他就坐在那里用手指摁住键盘，控制着戴夫在场景里来回走动——这难道是真的？难道卡马克这小子原模原样地做出了任天堂的东西？难道我们实现了世界上每一个玩家都曾有过的想法？我们在 PC 上有了这样的突破？天哪，它将带给我们马里奥带给任天堂的那些东西——凭借着《超级马里奥》，任天堂就即将要取代本田（Toyota）成为日本最成功的公司，它每年的销售额达到了十亿美元。宫本茂（Shigeru Miyamoto），这个马里奥系列的创作者，本是个不名一文的乡下孩子，现在已经变成了游戏界的沃尔特·迪斯尼（Walt Disney），《超级马里奥兄弟 3》卖出了一千七百万份拷贝，相当于十七白金的记录——这是迈克尔·杰克逊（Michael Jackson）那种流行巨星才能做到的事。罗梅洛被这突如其来的惊喜击溃了，他动弹不得，甚至都站不起来。直到卡马克几个小时后回到办公室，他才有力气说话。他只有一件事要告诉他这个朋友，这个编程天才，这个绝配般的搭档：“不用想了，我们走人！”","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://sniperkaka.com/tags/读书笔记/"}]},{"title":"vim cheat sheet for programmers print","date":"2016-11-25T06:15:58.000Z","path":"2016/11/25/VimCheatSheetForProgrammersPrint-20161125/","text":"vim cheat sheet for programmers print","tags":[{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"}]},{"title":"Markdown语法快速入门","date":"2016-11-24T06:38:05.000Z","path":"2016/11/24/Markdown语法快速入门-20161124/","text":"Markdown语法说明快读入门-笔记截图 参考链接 Markdown-Syntax-CN–githttps://github.com/riku/Markdown-Syntax-CN Markdown语法说明（简体中文版）http://www.appinn.com/markdown/ Markdown语法说明快速入门http://www.appinn.com/markdown/basic.html Dingus在线转换工具–Markdown 格式转成 XHTML格式链接","tags":[{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"}]},{"title":"我家的新成员-二炮大人","date":"2016-11-23T05:40:22.000Z","path":"2016/11/23/我家的新成员-二炮大人-20161123/","text":"二炮是媳妇2016年11月05日考完试后在路边捡回来的流浪狗。据媳妇说，二炮也就两个月的样子，至于怎么看出来的，我就不知道了，一直持怀疑态度，哈哈~umm…二炮这高大上的名字是我思忖两天想出来的。毕竟是要跟随一生的名字，怎可儿戏… 昨晚正式任命二炮为我家三当家的。上几张二炮最近的靓照：瞧瞧二炮这忧郁的小眼神…哎呦卧槽~刚发现这货的嘴被我那腹黑的媳妇用皮筋给绑瓷实了…这下可不能到处乱啃了… 刚来到家的时候很喜欢这个呼啦圈，这是她第一个最喜欢的东东 后来给她买了个网球玩儿，这是她最近最爱的玩具 超喜欢酸奶，至今我也没搞明白她是喜欢舔酸奶盒底，还是喜欢顶酸奶盒子玩儿，狗的世界岂是卡卡大魔王能懂的？就不能让她来屋里玩啊，每次进来玩儿就弄的地面一片乱乱脏脏的…","tags":[{"name":"生活","slug":"生活","permalink":"http://sniperkaka.com/tags/生活/"}]},{"title":"两个人的周末","date":"2016-11-19T15:12:05.000Z","path":"2016/11/19/两个人的周末-20161119/","text":"此二货也够无聊，吃块蛋糕也要摆拍，哈哈哈…PS:其实床边还有二炮，没有把她拍进来…","tags":[{"name":"生活","slug":"生活","permalink":"http://sniperkaka.com/tags/生活/"}]},{"title":"个人博客搭建 hexo + github","date":"2016-11-18T09:52:32.000Z","path":"2016/11/18/20161118-个人博客搭建/","text":"umm…暂时没更新上来…","tags":[{"name":"环境搭建","slug":"环境搭建","permalink":"http://sniperkaka.com/tags/环境搭建/"},{"name":"工具","slug":"工具","permalink":"http://sniperkaka.com/tags/工具/"}]},{"title":"博客搭建成功后的第一篇日志","date":"2016-11-18T01:11:46.000Z","path":"2016/11/18/个人博客的第一篇-20161118/","text":"博客搭建成功后的第一篇日志个人博客终于搭建成功了，并绑定了自己申请的域名(www.sniperkaka.com)超开心，打算以后的读书笔记及生活点滴记录在这里。希望来此的朋友有所收获~ 加油！！！","tags":[{"name":"杂七杂八","slug":"杂七杂八","permalink":"http://sniperkaka.com/tags/杂七杂八/"}]}]